[
  {
    "title": "This app s-cks",
    "review": "Doesnt work.  Waste of time.",
    "rating": 1,
    "userName": "OttoSaab",
    "date": "2026-01-14T18:29:08-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Error",
    "review": "After scanning and clicking done the app is reporting not enough memory error. Cannot save the file. Please fix so we can resume to use scan function on app.",
    "rating": 1,
    "userName": "Gu1u",
    "date": "2026-01-14T05:58:09-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Excelente",
    "review": "Excelente",
    "rating": 5,
    "userName": "Antcint",
    "date": "2026-01-13T20:31:41-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Never connect to wifi",
    "review": "If you like typing a long network password over and over on a tiny screen with only up and down arrows, this is the printer for you!",
    "rating": 1,
    "userName": "BBuckler",
    "date": "2026-01-13T13:53:20-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Can’t print BW only?",
    "review": "You have totally destroyed my printer not allowing me to print just BW. Holding me hostage to buy a yellow cartridge. I cannot believe you guys just killed a great experience one had with his printer for over a year. What a pathetic update. You guys suck. Truly.",
    "rating": 1,
    "userName": "IvannaGolfer",
    "date": "2026-01-11T16:59:40-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "I love my new (first) printer ever",
    "review": "So happy with my Brother printer",
    "rating": 5,
    "userName": "Carro 🚗",
    "date": "2026-01-11T07:23:25-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "It doesn’t work",
    "review": "It never wants to print. It says that it’s connected to the printer but it fails every time. I have tried to troubleshoot it several times with no luck.",
    "rating": 2,
    "userName": "GingerBeerd LLC",
    "date": "2026-01-10T06:53:19-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Hard to setup",
    "review": "Scan option is taking me hours to fogure out. Old printer was much easier",
    "rating": 1,
    "userName": "Acopper",
    "date": "2026-01-08T17:26:08-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "These printers suck. They never do what they’re supposed to. They’re always broke.",
    "review": "I feel like going all Office Space on this printer.",
    "rating": 1,
    "userName": "hockinghillscabins",
    "date": "2026-01-08T16:44:58-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Does Not Work",
    "review": "App wouldn’t work to set up a printer. Tried multiple times + restarted phone, app, and the printer. Just keep getting time outs. Set up printer manually. Now the app can’t even find the printer. Web UI for the printer works fine tho. And AirPrint works too so no need for this broken app.",
    "rating": 1,
    "userName": "philipamour",
    "date": "2026-01-08T08:09:50-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Few customizable print settings on machine or in app",
    "review": "When we shopped for this machine, I told the salesman at Office Depot that I definitely wanted to be able to print the occasional photo at home. And I was concerned that this machine would not print adequate photos. He told me that if I printed on photo paper I wouldn’t be able to tell the difference between an inkjet and a laser printer. I printed a photo today on glossy photo paper and it does not look great. My main concern is that nowhere on the machine nor in the app, do you have an option to set the paper type for photo paper of any kind. I thought that might improve the quality of the printed photo but I guess I’ll never know.",
    "rating": 1,
    "userName": "Tmkos",
    "date": "2026-01-08T06:25:15-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Worse software",
    "review": "Worse kind of software. Doesn’t work on iPhone or computer",
    "rating": 1,
    "userName": "Taahahmed",
    "date": "2026-01-06T15:15:35-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "File Name",
    "review": "Ever since last update for machine software and app, I have not been able to change the file name within the scan and save process of the app.\n\nUpdate after contacting support via chat.\nSupport is a joke. They want to know if I tried any troubleshooting steps. Really? It is awesome to know brother no longer stands by there products or customers.",
    "rating": 1,
    "userName": "HXT303",
    "date": "2026-01-06T06:48:37-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Problemática la aplicación",
    "review": "Desde el principio fue complicado ya tengo registrado el printer y no funciona. Es la primera vez que me pasa con un printer.",
    "rating": 2,
    "userName": "Bonita Gatiña",
    "date": "2026-01-05T10:30:30-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Print options",
    "review": "Difficult to use.  Must reconnect manually each time I print. A waste of time and money!",
    "rating": 1,
    "userName": "Rehabdr",
    "date": "2026-01-03T06:24:21-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "So easy",
    "review": "So easy to use! I usually struggle with technology but no issues with this one!",
    "rating": 5,
    "userName": "ffghjhvg",
    "date": "2026-01-02T08:02:27-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "A little to hard with the push for subscriptions",
    "review": "Simple app. But the push to want you to sign up for a subscriptions is unhinged",
    "rating": 4,
    "userName": "SiiBizzle3",
    "date": "2025-12-30T21:00:46-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Error when I hit click scan, no clear solution on website",
    "review": "Overall, this scanner has been great and initial set-up was easy. Lately, I keep getting a connection error when I click scan that says “Cannot Connect\nMake sure your machine is connected to the same network that the mobile device is connected to.” However, both devices are connected to the WiFi. The app is fully updated. I can’t seem to find any info on how to troubleshoot this on the website and wasn’t able to find what the current firmware should be.",
    "rating": 2,
    "userName": "Nicole_review",
    "date": "2025-12-29T13:53:03-07:00",
    "version": "1.22.1",
    "country": "us"
  },
  {
    "title": "Brothers is the Best",
    "review": "2nd Brothers printer I’ve had with a long shelf life.  Great product, great price.  I’m a fan for life.",
    "rating": 5,
    "userName": "NystaMecha",
    "date": "2025-12-27T17:23:35-07:00",
    "version": "1.22.0",
    "country": "us"
  },
  {
    "title": "Ended support for older phones",
    "review": "Everything worked fine until a forced update that ends support for older devices. There’s no good reason to make working devices suddenly obsolete and prevent installed printing and scanning software from operating as it had before. Aside from that, I love my Brother printer, which is weird to say because every other printer I’ve owned or used has brought angst. This printer works beautifully, conveniently (besides needlessly deprecating my old phone), and reliably. The printer has been an actual joy to use, without all the four-letter words that accompanied every 10th print job with my old Canon printer. The software on PC and mobile works pretty well, but I wish I could still print and scan with my phone and iPad—it’s ridiculous that I now can’t. \n* I’d like to add that it’s weird that the app on my Windows PC is iPrint&Scan, and there’s an app of the same name for iOS that somehow doesn’t support my printer. The differentiation between this and that app is unclear and confusing, plus maddening that I can no longer use either.",
    "rating": 2,
    "userName": "Dalianguy",
    "date": "2025-12-20T18:05:25-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Not getting IOS 17!!!!",
    "review": "Make this app still useable for those of us who don’t like to be forced to buy a new phone just to use it !!!  I cannot upgrade or buy a new phone just to use this app !  It’s not right",
    "rating": 1,
    "userName": "Staple22",
    "date": "2025-12-19T10:31:04-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "i just want to print",
    "review": "this is the worst app and printer if you’re the type of person who doesn’t want to sit there and wait for the app to load for 30 minutes just to shut down the second you switch pages trying to make an account. i know toddlers that can program better",
    "rating": 1,
    "userName": "coal h",
    "date": "2025-12-16T11:41:34-07:00",
    "version": "1.22.0",
    "country": "us"
  },
  {
    "title": "First printer app",
    "review": "Really helpful and easy to set up",
    "rating": 5,
    "userName": "VexingFall",
    "date": "2025-12-14T21:20:19-07:00",
    "version": "1.22.0",
    "country": "us"
  },
  {
    "title": "This software is ridiculous",
    "review": "Why can’t they make a printer in 2025 that just works?",
    "rating": 1,
    "userName": "Expeditions Alaska",
    "date": "2025-12-13T20:43:30-07:00",
    "version": "1.22.0",
    "country": "us"
  },
  {
    "title": "Will not connect to multiple devices",
    "review": "Horrible connection abilities!!",
    "rating": 1,
    "userName": "Cannotuseanynickname!!!",
    "date": "2025-12-11T14:30:14-07:00",
    "version": "1.22.0",
    "country": "us"
  },
  {
    "title": "TERRIBLE",
    "review": "Personally had a lot of issues with the printer like it would print but without the picture basically an empty paper sometimes it just wouldn’t print but the quality of printing like the picture is really good when you print it just wish it didn’t have these issues",
    "rating": 1,
    "userName": "JustJumana",
    "date": "2025-12-11T04:50:49-07:00",
    "version": "1.22.0",
    "country": "us"
  },
  {
    "title": "Hate everything now",
    "review": "App used to work great then they wanted me to update the printer firmware. I did that. Then the app printing icons went away and it constantly says the printer is offline. I started to have issues printing from my laptop as well at the same time-obviously not app specific. I wouldn’t suggest this setup to my worst enemy at this point.",
    "rating": 1,
    "userName": "Angietsalagi",
    "date": "2025-12-10T23:35:11-07:00",
    "version": "1.22.0",
    "country": "us"
  },
  {
    "title": "so bad",
    "review": "listen. can you please test your own app? i tried to do a firmware update but the keyboard on the iphone is in the way. did u even test the ability to do the firmware update on ios? and why there is a password needed for a firmware update is just bizarre.",
    "rating": 1,
    "userName": "Joe a527",
    "date": "2025-12-08T10:09:23-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "UX Flaw w/ Subscription Offer",
    "review": "Added too much friction to app/printer use because of multiple subscription screens user is required to click through to use an already purchased product. Terrible UX decision.",
    "rating": 1,
    "userName": "LimaBeta05",
    "date": "2025-12-05T18:42:35-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Management",
    "review": "It’s a great printer top tier",
    "rating": 5,
    "userName": "Lords wheel press",
    "date": "2025-12-03T22:04:34-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Common Issue",
    "review": "ALWAYS HAVE ISSUES PRINTING OVER WIFI",
    "rating": 1,
    "userName": "jumpnjacks",
    "date": "2025-12-01T11:55:05-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Hate this printer",
    "review": "Have to reset every time I use it, when it works",
    "rating": 1,
    "userName": "old floyd-head",
    "date": "2025-11-30T17:40:42-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Brother printer is exceptional!",
    "review": "I purchased my first Brother printer after years of using the competitor’s brand. I will never go back. I have the MFC-J4335DW model and it is outstanding for print quality, size, capacity of toner cartridges, and speed. I am sold!",
    "rating": 5,
    "userName": "Dr Afm",
    "date": "2025-11-30T01:01:56-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Disconnect from internet",
    "review": "Very poorly designed app. I had to delete and reinstall to set up the internet again. It would not connect to the internet and not print.",
    "rating": 1,
    "userName": "war1444",
    "date": "2025-11-29T15:30:43-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Not Intuitive Setup",
    "review": "Had to go through the full setup process on phone and then again on tablet since there is no simple login. Also not straightforward to setup. Printer has to be manually added despite already being connected to the same network in advance.\n\nThis printer is also extremely unreliable. I can rarely just print a document from my email, even when I’m standing right next to this printer. I regret “upgrading” to this extremely heavy hunk of trash.",
    "rating": 1,
    "userName": "shanda.tx",
    "date": "2025-11-28T07:58:46-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "DCP-L2640",
    "review": "Just purchased this combo printer. I am no Neanderthal to computers and have  used and set them up for 40 years or so   Forget what you see on YouTube. I have been playing with the setup of this machine for 5 hours now and I have not finished the process. If I get 1 more of their 50 or so attempts to get me to press the wrong button and subscribe to their toner service (shame on them), I’m going to return this darn printer. It is very difficult to setup. In this day - it should be plug and play.",
    "rating": 1,
    "userName": "Want accept nickname",
    "date": "2025-11-26T12:38:17-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Easy Peasy",
    "review": "Brother has made printing from my phone easy and convenient!",
    "rating": 5,
    "userName": "Infinity J30",
    "date": "2025-11-25T14:41:25-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Can’t print because you disabled the app!",
    "review": "Why do you disable the app just because you made an update that won’t run on the version of phone that it was running on?  Now I can’t print at all!",
    "rating": 1,
    "userName": "K S ...",
    "date": "2025-11-21T13:57:26-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Inconsistent",
    "review": "The printer connected to my Macmini and an older iPad, but will not recognize my iPadPro. I’ve tried all the suggestions form Brother and others, but IT WILL NOT WORK.",
    "rating": 1,
    "userName": "Kanak05",
    "date": "2025-11-18T12:33:36-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "cartridges",
    "review": "Every time I try to buy cartridges, I can't do it the first time. Neither through the app nor through the website. After filling out the details, the payment simply doesn't go through. The first time, I got it right on the fourth try, and today I tried six times, but it still didn't work. It's incredibly inept.",
    "rating": 1,
    "userName": "dmitry-22A",
    "date": "2025-11-15T21:27:41-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "No contecta",
    "review": "Intenté muchas configurarla y no me sirvió, encontraba la impresora pero tan pronto la iba a añadir a la aplicación nunca sirivio",
    "rating": 1,
    "userName": "Juancamil",
    "date": "2025-11-14T11:38:48-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Won’t run 1 late download",
    "review": "Running off the download below 17 ios, and it won’t run. Would have to update phone in order to use the app now, won’t be doing that, like the phone the way it is. \nPlease let the software run off the old ones please",
    "rating": 1,
    "userName": "Red Mauna",
    "date": "2025-11-10T15:52:59-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Mobil Connect",
    "review": "Easy to use, great app!",
    "rating": 5,
    "userName": "BuddhaJim2025",
    "date": "2025-11-09T14:17:25-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Did not work. At all",
    "review": "After messing around for 30 minutes in which it never found my network, and getting redirected to \"help\" pages ending with \"use the app\", I finally pushed the settings button and did it manually.",
    "rating": 1,
    "userName": "Greg Pf",
    "date": "2025-11-08T14:56:17-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "I can write faster",
    "review": "I usually spend 4-5 hours trying to connect. Now it’s asking me to download an updated app, so I go to the app and it says to update the app.",
    "rating": 1,
    "userName": "Theyreallltaken7542589513799",
    "date": "2025-11-07T07:56:49-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "This is garbage",
    "review": "The designer of this app needs to resign.\n\nThis is incredibly cumbersome to use.  It is not intuitive.  It is faulty.  It doesn’t work.  I hate that I bought this brother printer.",
    "rating": 1,
    "userName": "Cuppa app needs work",
    "date": "2025-11-07T07:02:52-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Subscription annoyance",
    "review": "Very annoying processing trying to force subscription to",
    "rating": 1,
    "userName": "FlyoverPete",
    "date": "2025-11-07T04:06:54-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Used to work well",
    "review": "The app used to connect and print easily, since several updates, it seems there are more bugs and does not maintain connection as easily",
    "rating": 1,
    "userName": "Anonymous nonono name",
    "date": "2025-11-06T21:26:44-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Perfect",
    "review": "Exactly what you expect. Wakes printer and prints documents flawlessly.",
    "rating": 5,
    "userName": "dda4121",
    "date": "2025-11-06T19:15:33-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Doesn't support print over internet",
    "review": "Buggy, slow, and relies on local network to print. Unlike other printer manufacturer apps, this one cannot print over internet",
    "rating": 1,
    "userName": "gsuemtur46e8",
    "date": "2025-11-01T06:09:37-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "Terrible",
    "review": "Does not work, extremely slow and hard to connect my printer to WiFi.  Do not recommend these printers.",
    "rating": 1,
    "userName": "Dylanrich77777",
    "date": "2025-10-29T06:33:45-07:00",
    "version": "1.21.5",
    "country": "us"
  },
  {
    "title": "It works half of the time",
    "review": "It hardly connect to the WiFi",
    "rating": 1,
    "userName": "Lulu’s print",
    "date": "2025-10-28T13:14:35-07:00",
    "version": "1.21.4",
    "country": "us"
  },
  {
    "title": "Brother printer",
    "review": "Amazing printer easy to setting up and work as champ",
    "rating": 5,
    "userName": "Jrod8183",
    "date": "2025-10-25T17:32:41-07:00",
    "version": "1.21.4",
    "country": "us"
  },
  {
    "title": "So helpful",
    "review": "Alhamdulilah this app exists, I’ve been trying to print my documents from PC for 2 hours straight and it never worked, it’s already 3 am and I have lectures tomorrow. Now I’m so reliefed that my documents are printed and I can peacefully sleep.",
    "rating": 2,
    "userName": "Nomio05",
    "date": "2025-10-25T16:37:49-07:00",
    "version": "1.21.4",
    "country": "us"
  },
  {
    "title": "Connecting",
    "review": "Cannot get the printer to connect to laptops or phones",
    "rating": 1,
    "userName": "MF9324",
    "date": "2025-10-19T07:26:11-07:00",
    "version": "1.21.4",
    "country": "us"
  },
  {
    "title": "Very intuitive",
    "review": "Very easy to use and access files previews and documents and photos love it!!!",
    "rating": 5,
    "userName": "Jswizzle45",
    "date": "2025-10-16T14:03:14-07:00",
    "version": "1.21.4",
    "country": "us"
  },
  {
    "title": "Update",
    "review": "I can’t use my printer from my phone anymore. The update is for iPhone 17 or newer. I have an older iPhone and it hasn’t updated to 17… So Im paying for ink every month for a printer I can’t even use",
    "rating": 1,
    "userName": "Sweets🤤",
    "date": "2025-10-16T12:53:11-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Why?!",
    "review": "When I print from my computer, it prints on one side of the paper. When I print from this app, it prints from a different side of the paper. I use pre-hole punched paper… so I have to either flip the paper over every time I switch devices or except that it will be on the wrong side of the page when I print from the wrong device. It’s infuriating.",
    "rating": 3,
    "userName": "Soapy Stark",
    "date": "2025-10-15T16:30:11-07:00",
    "version": "1.21.3",
    "country": "us"
  },
  {
    "title": "My printer is on, but it won’t print",
    "review": "My phone is connected to the machine, but still it will not print items on my phone that I’m asking it to print",
    "rating": 1,
    "userName": "Stacyg29",
    "date": "2025-10-15T14:12:18-07:00",
    "version": "1.21.3",
    "country": "us"
  },
  {
    "title": "Garbage",
    "review": "I can connect to my printer instantly on an app that I have to pay for but the app made for this piece of junk doesn’t even want to connect garbage company",
    "rating": 1,
    "userName": "Inthra",
    "date": "2025-10-14T07:48:50-07:00",
    "version": "1.21.3",
    "country": "us"
  },
  {
    "title": "Dont like subscription model",
    "review": "You shouldnt need subscription for ink",
    "rating": 2,
    "userName": "David474747",
    "date": "2025-10-14T04:22:36-07:00",
    "version": "1.21.3",
    "country": "us"
  },
  {
    "title": "Horrific",
    "review": "Impossible to connect to",
    "rating": 1,
    "userName": "prediker",
    "date": "2025-10-13T06:07:16-07:00",
    "version": "1.21.3",
    "country": "us"
  },
  {
    "title": "Object to payment policy",
    "review": "I refuse to subscribe to a printer program that has automatic charges for supples or services.",
    "rating": 1,
    "userName": "old oaks",
    "date": "2025-10-11T13:36:20-07:00",
    "version": "1.21.3",
    "country": "us"
  },
  {
    "title": "App issues",
    "review": "It keeps asking for an update, sends me to the App Store, where it says it’s updated.",
    "rating": 1,
    "userName": "Kaydone2077",
    "date": "2025-10-10T07:14:00-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Printing made easy",
    "review": "It is a dry ink so it doesnot dry out and clog everything. So far so good",
    "rating": 5,
    "userName": "bbbobby21",
    "date": "2025-10-09T20:17:28-07:00",
    "version": "1.21.3",
    "country": "us"
  },
  {
    "title": "Won’t link",
    "review": "It falls off line and I play hill trying to get it back on",
    "rating": 2,
    "userName": "Fighter RIO",
    "date": "2025-10-09T12:27:07-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "trash",
    "review": "Apparently the application thinks it knows what my email is. The developers should work more on this since this isn't the first time this has happened to me.",
    "rating": 1,
    "userName": "Bbb. Bbnnb",
    "date": "2025-10-08T16:17:01-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Useless.",
    "review": "Not user friendly. Not common sense. Not walked thru install.",
    "rating": 1,
    "userName": "Vance2019181716",
    "date": "2025-10-06T21:09:51-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Too aggressive with offers to sell ink",
    "review": "Almost every time I open this app, a pop up appears trying to get me to sign up for an ink subscription.  STOP!",
    "rating": 1,
    "userName": "TeeBoune",
    "date": "2025-10-05T18:05:42-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Garbage",
    "review": "App is garbage and despite doing exactly as described the app and printer don’t talk. Worthless.",
    "rating": 1,
    "userName": "Cirala42",
    "date": "2025-10-02T10:22:24-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "I thought it was smooth sailing",
    "review": "Crashes when setting up my T430W when the app is on the Set Your Machine Password \n\nSad",
    "rating": 2,
    "userName": "Pogz O",
    "date": "2025-09-30T07:31:37-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Not so good",
    "review": "I’ve been trying for the last 30 minutes watching videos as to why I can’t get my printer to connect to my phone and nothing works, I’ve tried to make sure both my phone and the printer are connected to the same WiFi network and nothing, tried with the printer ip still nothing. Waste of time.",
    "rating": 1,
    "userName": "Zawmbieee",
    "date": "2025-09-26T10:45:54-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Love this printer but the app needs to update",
    "review": "I love my printer but I’m unable to use it now due this app requiring iOS 17 or later. App needs to be updated or fixed so I can use my favorite printer. Before the app was working perfectly for me. Please fix. Thank you.",
    "rating": 4,
    "userName": "Tinaloks",
    "date": "2025-09-26T08:10:19-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "What the actual…",
    "review": "Home Printers across the board are terrible. I bought the HL-L2405W for the sole purpose of having a basic laser printer at home to print the occasional thing…avoiding an ink jet as they constantly dry up and you spend a fortune on ink to print 3 things a year. The app however just doesn’t work. I think it’s just not able to deal with modern WiFi protocols between the printer and the app and you can’t ever get apple AirPrint to work and now I can’t even get the printer to work on this terrible brother app. Can someone just make a basic printer on this planet that actually works. Ok, done rant. Now to go back to trying to connect the printer for the thousandth time…",
    "rating": 1,
    "userName": "Garden Will",
    "date": "2025-09-25T12:20:39-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Brother mobile connect",
    "review": "It’s a good app and easy to use",
    "rating": 5,
    "userName": "Rhyder227",
    "date": "2025-09-24T22:28:37-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Waste",
    "review": "This app is a waste of time. Spent 30 minutes, jumping through all the hoops to use it to connect wirelessly with my phone so I could print documents. It never worked.",
    "rating": 1,
    "userName": "Jeremy Joeface",
    "date": "2025-09-24T16:36:58-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "App doesn’t work with my printer",
    "review": "Brother Support directed me to use the iPrint&Scan app but it sends me to the Brother Connect app which won’t authenticate to my Brother laser printer.",
    "rating": 1,
    "userName": "SumDuud",
    "date": "2025-09-24T10:37:01-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Would not recommend",
    "review": "Brother printers and the app are extremely buggy, unless you are extremely tech savvy I would say it is a huge headache and point of frustration.",
    "rating": 1,
    "userName": "JH*123*",
    "date": "2025-09-24T09:09:24-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Works fine.",
    "review": "Works quite well. I had a little trouble setting it up, but it might just be me. I've used Brother printers for at least 15 years and I am quite pleased.",
    "rating": 5,
    "userName": "Opie99",
    "date": "2025-09-23T16:16:14-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "Awful",
    "review": "Never connects",
    "rating": 1,
    "userName": "Projectmayhem13",
    "date": "2025-09-22T05:14:45-07:00",
    "version": "1.21.2",
    "country": "us"
  },
  {
    "title": "App doesn’t help",
    "review": "The app doesn’t help. I’ve spent endless time trying to connect and it does nothing but give different loading screens. Let me save you the time: DONT buy a brother printer and DONT bother with this app",
    "rating": 1,
    "userName": "JonathanB2025",
    "date": "2025-09-19T13:53:23-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Worst app ever",
    "review": "This thing is a joke. It’s super slow. It takes forever to get to any page to make edits or literally anything. It’s impossible to navigate. I try to update my Ez refresh ink subscription and I have to click log in about 20 times before it finally lets me log in to make edits and all the while the loading circle of death is staring me in the face. Such a horrible app truly and a waste of time.",
    "rating": 1,
    "userName": "Tink1513",
    "date": "2025-09-19T08:41:07-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Connect",
    "review": "Printer does not connect to devices",
    "rating": 1,
    "userName": "Alaska printer",
    "date": "2025-09-18T16:03:54-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Np PDF support",
    "review": "Does not scan to PDF",
    "rating": 1,
    "userName": "NoNoPDFs",
    "date": "2025-09-18T12:27:56-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Clunky controls",
    "review": "Actually love the printer - the app needs work.  Clunky controls with no realistic print preview - just a preview of what you selected.  You cannot control layout. You cannot add pics to same sheet of paper which allows for huge waste of an expensive resource. Easy to lose pics selected if you try to add more.  No real use logic. The app is OK if you choose 1 pic and don’t care about waste or making any changes.",
    "rating": 2,
    "userName": "krazybcuz",
    "date": "2025-09-16T09:29:25-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Much easier than I thought",
    "review": "I have been afraid to try scan with my new printer because I am not very good with technology or equipment. However, this took me five minutes and was so easy. I would definitely recommend Brother to all my friends and family",
    "rating": 5,
    "userName": "Kai&Kandi",
    "date": "2025-09-15T14:36:40-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Complicated mess",
    "review": "Don’t buy",
    "rating": 1,
    "userName": "renzo198",
    "date": "2025-09-13T13:18:25-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Awful. Limited",
    "review": "The options are so few it’s useless.  Stops you from using better print and scan. Deleted.",
    "rating": 1,
    "userName": "Bookreader0312",
    "date": "2025-09-08T19:13:08-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Can’t enroll in Refresh; Inadequate Support staff",
    "review": "I’ve tried on 4 occasions to enroll in the Refresh ink program, bot via the app and browser but have been unable to complete - or even start - an order process. Chat and telephone support doesn’t respond and says 2 hours wait time. The ink is outrageously expensive retail, so I do wish to enroll. Also, the app has an old address which I have been unable to update. All I’ve been able to do is register my new product.  Very frustrated with Brother!",
    "rating": 1,
    "userName": "Coszh58",
    "date": "2025-09-08T17:56:00-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "No rifle",
    "review": "No clear directions on how to connect printer to the Wi-Fi",
    "rating": 1,
    "userName": "WHALER man 13 x",
    "date": "2025-09-07T17:25:42-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Junk",
    "review": "Don’t buy brother there junk copiers",
    "rating": 1,
    "userName": "Craig kolakowski",
    "date": "2025-09-04T19:57:01-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Software refuses to download",
    "review": "I've been really pleased with this printer and everything about it up until recently, when the app decided to stop working. When i open it up, it says i need to update the software, so i click into the apple store, where it shows no update being available. As a result, I can no longer use my printer. Yay 😡💢😤",
    "rating": 1,
    "userName": "Pjlgnridb",
    "date": "2025-09-04T08:32:43-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Picture cropping",
    "review": "When choosing to print a picture to crop, this process could be improved (it doesn’t allow to shift the picture so everything is included).",
    "rating": 4,
    "userName": "Debs725",
    "date": "2025-09-02T13:26:00-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Terrible",
    "review": "Standing next to my printer both on the same network and will not print!",
    "rating": 1,
    "userName": "SimplyKish",
    "date": "2025-09-02T10:33:20-07:00",
    "version": "1.21.1",
    "country": "us"
  },
  {
    "title": "Can’t use it anymore",
    "review": "My phone is now too old to use the app, as an iPhone 8+.",
    "rating": 1,
    "userName": "Quartz_Crystal",
    "date": "2025-08-27T17:15:37-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Always Got Problems",
    "review": "I don’t print every month but when I do,  ALWAYS have problems.   I just need a printer to print.",
    "rating": 1,
    "userName": "Douge dog",
    "date": "2025-08-27T16:39:41-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "My new printer",
    "review": "Just received my Brother printer and I love it. It performs well and much faster than my others. And it’s quite. Great buy! Thanks",
    "rating": 5,
    "userName": "edxbook",
    "date": "2025-08-25T22:05:57-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Can’t scale the print",
    "review": "Pain in the liver to print from phone gallery. I had HP envy, replaced it with brothers, and printing a shipping label from phone is awful. Would be nice to have scaling",
    "rating": 2,
    "userName": "hkri9",
    "date": "2025-08-25T17:09:29-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Pretty lame",
    "review": "Has no specifications on resizing a picture before printing. No way to Print an exact size.",
    "rating": 2,
    "userName": "Law and Liberty",
    "date": "2025-08-25T14:39:57-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "This is a very nice app",
    "review": "I have rated it 1 star because it doesn’t support enough Brother models. My printer is not particularly old, but I’m relegated to the vastly inferior iPrint&Scan app. If a printer has sufficient firmware API to be managed by the older app, it can be managed in THIS one (even if all features are not available). Do better, Brother",
    "rating": 1,
    "userName": "akaSkitch",
    "date": "2025-08-24T13:58:12-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Scans should save automatically",
    "review": "I would rate this app higher, but for my needs, it’s been terrible. I just wanted to scan some photos but on multiple occasions, the app simply forgets what you scanned, and they will disappear without a trace. Leaving you to restart however many photos you just scanned. I’m very disappointed and I don’t understand why this is happening. There should be some kind of a history where I can see what I scanned even if I didn’t save it right away. I really hope you fix this. I’ve always considered Brother to be one of the best brands for printers. I made the conscious choice to buy your printer over the others and I’m regretting my choice at the moment.",
    "rating": 2,
    "userName": "Shazam3",
    "date": "2025-08-24T10:22:20-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "sucky",
    "review": "Not intuitive for setting up.",
    "rating": 1,
    "userName": "Ukrainian Butcher",
    "date": "2025-08-23T11:04:59-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Doesn’t support my older iphone",
    "review": "Now ios 17 is required, this app no longer supports my iPhone 8+. Very disappointed! I have resorted to using Brother’s iPrint&Scan app, which has almost no controls.",
    "rating": 1,
    "userName": "Carole_fon",
    "date": "2025-08-22T20:57:45-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Fantastic printer",
    "review": "I have owned sour preachers. This is for the best printer that I have ever owned. \nIt works perfectly in  my home office and mobile phone. I highly recommend this printer.",
    "rating": 5,
    "userName": "GWhite273",
    "date": "2025-08-22T14:26:54-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Won’t allow address change from USA to Portugal",
    "review": "I purchased MFC-L4740CDWE printer and installed in Porto, PT using Brother Mobile Connect. Worked beautifully for a month.  Required update installed today (22-08-2025).  Disconnected from Net. Changed my billing and shipping address to never-used previous US address. Will not allow me to change back to new Portugal address in profile or elsewhere.  No person to talk to. No chat available. No helpful links provided.  Please help!!!",
    "rating": 1,
    "userName": "Waterboy AQP4",
    "date": "2025-08-22T14:20:28-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Infuriating",
    "review": "Upon launching for the first time, the app hits you with several pages for account login, subscription sign-up, discount codes, and more. It opens web pages with pop-ups galore. Only after wading through all this do you get to find your printer and manage it.\nI only wanted to use this app to update the firmware on my printer, and it failed at that.",
    "rating": 2,
    "userName": "GreenSoju",
    "date": "2025-08-20T19:51:19-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Worst app ever.",
    "review": "I’ve never had so many issues. Before I downloaded the app. Printing was easy. Except for the f-ing doom sleep it’s like the printer is doing elicit drugs. But now that I have the brother app. I can’t print ANYTHING. absolutely the worst app the worst printer I’ve ever owned. About to go full office space on this printer. DO NOT BUY ANYTHING BROTHER.",
    "rating": 1,
    "userName": "Spencertheass",
    "date": "2025-08-18T18:03:19-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Not so impressed",
    "review": "When I try to upgrade the firmware it keeps telling that I need to make sure it is connected to my WiFi correctly so I manually enter the password on the machine but it continues to request to make sure it’s connected correctly",
    "rating": 3,
    "userName": "we are Norwegian",
    "date": "2025-08-18T12:44:01-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Buggy app",
    "review": "I bought the mfc new laser printer in USA. The app is having serious performance issues issues in login and activating the the device and .It’s very frustrating . It make the app not usable",
    "rating": 1,
    "userName": "Mseawks",
    "date": "2025-08-16T12:11:06-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Don’t buy",
    "review": "The ink is a nightmare",
    "rating": 1,
    "userName": "Avalancher235",
    "date": "2025-08-09T13:49:50-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Brother Cheats",
    "review": "Offered 30% off if I accepted app and registered and then overcharged me for ink with no discount, Searched and found  buried in after the fact fine print that I’d have to order subscription for ink to qualify for up to 30%. Used to be a good company; now just a ripoff.",
    "rating": 1,
    "userName": "LinderDono",
    "date": "2025-08-07T08:31:56-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Worst interface ever",
    "review": "Constant battle",
    "rating": 1,
    "userName": "gitchda",
    "date": "2025-08-07T07:15:38-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Super Buggy and annoying.",
    "review": "Every time I open the app it says “processing” and just stays there. Right before that I was trying to print something and and it continued to load endlessly. It’s a shame in 2025 a printer that’s easy to set up and use seems to be an unreasonable expectation.",
    "rating": 1,
    "userName": "slushy687",
    "date": "2025-08-07T06:45:45-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Brother mobile printer setup",
    "review": "The setup was very easy. I watched a video on YouTube and within minutes it was setup. I am very happy",
    "rating": 5,
    "userName": "cobragirl555",
    "date": "2025-08-06T11:21:46-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "New app is junk",
    "review": "The app doesn’t pickup the printer automatically like the old app. Photo printing doesn’t give paper type selection or size like the old app. Junk…",
    "rating": 1,
    "userName": "Long time Bro user",
    "date": "2025-08-04T21:09:51-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "No option for older version than iOS 17",
    "review": "This latest update doesn’t allow those of us with iPhone X to access the app anymore.",
    "rating": 1,
    "userName": "NYCgenX1974",
    "date": "2025-08-03T19:40:45-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Don’t get the app but a new printer",
    "review": "These printers ducking trash to set up or even manage",
    "rating": 1,
    "userName": "Yourbigfatmomdj",
    "date": "2025-07-31T05:51:59-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Doc feeder scans can’t be saved as a single file",
    "review": "The Mac app operates as expected: If you scan multiple pages using the document feeder, you can save them as a single multi-page pdf. On this app, it will only save as multiple files, one for each page. Also, why doesn’t this scan in duplex (IOs or Mac)? It’s a duplex printer (DCP-L2640DW), so the hardware is willing, but the software is deficient.",
    "rating": 1,
    "userName": "Scanning is poorly supported",
    "date": "2025-07-29T17:52:15-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Frequent Connectivity and Updating Problems",
    "review": "This expensive for me all in one Lazer printer has very frequent connectivity problems (though this printer has it’s own little private slice of the WiFi pie, so to speak) and it has frequent required updating problems which will not update from the app that it sends me to, which is the very one that’s been already downloaded from the beginning, and I get frequent adds whenever it updates seeking for me to purchase ink and paper, but I already bought such a membership for these needs at the store( cost me an extra 100.00-$200.00, where and when I bought it in Dec 2024 or Jan 2025. These frequent required updates and frequent connectivity problems will prevent it from working as a scan and fax and print for days at a time when it will only do copies, while my other devices are online and working just fine. Now, July 2025, when trying to scan from the printer and send via email, it is showing that it now requires an iPhone 17.0 or higher when my iPhone 8+ is 16.4, so this expensive all in one Lazer printer will no longer print from my iphone at all!",
    "rating": 3,
    "userName": "ladyteacher2013",
    "date": "2025-07-27T17:22:55-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Extremely hard to set up",
    "review": "I have had 3 people trying to set up my new Brother Laser printer/scanner DCP-L2640DW.  We still can’t get it set up. I even have it hard wired into my computer and it will not acknowledge it or my wifi or my email. I am totally unhappy with this product.",
    "rating": 1,
    "userName": "Lg_Kid",
    "date": "2025-07-27T08:04:52-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Just says update required but there is no update being offered",
    "review": "App says you must update ... Iphone app store has no update to download so it's says \"open\"... Open app \"sorry you must Update\"\n\nThere is a bug in the matrix and Brother do I know it!",
    "rating": 1,
    "userName": "LAscooterReview",
    "date": "2025-07-26T11:32:16-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Poor instructions",
    "review": "Instructions not very clear      Impossible for the average person to understand.",
    "rating": 2,
    "userName": "papabayr",
    "date": "2025-07-26T08:02:57-07:00",
    "version": "1.21.0",
    "country": "us"
  },
  {
    "title": "Doesn’t work",
    "review": "Doesn’t work",
    "rating": 1,
    "userName": "Kristine J C",
    "date": "2025-07-21T10:11:44-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Mfcl3720cdw",
    "review": "Extremely disapointed with the lack of real support. Cannot connect printer to network among othet things. The only tech company that offers real support it seems is Apple. I hate not being able to talk to somebody, i didnt grow up with computersxand printers and i dont have the time or patience to search thru hundreds of FAQs ( ive never found help in any company’s faqs yet) and try to ndetstand the lingo to fix my own problem wit the expensive printer i bought from brother. Havent been able to even set it up. Itd be nice if you had phone support, especially for older people…Now i have only regrets",
    "rating": 1,
    "userName": "Bebee 23",
    "date": "2025-07-20T16:46:45-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Basura",
    "review": "Basura",
    "rating": 1,
    "userName": "Xxedgar212xX",
    "date": "2025-07-14T09:18:36-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Won’t Connect",
    "review": "Went through the setup and was even able to print. However, since the first time the printer says it’s online but can’t be found by the app and won’t print anything. Massive waste. Doesn’t work with pc either.",
    "rating": 1,
    "userName": "tolson12390",
    "date": "2025-07-13T09:06:40-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Worst App Ever",
    "review": "I HAD been a BIG fan of Brother products.  This has been a BIG disappointment.  Wasted 10+ hours so far!  Do not get any printer that uses this app.",
    "rating": 1,
    "userName": "Amouree",
    "date": "2025-07-11T03:38:21-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "PIA connect to network",
    "review": "Keeps disconnecting to WiFi and set up takes forever.",
    "rating": 1,
    "userName": "Yeedoc",
    "date": "2025-07-08T09:47:03-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Connectivity issues",
    "review": "The machine constantly shows unable to connect to WiFi. Won’t allow me to add multiple devices to print from 2 different phone.",
    "rating": 1,
    "userName": "nenheyehheyhe",
    "date": "2025-07-06T19:19:17-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Annoying installation so 1*",
    "review": "CONSTANT tricks trying to get you to subscribe to all their bloat-ware completely unnecessary to the app just working.  Just make software that works, we don't want your spam or emails",
    "rating": 1,
    "userName": "NikonPhotographer83",
    "date": "2025-06-30T12:35:33-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "So far so good",
    "review": "No complaints I just wished I’d had the money for color too lol",
    "rating": 5,
    "userName": "Crisi.story",
    "date": "2025-06-29T11:52:47-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Print issues",
    "review": "After changing the print card cartridge, printer will no longer print from remote device. Troubleshooting does not locate the problem.",
    "rating": 2,
    "userName": "joaneb_home",
    "date": "2025-06-24T06:22:24-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "sexy printer",
    "review": "sexiest printer i’ve ever had it’s so fast. shoutout to the swes and ui/ux designers and product designers i see you and vouch for your promotion",
    "rating": 5,
    "userName": "some guy was taken",
    "date": "2025-06-23T19:21:19-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Great so far!",
    "review": "Absolutely love this printer. It has been great so far and the mobile connect seems to work perfectly with the machine. I just bought it so I have not signed up for ink replacement. That seems to be the only thing that people have a complaint about. That seems to be true for almost any color LaserJet printer.",
    "rating": 5,
    "userName": "edittide777",
    "date": "2025-06-23T14:38:10-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "App keeps crashing",
    "review": "Just refreshed to the latest app version. However, every time I try to open, the app crashes. Very frustrating.",
    "rating": 1,
    "userName": "A1234abc1",
    "date": "2025-06-23T11:56:06-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Useless scam app",
    "review": "According to the app it can see my printer and can show all sorts of info about it but when I try and scan it can’t seem to connect, but then it tries to sell me a toner subscription.  I strongly suspect it will magically start working if I subscribe.  I thought I was buying a printer not subscribing to one.  Either way I will never purchase anything from Brother again.",
    "rating": 1,
    "userName": "Jimzks",
    "date": "2025-06-22T19:14:53-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Good",
    "review": "Very nice",
    "rating": 5,
    "userName": "The  Eliu",
    "date": "2025-06-19T10:52:58-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Tough set up",
    "review": "Still trying after 3 hrs. No support. Prints 20% of attempts.",
    "rating": 1,
    "userName": "John14:27",
    "date": "2025-06-14T16:01:26-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Such a terrible experience",
    "review": "It worked reliably for like a week. Now if I wait 2 weeks the printer doesn’t know how to connect to my devices anymore and despite looking visibly on, all my devices say it’s online. It takes 30 godforsaken minutes every time I need to reintroduce my printer to the network and to my devices, and every time I repeatedly have to tell them I don’t want to sign up for their subscription service. It’s misery.",
    "rating": 1,
    "userName": "bj00d",
    "date": "2025-06-14T15:03:21-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "HL 3280VDW",
    "review": "I have this printer for a week. The first time connected with no problem, was able to print some papers and that was it. After the connection always drops. Returning it",
    "rating": 1,
    "userName": "Cute mama",
    "date": "2025-06-14T09:55:41-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Help is not great",
    "review": "Difficult for basic user to understand and help is not clear - try to sell you toner service vs troubleshooting",
    "rating": 1,
    "userName": "glad kat",
    "date": "2025-06-13T05:20:37-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Mobile connection",
    "review": "I cannot keep this thing connected to my phone. I have to download anything that I want to print and open it in the app. It will not allow me to just direct print it.",
    "rating": 1,
    "userName": "Somuchfortechnology",
    "date": "2025-06-12T10:37:30-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Bad UI, Buggy Initial Setup",
    "review": "Spent 5+ hours trying to get the printer connected to Internet. Extremely time consuming and not worth the purchase.",
    "rating": 1,
    "userName": "TamableLion",
    "date": "2025-06-04T17:41:05-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "複印機",
    "review": "操作系統優",
    "rating": 5,
    "userName": "彭错多吉",
    "date": "2025-06-04T15:33:24-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Wake up hello wake up",
    "review": "I used to think brother printers were the best. Now every time I go to print a single page, I have to go wake my printer up. Apparently, from what I’ve read no way to turn this function off. I just want to print.",
    "rating": 1,
    "userName": "Urban Cowgill",
    "date": "2025-06-04T09:04:19-07:00",
    "version": "1.20.5",
    "country": "us"
  },
  {
    "title": "Annoying",
    "review": "Doesn’t print from web browser automatically",
    "rating": 1,
    "userName": "ina mo",
    "date": "2025-06-02T18:04:12-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Photos",
    "review": "Stupid I have to send phots individually from Windows photos to this app to print. Other printers you just select print, no need to go to an app.",
    "rating": 3,
    "userName": "clipit",
    "date": "2025-06-01T10:37:43-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "You can no longer use iprint",
    "review": "Because you the company changed the iprint to mobile connect, I have difficult printing",
    "rating": 3,
    "userName": "rkoehk12",
    "date": "2025-05-30T16:15:04-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Easy and amazing",
    "review": "Just like the tittle easy and amazing",
    "rating": 5,
    "userName": "Cynthiawilltakeyourman",
    "date": "2025-05-28T19:18:39-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Photo not in color",
    "review": "The Mobile Connect with the driver for my HL-L3280cdw color led printer does not let me print photos in color. Even the preview is in b&w. What’s the point of having a color printer?",
    "rating": 2,
    "userName": "wontletmepost123",
    "date": "2025-05-26T14:24:54-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Seamless",
    "review": "This is a great app! I have always been happy with my Brother printer and recently started using this app. It “just works”. It’s to the point and gives you enough options.",
    "rating": 5,
    "userName": "Babaa Ganoush",
    "date": "2025-05-22T07:53:44-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Advanced Connect Failure - no support",
    "review": "My HL-L6210DW-T will not connect for remote access. There is no support info available for this error. This is a must feature for a printer of this cost. Maybe a bad review will get some type of support. Brother has truly disappointed me this time - I am a 15 year brother user with 8 active brother printers at this time. Finally got it to work for exactly one day! Yay that’s so reliable NOT",
    "rating": 1,
    "userName": "ToddCouv",
    "date": "2025-05-11T13:38:31-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Brother Print",
    "review": "Printer was easy to set up, easy to use and has made our home printing needs a thing of the past.",
    "rating": 5,
    "userName": "Adox3",
    "date": "2025-05-11T04:45:32-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Huge challenge",
    "review": "Disappointing that I have to download to a PDF and save them to my phone and then I can only print I can’t go to print directly.",
    "rating": 1,
    "userName": "Languist",
    "date": "2025-05-08T08:18:20-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "I bought an air printer that’s now an app printer",
    "review": "I bought an air printer and now it won’t print unless I use the app.  So now I have to open the app, pull up the document…What a PITA!  I dumped my HP because of this and now I am miserable again.  Hope Brother gets all of the dang data they need to provide a way better product for less money!  That’s a joke.  No company uses my data to help me out.",
    "rating": 1,
    "userName": "Faelinn740215",
    "date": "2025-05-07T13:51:58-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Absolute slowest printer I’ve ever dealt with",
    "review": "I am over here suffering trying to make one print for my daughter so she can be happy and printed so perfect for 24 hours and now it takes 10 minutes to print one picture it disconnected from the Wi-Fi over and over and over. I’m not having a good time here. I’m ready to break into pieces and return it.",
    "rating": 1,
    "userName": "Enjoy waiting for prints",
    "date": "2025-05-06T18:04:02-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Coded by Dummies?",
    "review": "This app shouldn’t exist.  It was outdated in 2010.  It is horrible, and only randomly does what it claims to do.",
    "rating": 1,
    "userName": "CbusFarmer",
    "date": "2025-05-06T17:12:47-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Loving it!",
    "review": "This MFC is just awesome. I’m a fan of Brother printers, and this one is yet another hit.",
    "rating": 5,
    "userName": "Keelacourse",
    "date": "2025-05-06T11:14:42-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Worthless and buggy",
    "review": "This app is terrible and so is the support offered on the website. It doesn’t offer clear solutions to get your printer connected to WiFi. If you go to the website all the FAQ offers is a redirect back to the worthless app.",
    "rating": 1,
    "userName": "Shooter McGavin 101",
    "date": "2025-05-06T08:06:45-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Mmmm",
    "review": "Máquina complicada para hacer un trabajo no recomendable",
    "rating": 1,
    "userName": "Lazaro1212",
    "date": "2025-05-05T20:06:22-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Not connecting to my printer",
    "review": "No matter how many times I reconnect my Brother Printer it’s still telling me to disable the privacy separations",
    "rating": 1,
    "userName": "Pistachios1234",
    "date": "2025-05-03T23:51:24-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Meh",
    "review": "Too weird and complicated.",
    "rating": 2,
    "userName": "Tom90844",
    "date": "2025-05-03T08:35:53-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Good printer",
    "review": "Wonder full app to print out stuff",
    "rating": 5,
    "userName": "Kaitlyn  Lopez",
    "date": "2025-04-30T18:26:19-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "works, but …",
    "review": "scanning seems to be limited to 300dpi.  Entire app is very intrusive and wants to sell you things and get you to create accounts at every opportunity.",
    "rating": 2,
    "userName": "evjofrjdhbhjf",
    "date": "2025-04-21T13:24:23-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "It just stopped printing.",
    "review": "I tried to reinstall the app but it just keeps sending you round in circles. My laptop home computer prints to the printer fine.\nI’m going to try to find another app.. it used to work great. Disappointed..",
    "rating": 1,
    "userName": "Another No One Again",
    "date": "2025-04-21T07:23:03-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Printer connection",
    "review": "It’s connected, but won’t let me print.",
    "rating": 1,
    "userName": "Ⓜ️🚀Ⓜ️CHATTER🛸",
    "date": "2025-04-17T15:40:33-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Can’t print",
    "review": "Bought a HL-L2405W and it doesn’t show up as a Bonjour printer. This stuff is supposed to just work, not require an app. So I get the app and am able to print once and then it stops working. This should all be easy at this point.",
    "rating": 1,
    "userName": "a random John",
    "date": "2025-04-16T06:20:58-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Awful awful awful",
    "review": "Garbage.  Im manually typing in my wifi password on the printer bc Brother software is so horrid",
    "rating": 1,
    "userName": "H@plo",
    "date": "2025-04-14T07:52:49-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Scan option removed",
    "review": "Installed this app on both my Windows 10 laptop and IPad Pro and for whatever reason the ability to scan after adding my MFC-L3780 was removed completely from the app. I can only scan files to my laptop. I save my files to both devices but it is so sad that I can scan only from my laptop. No problems printing from the iPad Pro though, however on the laptop I can only use the iprint and scan app to print and scan. Because of these “hiccups” I am giving this app 3 stars.",
    "rating": 3,
    "userName": "ZeldaHyrule1985",
    "date": "2025-04-11T01:32:14-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Brother Works Very Well",
    "review": "I am enjoying the printing process. Printed my first report.",
    "rating": 5,
    "userName": "Easy love 2",
    "date": "2025-04-10T17:46:50-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Photographer",
    "review": "Pictures are so life like. Better than taking to be developed.",
    "rating": 5,
    "userName": "Brian1040",
    "date": "2025-04-09T18:57:22-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Used for be great",
    "review": "Latest\nUpdate you guys managed to f this up. Awesome!",
    "rating": 1,
    "userName": "b747pilot",
    "date": "2025-04-07T06:31:03-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Doesn’t work well",
    "review": "First of all, it doesn’t matter how many times I try to update the new firmware it does not work. Still won’t print using mobile connect on my phone. Overall not a great experience.",
    "rating": 1,
    "userName": "M.B. 13",
    "date": "2025-04-06T07:14:18-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Lazarus",
    "review": "What an amazing tool to print on demand and with the simplest of ease!",
    "rating": 5,
    "userName": "Milan-ascend",
    "date": "2025-04-05T12:03:39-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Very Happy!!!",
    "review": "It’s fabulous - the best printer I’ve ever had!!!",
    "rating": 5,
    "userName": "MooseLoonlake",
    "date": "2025-04-05T06:59:30-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Terrible",
    "review": "Setup won’t work.  Frustrating lack of support",
    "rating": 1,
    "userName": "Trey Johnston",
    "date": "2025-04-05T04:53:25-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Like it!",
    "review": "Easy to download and activate!",
    "rating": 5,
    "userName": "Autofraud Fixer",
    "date": "2025-04-04T06:14:28-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "best printer so far.I was in another state an printed.",
    "review": "awesome.😁👍",
    "rating": 5,
    "userName": "cool joe😎",
    "date": "2025-04-03T15:26:25-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Needs more options.",
    "review": "No troubleshooting tools are included.",
    "rating": 1,
    "userName": "seeker757",
    "date": "2025-04-03T15:12:59-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Ya no imprime",
    "review": "Ya no imprime",
    "rating": 1,
    "userName": "Denigrech",
    "date": "2025-04-02T09:34:15-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Surprisingly pleased",
    "review": "Usually nothing ever works when it comes to a mobile app, especially when it has to connect with Wi-Fi and a printer. This is the usually the case with anything that I buy and anything that I try to do this with. This has surprised me because it actually works. A+.",
    "rating": 5,
    "userName": "MEU SNIPER",
    "date": "2025-04-01T13:30:25-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "New Brother MFC-L3720CDW",
    "review": "This machine makes printing pictures from my phone terribly difficult.",
    "rating": 1,
    "userName": "Tammy B2345",
    "date": "2025-04-01T07:10:56-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Connection",
    "review": "Print does not content well to all devices.",
    "rating": 1,
    "userName": "informed lady",
    "date": "2025-03-31T19:46:51-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "No scan",
    "review": "The app allows me to print but not scan",
    "rating": 1,
    "userName": "dp4u2",
    "date": "2025-03-31T11:40:27-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Waste of money",
    "review": "Installed a year ago\nJust goes offline whenever it wants. Good basic printer with terrible software that just doesn’t work with ios or android \nPls go for general brands but this 😡",
    "rating": 1,
    "userName": "Raj Gulat",
    "date": "2025-03-31T04:14:01-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Brother printer",
    "review": "It’s fast, I love the printer.",
    "rating": 5,
    "userName": "perez131",
    "date": "2025-03-30T11:11:32-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Great Printer And Interface",
    "review": "I recently purchased a Brother MFC-J1010DW printer for $99. I am so glad I did! It was easy to set up! The black and white and color copies are decent and wireless printing is great! I am about to run out of the black introductory ink cartridge, but am fine with that, since replacement cartridges are available at a decent price.",
    "rating": 5,
    "userName": "jandrgold",
    "date": "2025-03-30T07:21:14-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "The pitch says I can do it, but the app won’t let me",
    "review": "“Brother mobile connect” has one use for me, to connect to my Brother printer when I’m not in the house.\n\nSpecifically, I want to print stuff on my mom‘s printer for her without flying to Detroit each time. \n\nI can certainly set this up by using a dynamic DNS registration and a VPN to a remote server, but I want to do what both the printer and app says that it can do ¯\\_(ツ)_/¯ \n\nI almost got it to work once, but it wanted me to type a passcode that was displayed on the printer, and I couldn’t get my mom to try downstairs, put on her glasses, and read off the code at the time. But now I’m in the same house, and I can’t get it to do that anymore.\n\nSo I think the functionality is there, and the blame rest entirely on a terrible horrible interface. \n\nI would give this app less than one star if I could.",
    "rating": 1,
    "userName": "JTW90210",
    "date": "2025-03-29T16:16:05-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Printers are bad, app is just as bad",
    "review": "Absolutely nothing I have tried has worked to connect. Had this problem with multiple of their printers. It’s as if they’re made to fail.",
    "rating": 1,
    "userName": "pvrgatorivm",
    "date": "2025-03-28T16:40:19-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Printer",
    "review": "Pretty nice",
    "rating": 5,
    "userName": "Mr. GHOST KILL 999",
    "date": "2025-03-28T16:25:02-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Very Opstimistic",
    "review": "This app have all I need to reduce my workload, thnx all the Brother team",
    "rating": 5,
    "userName": "Sogás",
    "date": "2025-03-28T15:05:49-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Fantastic Printer",
    "review": "The best printer I have used so far …. A must have",
    "rating": 5,
    "userName": "Rany4",
    "date": "2025-03-26T23:00:08-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Scanning or copies so easy",
    "review": "I love to use my extra time when I  scan and send documents so fast!",
    "rating": 5,
    "userName": "akirekitkat",
    "date": "2025-03-26T17:22:35-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Horrible",
    "review": "Everything about the connectivity of this printer to a computer or phone is bad. Clunky at best.",
    "rating": 1,
    "userName": "Top O tha Mountain",
    "date": "2025-03-25T15:57:36-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Started printing the previous job again even though it was incomplete terrible waste of pages",
    "review": "Not that happy with this app. I didn’t have to use an app with my last printer and it never screwed up",
    "rating": 1,
    "userName": "19cat60",
    "date": "2025-03-25T12:32:43-07:00",
    "version": "1.20.4",
    "country": "us"
  },
  {
    "title": "Ok, but could be improved",
    "review": "I love the Brother laser printer, L2480DW.  I tried the manual wifi password and it showed connected but the mobile app would not see it.  I next tried the Wps technique using this mobile app.  It also connected, but the app again failed to see laser connect.  After many Internet searches I discovered that you MUST power off the laser for at least 15 seconds and turn on. (There is no reason that this information is not shown during the process.) The mobile app now saw the laser and connected. \nI got notices that there was a firmware update available on the LCD.   I very carefully followed instructions on the laser LCD and waited as instructed for it to complete.  \nThe mobile app now saw the laser. I registered the printer using an iPad.  Easy! \nI tried to add this device on an iPhone on same WiFi.  The app would not see it and appeared to want me to enter the WiFi data again as if the printer was never connected.  Several days later I opened the app on the iPhone and managed to see the printer and connect.  What I did I can’t duplicate as it was not clear.\n\nOn the top of the LCD display I keep seeing enter a new password.  I ignored this for now. \n\nI loaded the windows 10 driver from the OEM Brother web site.  Too much bloat wear, but the windows 10 system prints fine.  \n\nApple AirPrint works perfectly.  So does the printing from this app. \nI can’t comment on the other app features! \nMore later",
    "rating": 4,
    "userName": "Mr#FIXER",
    "date": "2025-03-22T12:16:11-07:00",
    "version": "1.20.3",
    "country": "us"
  },
  {
    "title": "New printer",
    "review": "Print from phone is awesome!",
    "rating": 5,
    "userName": "Ennui forever",
    "date": "2025-03-21T11:26:26-07:00",
    "version": "1.20.3",
    "country": "us"
  },
  {
    "title": "I love, brother printers",
    "review": "The brother mobile app is so easy to use to scan documents via email text or other means. Brother printers are the best.",
    "rating": 5,
    "userName": "jfm1955",
    "date": "2025-03-16T13:56:57-07:00",
    "version": "1.20.2",
    "country": "us"
  },
  {
    "title": "EZ subscription",
    "review": "Anyway to grt rid of annoying EZ subscription ads ?",
    "rating": 1,
    "userName": "Kannaiyan",
    "date": "2025-03-14T10:03:43-07:00",
    "version": "1.20.2",
    "country": "us"
  },
  {
    "title": "Great product",
    "review": "I really like this product. Its very easy to use and has a very good quality",
    "rating": 5,
    "userName": "Zach Pica",
    "date": "2025-03-13T15:30:35-07:00",
    "version": "1.20.2",
    "country": "us"
  },
  {
    "title": "Garbage.  Do not buy brother",
    "review": "App does not work.  Machine won’t print.  Returning. Will never buy this brand again.  Absolute junk.",
    "rating": 1,
    "userName": "mattiplyier",
    "date": "2025-03-11T10:23:39-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Would not print page 1 of 2",
    "review": "Basic function not working to print page 1 of a 2 page doc need to deselect page 2 and only select page 1 can’t imagine how you do a 3 page doc:)",
    "rating": 1,
    "userName": "Appuserlinda354",
    "date": "2025-03-10T09:00:31-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Dream Come True",
    "review": "It is a software dream come true!  It can be counted on to work every time.  Thank you!",
    "rating": 5,
    "userName": "rbreit2000",
    "date": "2025-03-07T11:42:26-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Question printing from an iPhone",
    "review": "I want to be able to type up a letter in the body of an email in my iPhone,copy and paste it and be able to send it to the Brother printer via the app to be printed. How do I do this?",
    "rating": 3,
    "userName": "Streaming ...",
    "date": "2025-03-07T08:16:06-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Doesn’t connect to pc",
    "review": "Frustrating when instructions don’t match lcd screen.",
    "rating": 1,
    "userName": "suckered by expedited delivery",
    "date": "2025-03-06T18:21:47-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Doesn’t Work Anymore -Unsupported",
    "review": "Use the Brother App with the Blue Icon called iPrint&Scan. Worked flawlessly and connected to my printer without any fuss. Also, doesn’t cost anything and doesn’t ask you to pay a subscription or trial.",
    "rating": 1,
    "userName": "Brapalap",
    "date": "2025-03-06T07:50:48-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Slow confusing install",
    "review": "Very slow install and confusing. At times you have no clue if anything is happening. To top it off after all that the printer didn’t work!!!",
    "rating": 1,
    "userName": "ken5297",
    "date": "2025-03-03T19:28:43-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "JD",
    "review": "This little multipurpose center is amazing. It does very well for all the functions that it was designed for for a home center. This is just what I needed. Thank you very much.  YT. JD",
    "rating": 5,
    "userName": "Jim-JR",
    "date": "2025-02-27T06:05:00-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Bloatware",
    "review": "Stop trying to sell me stuff. Stop forcing features behind registration. Slow to print from phone to printer compared to old app.",
    "rating": 1,
    "userName": "Jasgabeman",
    "date": "2025-02-26T08:58:46-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "My printer is not supported",
    "review": "I wish I had known that before that my Brother printer wasn’t supported HL-L2300D (if I remember correctly)",
    "rating": 1,
    "userName": "Cavetrollhead",
    "date": "2025-02-23T14:11:25-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Annoying Requests to Subscribe",
    "review": "Printing isn’t a service. I buy the printer and use it. When I need supplies I buy them. Having the app constantly try to get me to subscribe to refills is annoying and the settings to shut it off are buried and confusing. Fire the marketing team that approved this.",
    "rating": 1,
    "userName": "Turbo 503",
    "date": "2025-02-22T07:05:56-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Huge disappointment",
    "review": "Inability to select two-sided with my printer via the app is a huge fail for my needs. The newer printer doesn’t work with the older (much superior and simpler, big surprise) app, so I have to use this one. But selecting double sided via the printer is not convenient. It should be possible to do this via the app. If this is user error, then mea culpa, but it sure seems to be missing.",
    "rating": 1,
    "userName": "ohffsgoaway",
    "date": "2025-02-21T15:20:52-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Has potential but….",
    "review": "We have had this for 3 days now. The first day everything was great. We could print from different rooms no issues. After day 1…things went down hill fast. Our devices could pick up that the printer was there but it wouldn’t print. After many tries it finally would connect. Day 3, we had to reinstall the printer to our devices to get them to work. Even then, a few hours later it was back to not sending anything to the printer. I don’t have a computer that I can connect the printer to, just an iPad so it’s frustrating that I can’t always print what I need for school/teaching and other needs. Here’s to hoping day 4 will be better, but if day 2-3 is any indication, I’m not holding my breath.",
    "rating": 2,
    "userName": "*38*",
    "date": "2025-02-19T13:16:21-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Pretty Awesome",
    "review": "Way better than HP so far!!!",
    "rating": 5,
    "userName": "XBreezy3",
    "date": "2025-02-18T14:16:10-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "After just a few years",
    "review": "I haven’t had this printer long. Initially it seemed pretty easy to set up through the apps so i could print off any device in my home. I changed Internet providers and I’ve spent hours trying to connect it through every means and there’s nothing in here to help me.",
    "rating": 1,
    "userName": "love the winter",
    "date": "2025-02-18T06:14:01-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Caber",
    "review": "Excelente",
    "rating": 4,
    "userName": "Mcuadra V",
    "date": "2025-02-16T08:04:21-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "So far so good",
    "review": "I will have to see if it actually printed the document",
    "rating": 5,
    "userName": "V.G driver",
    "date": "2025-02-15T10:49:09-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Printer HL-L2460DW",
    "review": "I have had nothing but trouble with phone to printer it keeps saying can’t print turn off and then turn on",
    "rating": 1,
    "userName": "Sr. Deacon",
    "date": "2025-02-14T11:48:41-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Can’t print from email or text",
    "review": "Can’t pint from a email or text From my Iphone",
    "rating": 1,
    "userName": "mikahay",
    "date": "2025-02-13T18:20:16-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Bad",
    "review": "Took forever to connect to WiFi",
    "rating": 1,
    "userName": "Alfaniman",
    "date": "2025-02-07T19:09:43-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Doesn’t work anymore",
    "review": "I used to love this app and used it every single day. I had to change my review to 1 star because for over a week now the app will not open. VERY frustrating since the machine itself has no screen to read or anything. So I can no longer print from my phone.",
    "rating": 1,
    "userName": "Nicoaks1124",
    "date": "2025-02-06T10:19:37-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "Set up",
    "review": "Way too difficult",
    "rating": 1,
    "userName": "noname hate rhat",
    "date": "2025-02-05T07:12:49-07:00",
    "version": "1.20.1",
    "country": "us"
  },
  {
    "title": "I would like to have a phone number to speak with a living human being.",
    "review": "I would like a customer service number to be able to speak with a person.",
    "rating": 1,
    "userName": "nikiermd",
    "date": "2025-02-02T09:32:46-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Great quality printer",
    "review": "The printer gave me no problems when setting it up. Overall, the quality is really good. I love that the double sided feature is automatic.",
    "rating": 5,
    "userName": "BNDavis0",
    "date": "2025-02-01T14:38:54-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "It’s so easy",
    "review": "I use my iPad a lot.  To be able to print from it makes my life easier.",
    "rating": 5,
    "userName": "Ms Kate G",
    "date": "2025-01-31T14:17:10-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Stopped my. Printer",
    "review": "Down loaded the app, turned on the printer enter the info. Connected to the printer. Went to print my first document, app said “need to update firmware” I said ok it started the update printer shut down and now it WILL NOT power back up. I tried everything, unplugged several times, left unplugged for 60 seconds, held down the start and option keys like it says still no reset. Called company (brother) they say, because it was the “app” they aren’t going to fix it under warranty. so now I am out a 10 month old printer",
    "rating": 1,
    "userName": "Tkdkelly",
    "date": "2025-01-29T15:53:37-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Brother app = trash",
    "review": "This app and the divers for desktop PC completely wrecked my laptops ability to connect to ANY Wi-Fi networks at home and work. I’ve had professional IT staff work on my machine and he cannot fix it. If I cannot connect to the printer they are going to reimage my laptop. Completely wipe it! Because of a trash app. Stay away!",
    "rating": 1,
    "userName": "Djdhsvenxks",
    "date": "2025-01-29T12:29:14-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "My MFC4335DW printer",
    "review": "It is wonderful to know that you could print from any were at your convenience in all your devices I have to say Brother product  to are the best ever since I know about needing a printer it was Brother printer  that come home with me great job Brother company",
    "rating": 5,
    "userName": "Bighampop",
    "date": "2025-01-29T10:14:05-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Best out there by far!",
    "review": "Zero issues installing from iPhone and then PC! Both print and scan flawlessly   First laser printer and I can’t believe I waited this long win never go back to inkjet I’ve owned brother printers for past 15 years and will continue buying! Highly recommended WiFi works great with mesh nodes even in basement   Go buy",
    "rating": 5,
    "userName": "Nitemare2123",
    "date": "2025-01-28T17:37:03-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Better Than HP!!!!!!",
    "review": "Very simplistic, straightforward, and buying cartridges for printing is very cheap very sturdy and stylish looking too",
    "rating": 5,
    "userName": "DSL 1986@",
    "date": "2025-01-26T08:02:33-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "WILL NOT CONNECT!!!!",
    "review": "Will not connect to mobile phone",
    "rating": 1,
    "userName": "AIRLIVES",
    "date": "2025-01-20T11:38:57-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Advanced settings hard to get to",
    "review": "I had to fiddle around a little too much to get the print to come out like I needed. The borderless default was the culprit. There should be some automatic fit to size or print to scale options.",
    "rating": 3,
    "userName": "Max_a_moose",
    "date": "2025-01-18T17:47:59-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "I love this printer.",
    "review": "The remote start can’t be beat.",
    "rating": 5,
    "userName": "Jim’s Printer",
    "date": "2025-01-18T12:14:40-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "So good!!",
    "review": "I can print when I am away and at home without going on computer",
    "rating": 5,
    "userName": "AnimalsMemesCo",
    "date": "2025-01-09T16:16:09-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Brother MFC-J1010DW review",
    "review": "Honestly the best printer/scanner I’ve ever used in my life! I can connect it to anything, my laptop, phone, iPad, etc! Makes my life and work 100 times easier!",
    "rating": 5,
    "userName": "Texas96797",
    "date": "2025-01-09T13:29:16-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Doesn’t work",
    "review": "Cannot use with my mfcl3765",
    "rating": 1,
    "userName": "jvptime",
    "date": "2025-01-08T16:39:49-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Yeeeeck",
    "review": "Not user friendly.  Irritating",
    "rating": 1,
    "userName": "578@43213",
    "date": "2025-01-07T06:31:43-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Garbage",
    "review": "Every few weeks messes up and cannot connect or print over wifi. Just a dead piece of weight and only good to use as a copier.  Last time I had a Brother printer was same thing. I suppose need to buy a different brand next time.",
    "rating": 1,
    "userName": "Panrak",
    "date": "2025-01-06T15:57:01-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Works perfectly!",
    "review": "Works perfectly with our Brother LC404 printer (which is by far the best budget/family/small business printer on the market—believe me, I’ve gone through many).",
    "rating": 5,
    "userName": "Fritzio",
    "date": "2025-01-06T13:08:02-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Printer",
    "review": "Can’t connect",
    "rating": 1,
    "userName": "Toxic525",
    "date": "2025-01-06T04:18:56-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Review",
    "review": "Smoke and easy to navigate",
    "rating": 5,
    "userName": "Not me is me",
    "date": "2025-01-05T22:53:55-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Extremely disappointed",
    "review": "Sadly this continues to kick itself off the WiFi, completely incapable of printing wirelessly. I could have paid $30 for this type of qualify but instead we blew $300. Disappointing to say the least. \n\nVery out dated and remedial technology.",
    "rating": 1,
    "userName": "Greg Franks",
    "date": "2025-01-03T15:50:53-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Complicated with poor customer service",
    "review": "I am incredibly frustrated with the HL-L3220CDW printer! I purchased it specifically to print brochures from my iPhone and iPad, expecting a seamless experience. When printing from my laptop, I can easily orient the print upright on both sides of the page. But when I try to print from my iPhone or iPad, one side is upright while the other is upside down.\n\nI reached out to customer service multiple times— both via phone and chat. Initially, I received a call back, but we lost connection right after I explained the issue. I request another call back, but it never happened. The agent I communicated with through IM seemed to know just as little about the printer, which was incredibly frustrating.\n\nI strongly advise anyone considering a brother printer to look for a more user-friendly option with clear instructions and manuals. Save yourself the headache!",
    "rating": 1,
    "userName": "Eunnielee",
    "date": "2025-01-02T09:10:22-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Complicated",
    "review": "Very tough to understand and make it work",
    "rating": 2,
    "userName": "vnethi",
    "date": "2024-12-25T11:53:49-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "No luck",
    "review": "Just purchased printer can’t connect won’t find printer",
    "rating": 1,
    "userName": "Virgil dai",
    "date": "2024-12-22T12:37:30-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Not functioning as drscribed",
    "review": "Cannot get the mobile app to connect the machine to the wifi despite correct password (tried multiple times, triple checked spelling, connected to same wifi as phone). It works only when I manually enter the wifi from the machine itself. Bothersome at best.  Printed a test page from a file on my phone - not sure what the app is supposed to do as it seems I can manage what I need without it and it's not working as described 🤷🏽‍♂️",
    "rating": 2,
    "userName": "KuriousKat999",
    "date": "2024-12-21T12:28:39-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "App finally loaded & functions well",
    "review": "I was forced to switch over to this app once I upgraded to the newest brother all in one MFC machine. On the umpteenth download, it finally opened, connected and is functioning well between my devices and brother all-in-one.  Brother reached out to me after my initial frustrated review.  I appreciate their effort and reaching out advising me to go to Brother support for help.",
    "rating": 4,
    "userName": "heatben,",
    "date": "2024-12-21T05:59:26-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Brother",
    "review": "HL- L2460DW",
    "rating": 5,
    "userName": "Unió de Tula",
    "date": "2024-12-17T21:25:08-07:00",
    "version": "1.20.0",
    "country": "us"
  },
  {
    "title": "Not like other printer apps.  Barely works, won’t scan",
    "review": "All they want to do is sell more cartridges and not provide functionality, like scanning printing, and sending things back to your laptop or phone",
    "rating": 1,
    "userName": "trailsideb10",
    "date": "2024-12-13T08:26:44-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Glitch Mob 2000",
    "review": "Its obvious the people making the app and the printers themselves are not using their own tech. \n\nGet it together Brother.",
    "rating": 1,
    "userName": "I Hate Glitches.",
    "date": "2024-12-04T12:54:19-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Works great.",
    "review": "It’s a nice printer and it prints great.",
    "rating": 5,
    "userName": "Rakirkpa10",
    "date": "2024-12-02T11:53:02-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Photo to print",
    "review": "This photo was a little hard to select and first attempt to print gave an error message of sorts.",
    "rating": 3,
    "userName": "Longtime RJP client",
    "date": "2024-12-02T08:42:18-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Won’t open",
    "review": "App crashes within seconds on iPad",
    "rating": 1,
    "userName": "JakeTheShrink",
    "date": "2024-11-28T12:36:08-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Invalid email",
    "review": "Registration won’t accept a .us TLD. Many features don’t work without registration.",
    "rating": 1,
    "userName": "Xsspd2004",
    "date": "2024-11-25T13:30:44-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Scanning is a nightmare",
    "review": "This device isn’t user friendly. Everytime I try and scan to email it presents another issue thus taking me hours to scan a document.",
    "rating": 1,
    "userName": "RonDu2025",
    "date": "2024-11-25T13:10:02-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Mobile Connect ( IPhone )",
    "review": "iMac",
    "rating": 4,
    "userName": "dpr365",
    "date": "2024-11-21T13:10:39-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Scan",
    "review": "Very easy",
    "rating": 5,
    "userName": "pennycolombo",
    "date": "2024-11-21T11:02:55-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Does not connect",
    "review": "Very frustrating with the printer not connecting to WiFi",
    "rating": 1,
    "userName": "April929",
    "date": "2024-11-14T19:17:03-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Brother",
    "review": "It is a really bad app and printer over all it is very hard to set up and instructions are never clear",
    "rating": 1,
    "userName": "Grace.alv",
    "date": "2024-11-12T16:54:57-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Slow",
    "review": "Extremely slow and you need an app to print. Better to get a Bluetooth printer.",
    "rating": 1,
    "userName": "sskfnfhuick",
    "date": "2024-11-11T10:31:06-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Works, kinda",
    "review": "One of the big advantages of a laser printer like this is the ability to remote print when out of the office. \n\nGenerally, Brother printers produce good output with low running costs. \n\nBut the software? That’s a whole different story. This app, in particular, does not reliably print documents off the printer’s home network despite  appearing to be connected to do so.",
    "rating": 2,
    "userName": "Yobyot",
    "date": "2024-11-10T13:23:31-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Not reliable",
    "review": "Horrible app. Rarely works and I’m forced to use it. It’s a nightmare. I’m doing everything I can to get this company to stop using this.",
    "rating": 1,
    "userName": "Whatsup06",
    "date": "2024-11-06T14:09:22-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "EASY",
    "review": "This app makes my life and business so much easier.  I love it!!!!",
    "rating": 5,
    "userName": "Delivery Princess",
    "date": "2024-11-04T14:02:32-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Wang",
    "review": "Brother printer printed before, now it said could not find printer",
    "rating": 1,
    "userName": "Wailing1",
    "date": "2024-11-03T23:10:02-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Crashes on start",
    "review": "I tried removing the app and reinstalling, but it still crashed on start. I’m on iOS 18.0.1. Just avoid this app and use your Mac or PC to setup the printer, this app isn’t worth the time.",
    "rating": 1,
    "userName": "Gaoshancha",
    "date": "2024-11-03T10:02:53-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "App Lacking",
    "review": "With the App you should be able to choose the  WiFi connection and enter the password. Same also with the firm ware updates. Instead you have to input on the tiny screen using arrows?!",
    "rating": 1,
    "userName": "Keifer314",
    "date": "2024-11-01T04:11:23-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Good little printer",
    "review": "Simple black and white laser printer. Prints on both sides automatically. Works with my Apple devices phone, tablet, and laptop. The setup process is pretty easy although the little lcd screen complicates things a bit but with patience its workable. After using it for over a moth, I find it functional and reliable.",
    "rating": 4,
    "userName": "LPC2025",
    "date": "2024-10-29T15:18:16-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Junk, Brother Setup, Everything is Garbage",
    "review": "Eat it.",
    "rating": 1,
    "userName": "BryanBobby",
    "date": "2024-10-24T16:20:12-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "My office all in one",
    "review": "It for looking for a brothers printer,copier, fax machine this is the best The directions were so easy to help me set up. The app is very simple and is really worth it! I can scan,print or fax on my iPhone",
    "rating": 5,
    "userName": "cajun girl 68",
    "date": "2024-10-24T09:31:59-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Not full capabilities",
    "review": "I am not able control which paper tray I want to use.",
    "rating": 2,
    "userName": "Roady2020",
    "date": "2024-10-21T14:40:03-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "First brother",
    "review": "Very cranky device. Erratic in wireless mode. Sometimes workable sometimes not. Off to support, and potentially sending it back.",
    "rating": 1,
    "userName": "Oncabot",
    "date": "2024-10-21T14:23:11-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Doesn't work across Apple platform",
    "review": "iPhone app is may but brother printer doesn't work well with macOS and iOS and needs lots of technical work to can't use simply.",
    "rating": 1,
    "userName": "Travis_coner",
    "date": "2024-10-21T05:07:37-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Brother MFC~J1010w",
    "review": "So far very happy with. Easy to use and I am terrible with WiFi any tech for that matter.",
    "rating": 5,
    "userName": "Tech Loser",
    "date": "2024-10-19T15:48:54-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Annoying",
    "review": "Fresh out of box ink cartridges lasted through print testing\n\nNow are all empty\n\nSeems like a ripoff to only be able to print 5 pages",
    "rating": 1,
    "userName": "Clintdapict",
    "date": "2024-10-19T12:25:58-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Horrible interface to connect",
    "review": "Won’t let me connect to my laptop and mobile device…. Have to go through setup each time i want to switch.  App is filled with glitches that force-shut the app halfway through…. I’ll give it a couple days to see if I can get the support but something this expensive shouldn’t be this difficult to operate.  Very disappointed",
    "rating": 1,
    "userName": "verhaites",
    "date": "2024-10-14T14:29:52-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "No connection to internet",
    "review": "Keep getting error messages with app. It is connected to internet and I can print with other ways. The app doesn’t work",
    "rating": 1,
    "userName": "ttyyytr do nbh",
    "date": "2024-10-14T07:02:47-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Super easy to navigate! Works great!!!!",
    "review": "I use this app all the time from my phone and it always works.  Super convenient",
    "rating": 5,
    "userName": "sanman13538",
    "date": "2024-10-12T06:55:08-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Crashes on iOS 18",
    "review": "Title says it, instant crash... and the link you directed me to is missing a hyphen and takes me to a malware site???? What are you doing??????? It should be brother-usa.com, without the hyphen takes me to iyfbodn.com, which is a known malware site. Do better, this is embarrassing for you",
    "rating": 1,
    "userName": "Dmickey321",
    "date": "2024-10-11T21:02:08-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Horrible printer",
    "review": "Does not print",
    "rating": 1,
    "userName": "Annoyed***789",
    "date": "2024-10-04T13:04:04-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Does not work with iPhone 16 Pro Max",
    "review": "The printer MFC – J1010DW does not show on the iPhone 16 Pro Max. I have installed and reinstalled the app. I have unplugged. The printer waited five minutes and plugged it back in. The printer shows up on an iPhone 15 Pro Max and a new iPad Air. Even when I put in the model number and the IP address it’s still cannot be found on the iPhone 16 Pro Max. Obviously there’s a problem with the app. I called Apple. They don’t have a solution. I am legally blind and tried the brothers chat and it does not work well with voiceover. I did not get any answers to any questions.",
    "rating": 1,
    "userName": "Geo Geo G",
    "date": "2024-10-02T18:00:06-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Ink cartridges",
    "review": "After buying ink cartridges and replacing them the printer is not showing ink levels and I can’t print documents I need now I will have to go buy a HP printer",
    "rating": 1,
    "userName": "Charlie 4507",
    "date": "2024-10-01T08:55:54-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Administration password",
    "review": "Administration password is impossible to change.send an easier way to do it.",
    "rating": 1,
    "userName": "Leenorbeanie",
    "date": "2024-09-30T12:01:47-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Why",
    "review": "Too much setup and pop ups to print a document dont you think",
    "rating": 1,
    "userName": "Thisnicknameistakentayk",
    "date": "2024-09-27T15:58:59-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "App immediately crashes",
    "review": "Downloaded this to my iPhone 14 Pro Max, running iOS 18.0. App launches but immediately crashes.",
    "rating": 1,
    "userName": "BigSlick",
    "date": "2024-09-27T05:36:21-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Best mobile printing ever!",
    "review": "Welcome to 2024 - this app is a step up from any other mobile printing we have tried.  I previously tried an Epson and returned within a day the app the printer ...awful. Mobile printing a joke. The Brother machine and app are amazing. So happy with our purchase!!",
    "rating": 5,
    "userName": "melissaschapiro",
    "date": "2024-09-24T17:56:23-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Printer is hard to get on line and stay on line",
    "review": "See above",
    "rating": 1,
    "userName": "Larrt1214",
    "date": "2024-09-23T19:45:55-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Highly recommend",
    "review": "I love this printer as it is fast and easy to connect and set up. Currently in college and it has helped tremendously!",
    "rating": 5,
    "userName": "GGGirl18",
    "date": "2024-09-22T19:22:15-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Brother is the best!",
    "review": "Printing from my iPhone has never been easier. I chose the picture size and print medium glossy. The rest was automatic. I chose 3 pictures to begin with to test. The three individual pictures printed perfectly!  A second group of 6 are printing now. Thank you Brother!!",
    "rating": 5,
    "userName": "Cara Bissell",
    "date": "2024-09-18T22:26:20-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Adware abuses notifications",
    "review": "The app works well, but I can’t access all functionality because if I turn on notifications, it spams me trying to sell me toner subscriptions.",
    "rating": 1,
    "userName": "Tx384",
    "date": "2024-09-17T20:50:05-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Made easy",
    "review": "Omg!  I can sit downstairs on my phone and print from my phone upstairs.  This is such a nice feature!\nI would definitely by again!  So user friendly!",
    "rating": 5,
    "userName": "Selma Stepper",
    "date": "2024-09-15T16:40:30-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "The worst app ever",
    "review": "I bought a printer two years ago and there hasn’t been a single time when I could actually print without going through all kinds of motions to get it to spring to life.\nIt’s extremely frustrating and time consuming! \nForget printing remotely, it barely responds to printing while you’re sitting right next to it.\nI have an HP printer and it works like a charm!\nI will never buy Brother again!!",
    "rating": 1,
    "userName": "jl3636",
    "date": "2024-09-15T15:31:18-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "setting this up is an engineering project nobody asked for",
    "review": "for the life of me i cannot think of a good reason to scan documents to my phone.",
    "rating": 1,
    "userName": "sean mcln",
    "date": "2024-09-14T17:04:22-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "keeps wanting to setup",
    "review": "the App keeps timing out and wanting to re setup the machine even after going through full setup. trying to print from phone for business purposes is not exactly pleasant.",
    "rating": 1,
    "userName": "disappointed katrinamitten",
    "date": "2024-09-14T06:06:52-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "ISHA FASHION",
    "review": "Good service",
    "rating": 5,
    "userName": "Tareqr Rahmen",
    "date": "2024-09-11T07:08:33-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Machine Activation does not work in my iPhone.",
    "review": "Hl-l2480dw. Machine activation does not work. No prompt on the printer. The only reason I didn’t give it 1 star is I like the printer.",
    "rating": 2,
    "userName": "Steppnav",
    "date": "2024-09-07T08:41:12-07:00",
    "version": "1.19.0",
    "country": "us"
  },
  {
    "title": "Printer is worthless",
    "review": "It prints test pages perfectly. Everything else is a “1” on a scale of 1-10, 10 being best in terms of quality. This was an expensive printer for home use. It performed well for a handful of months. Then, trash. All the maintenance done, timeless troubleshooting, 100% expensive Brother name-brand ink… Nothing helps. Like most appliances these days, it seems to have been programmed to self destruct. But hey, those “test pages” are pristine!",
    "rating": 1,
    "userName": "Jay Kallam",
    "date": "2024-09-01T23:12:14-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Network won’t stay connected! Frustrated!",
    "review": "I have always purchased Brother products and have never had a problem with printing once the app is installed and unfortunately this machine is not staying connected to the internet. This is a frustrating problem because I like to print out shipping labels and I can’t do so with it not connecting to the Internet. I hope you please fix this.",
    "rating": 3,
    "userName": "nana8855",
    "date": "2024-09-01T11:43:12-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "New to Brother printers",
    "review": "It took me 35 min to find a way to print from my iPhone without having to pay.  Diverted to subscriptions which I can’t afford, shameful forcing subscription for ink and not providing a user friendly print app so can choose # of prints per page, etc.!  I just sure hope this color laser printer works better than this company’s ethics to just USE the printer!",
    "rating": 2,
    "userName": "Amara k",
    "date": "2024-08-31T18:04:15-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Great stuff",
    "review": "Love this machine",
    "rating": 5,
    "userName": "Pentecostal23",
    "date": "2024-08-29T07:39:32-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Great App, but a MAJOR annoyance",
    "review": "Everything works great, love the printer, love the speed of the app and the ease of use, BUT\n\nEvery time I boot the app it throws a message on the screen asking me to sign up for a toner subscription.  I have marked that I’m not interested several times. The window won’t close until it is fully loaded as well, which means it drains about 5 seconds of my life every time I want use the app. \n\nSomething like that is extremely unnecessary. There’s no way I’d ever sign up for a subscription for toner, that’s an insane thing to do for a printer that I use maybe once a week max.",
    "rating": 2,
    "userName": "TheStrickers",
    "date": "2024-08-23T13:16:18-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Printer",
    "review": "Just got it from Amazon and so far it works great! Download the app on both your phone and computer or you’ll be stuck. I made the mistake of not reading all of the instructions. Even has a QR code to scan with your phone.",
    "rating": 5,
    "userName": "BatmansArt",
    "date": "2024-08-21T13:01:28-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Printing",
    "review": "Vary good works generally amazing I think it would be a good investment",
    "rating": 5,
    "userName": "W13880",
    "date": "2024-08-18T19:01:59-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "No subscription",
    "review": "You shouldn’t need a subscription to use your printer",
    "rating": 1,
    "userName": "Dakota Gus",
    "date": "2024-08-17T09:42:36-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "What a disaster",
    "review": "For every paper that had printing on it there were 3-4 blank paper, app not very user friendly.",
    "rating": 2,
    "userName": "Darrin Bates",
    "date": "2024-08-13T16:49:35-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Printer",
    "review": "Can not get my mfcj10100dw to connect. Have tried everything! Nothing works!",
    "rating": 1,
    "userName": "Anita Campbell 130",
    "date": "2024-08-13T11:48:31-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Horrible to use. Too complicated",
    "review": "Extremely Complicated the worst printer I ever owned . Save your money and save the headaches.",
    "rating": 1,
    "userName": "Quit101",
    "date": "2024-08-12T20:34:31-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Printing issue.",
    "review": "Printer paper size stuck on 3.5 inches. Can’t fix it, so printing from iPhone 14 is useless.",
    "rating": 1,
    "userName": "Larry 1936",
    "date": "2024-08-12T16:41:40-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Not Happy",
    "review": "I’m about to return this printer, I was told that brother is the best.\nI can tell this is a older model but when you buy the worst of the best it should still be better than the best of the worst. Can’t get WiFi to work I have to have a hard line and it won’t connect to my phones I’m not happy.",
    "rating": 1,
    "userName": "KrisM-NH",
    "date": "2024-08-11T17:59:11-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Cannot print with secure function lock",
    "review": "I have the function lock completely open and cannot print even though public is allowed to. I also turn on APP what ever that means. Also there is no place to put in the print code in the app. So it’s broken in a way that doesn’t allow you to find a work around as long as the function security is on at all. \n Oh but on the other brother printing app it works no problem but you can’t use the IPrint and scan app on the MFC-L9670CDN.",
    "rating": 2,
    "userName": "Psychobilly Style",
    "date": "2024-08-09T09:23:46-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Moron Proof",
    "review": "I’m a computer moron. I can do anything I want with this app on the Brother printer.",
    "rating": 5,
    "userName": "gcucms",
    "date": "2024-08-04T22:55:19-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Will not AirPrint photos",
    "review": "Printer will print saved documents on my iPhone 13pro, but will not print any saved photos or pdf from a text. It always comes back with error code “failed to find printer” !!!! would return it but my wife likes the print quality for her work documents!",
    "rating": 1,
    "userName": "Mulligan000",
    "date": "2024-08-02T13:43:38-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "So easy!",
    "review": "Love 😍 this printer. Fun to use.",
    "rating": 5,
    "userName": "Mrsplbrown15",
    "date": "2024-07-30T17:26:59-07:00",
    "version": "1.18.3",
    "country": "us"
  },
  {
    "title": "Piece of cake",
    "review": "So easy to install and use that a girl can do it…even this 83 yo girl! Thanks, Brother",
    "rating": 5,
    "userName": "IbuKota",
    "date": "2024-07-26T08:14:28-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Never works",
    "review": "This printer and app are the biggest pieces of Chinese trash, it’s always a long battle to get anything connected and printed, don’t buy Brother",
    "rating": 1,
    "userName": "Derek0184629",
    "date": "2024-07-24T17:59:15-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Ease!",
    "review": "So easy to setup and use. No tech experience no problem.. nice!",
    "rating": 5,
    "userName": "The Egghead Was Here",
    "date": "2024-07-14T14:49:07-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Always disconnected",
    "review": "I have to reconnect printer every time I want to use it.",
    "rating": 1,
    "userName": "1Tots",
    "date": "2024-07-12T14:00:28-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Easy to use",
    "review": "Love our new brother printer.  Simple to set up and easy to use.",
    "rating": 5,
    "userName": "Mike Kalvoda",
    "date": "2024-07-10T16:14:20-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "connectivity  issues every time",
    "review": "I have never had so may print issues as with this app! I basically have to unplug and plug back in to get it to print or update the firmware. For the love of God stop updating the printer.",
    "rating": 2,
    "userName": "Berger Roy Al",
    "date": "2024-07-06T06:22:30-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "My anxiety got the best of me",
    "review": "My anxiety got the best of me but it was actually very simple to set up and I was surprised since I have very little head space for electronics . If you’re looking for a product that offers plenty of resources to understand how to use the technology then brothers is your printer brand !",
    "rating": 5,
    "userName": "lunagemm444",
    "date": "2024-07-04T00:11:42-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Alters my photo",
    "review": "It keeps cropping my photo, despite everything I try",
    "rating": 1,
    "userName": "AmylaneE",
    "date": "2024-07-03T14:08:29-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Works but is annoying",
    "review": "This app works well but is constantly trying to sell you stuff. For instance at the bottom of the super long user agreement you have to agree to there is a little switch that is automatically set to yes which is asking you if you want to receive spam from Brother. Just reviewing cause they annoyingly prompted to in the app. Here’s your review Brother! Thank me later.",
    "rating": 3,
    "userName": "Louisius",
    "date": "2024-07-01T13:35:10-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Poor connection",
    "review": "Never prints automatically from phone like last Brother printer. WiFi connection always needs to be reset. Very frustrating.",
    "rating": 2,
    "userName": "ADT0000",
    "date": "2024-06-29T10:24:39-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "A picture",
    "review": "It did not print I am not happy",
    "rating": 1,
    "userName": "jlfkjf",
    "date": "2024-06-23T18:50:11-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Doesn’t support iOS ShareSheet",
    "review": "The built-in iOS “Print” action on the default iPhone ShareSheet doesn’t print certain PDF data correctly to Brother printers, but they print perfectly if printed from the MobileConnect app. No problem, right? Just add MobileConnect to the iOS ShareSheet… As of 6/2024, this app *can’t* be added to the iOS ShareSheet because support for the ShareSheet isn’t included in the code. This means that instead of being able to print directly from other apps on the iPhone via MobileConnect, you have to open MobileConnect *separately,* navigate back to whatever you wanted to print, and then print from there. The app seems to be quite good for what it does, but it BADLY needs to support iOS ShareSheet.\n\n6/20/24 Update: the canned response from Brother isn’t helpful in the slightest.  I contacted Brother Support before writing my review; they fumbled around and said there was nothing they could do.",
    "rating": 3,
    "userName": "Michael in KS",
    "date": "2024-06-20T08:00:58-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "DOES NOT WORK!",
    "review": "I’ve tried everything. I have followed all the instructions. Complied with all the prompts. Not sure what I’m doing wrong. Mobile app does not work on anything I try.",
    "rating": 1,
    "userName": "Hoochy 1234",
    "date": "2024-06-18T15:53:38-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Mediocre software, Presumptuous company",
    "review": "I found the Brother printer management app pretty tedious to set up. I lost track of the number of times I was asked to agree to a EULA. But Brother and the App Store found a truly reliable way to get a poor review: ASK ME FOR A REVIEW  LESS THAN 10 MINUTES AFTER I INSTALL THE APP! How about, next time, give me about 20 minutes to figure out how much your app stinks before you ask for a review.",
    "rating": 3,
    "userName": "HansInATX",
    "date": "2024-06-18T12:31:09-07:00",
    "version": "1.18.1",
    "country": "us"
  },
  {
    "title": "Challenging to set up",
    "review": "Initially I was able to print no issues, now I cannot seem to figure it out! I cannot take it out of “Deep Sleep”!",
    "rating": 1,
    "userName": "Orozco",
    "date": "2024-06-16T19:18:08-07:00",
    "version": "1.18.0",
    "country": "us"
  },
  {
    "title": "Very bad to connect to WiFi",
    "review": "Very slow and complicated",
    "rating": 1,
    "userName": "B har to leave a review",
    "date": "2024-06-16T11:25:30-07:00",
    "version": "1.18.0",
    "country": "us"
  },
  {
    "title": "love this app!!",
    "review": "connected seamlessly with my printer, and i love the option to resize what i want to print, weird that not most apps/services have that, from what i've seen",
    "rating": 5,
    "userName": "reyg0923",
    "date": "2024-06-15T19:12:51-07:00",
    "version": "1.18.0",
    "country": "us"
  },
  {
    "title": "Works great",
    "review": "I pad connected",
    "rating": 5,
    "userName": "Eapac Great",
    "date": "2024-06-08T10:59:01-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Cannot connect to printer",
    "review": "Always an issues connecting to printer … printer always sleeping .",
    "rating": 1,
    "userName": "Dilan8241",
    "date": "2024-06-05T22:49:25-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Very Pleased",
    "review": "I’ve used this with both my phone and my iPad and so far have been pleased. (Actually it’s the first time I’ve ever been able to get a wireless print to work so I’m super excited about that!)",
    "rating": 5,
    "userName": "Kst8ter",
    "date": "2024-06-05T06:56:16-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Awful",
    "review": "Awfull piece of equipment very hart to set up",
    "rating": 1,
    "userName": "Curiousedit",
    "date": "2024-06-03T17:57:33-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Brother printer",
    "review": "This was the easiest printer to set up on my WiFi and print quality is great!",
    "rating": 5,
    "userName": "labrat113",
    "date": "2024-06-01T12:16:05-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Eh",
    "review": "If you are using it to print photos. It doesn’t allow you to crop them very well. And it prints out completely different than the preview.",
    "rating": 1,
    "userName": "LovelyLexi73108",
    "date": "2024-05-29T14:11:47-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Horrific experience",
    "review": "Literally following every instruction on the app to connect including their you tube video and absolutely nothing happens. \nSupport is non existent and simply redirects you to the same junk instructions. \nWould rather have a lesser printer that I can at least use",
    "rating": 1,
    "userName": "Dukkkhead",
    "date": "2024-05-29T07:04:16-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Walgreens",
    "review": "Walgreens",
    "rating": 5,
    "userName": "Mobiledoc123",
    "date": "2024-05-26T05:37:08-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Satisfied Consumer",
    "review": "Just purchased my printer yesterday. Took me a while to connect but that’s just was on my end. Really impressed with the quality and speed on bond paper. As a fine artist I see a lot of potentials with this printer. I’m a satisfied customer!",
    "rating": 5,
    "userName": "dnhai",
    "date": "2024-05-18T09:15:12-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Love it!!",
    "review": "So easy to install on your phone or your laptop, great scanning features and remote printing!",
    "rating": 5,
    "userName": "Lyn Sanchez",
    "date": "2024-05-15T13:02:15-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Not mobile friendly at all and support not very helpful",
    "review": "Having nothing but issue connecting with mobile, directions dont work right and calling support I was told I can’t connect with mobile??? On top of that who wants an app in order to mobile print? In todays day and age there should be air print access built in, like plug and play. Why is this so difficult??? 👎🏻",
    "rating": 1,
    "userName": "Houfek23",
    "date": "2024-05-04T11:01:10-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Works great",
    "review": "Easy easy to use. Straightforward. I’ll use it more.",
    "rating": 5,
    "userName": "None4000",
    "date": "2024-05-03T15:25:31-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Great printer",
    "review": "Brother is always my first choice",
    "rating": 5,
    "userName": "Dapperdan10",
    "date": "2024-05-01T16:46:26-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Mfcj1010dw",
    "review": "Really like the printer only issue is with a 2.4 GHz connection makes it hard to connect with any other Wi-fi with 5gh have to manually switch to the Wi-Fi on the printer to print each time, kind of annoying",
    "rating": 4,
    "userName": "kaizeej",
    "date": "2024-05-01T11:12:27-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "Olympia WA",
    "review": "Not the easiest setup.  Fumbled initial setup without success.  Finally , started all over by unplugging printer and beginning setup process anew, carefully following each prompt exactly.  Bingo, it worked (so far)!  \nAble to print docs from my iPhone.  \n\nWished Brother would automate the entire process so it’s just plug and play.  Understand why it might be difficult and frustrating for non-tech savvy persons to jump through all the hoops to set up this printer.",
    "rating": 4,
    "userName": "Arby L.",
    "date": "2024-04-28T13:47:15-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "A bit frustrating",
    "review": "I was excited at first because mobile connection was easy to use. As I have had it longer it is unpredictable and I need to try many times until the printing actually happens.",
    "rating": 3,
    "userName": "SJJQPCSMZ",
    "date": "2024-04-27T14:59:25-07:00",
    "version": "1.17.0",
    "country": "us"
  },
  {
    "title": "I like my lil printer so far",
    "review": "I've had my printer a few months so far so good set up was easy 😊",
    "rating": 5,
    "userName": "Toki9075",
    "date": "2024-04-16T06:11:42-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Remote Printing",
    "review": "Bought this printer in 2018 and love it. The only thing I have yet to figure out is how to print remotely. Not from the same location. That works fine. I want to print from out of town. Any help would be appreciated.",
    "rating": 5,
    "userName": "w2fjs",
    "date": "2024-04-13T16:37:57-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Cuts off top part of photos",
    "review": "Cuts off top part of photos",
    "rating": 4,
    "userName": "Jlm@2026",
    "date": "2024-04-13T06:02:56-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "App restrictions",
    "review": "Can only print from app.  Can’t print directly from email",
    "rating": 1,
    "userName": "What Is In It",
    "date": "2024-04-09T05:23:33-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Cant print or connect from app",
    "review": "The app is useless with theHL-L2405W printer. Cant connect my printer to wifi with the app, can’t register my printer with the app, can even print from it.",
    "rating": 1,
    "userName": "Idkurtegfs",
    "date": "2024-04-08T17:20:11-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Limited functionality",
    "review": "The printer works great, but this app gives very limited options for layout adjustment with pdfs and image printing - can’t choose short edge/long edge binding, which direction a layout with multiple pages on one page will print, and no options to choose to fit an image to the page / shrink or expand, all of which is standard in computer printer settings.  Would love love love an update with any/all of these options",
    "rating": 2,
    "userName": "Smeasles",
    "date": "2024-04-06T06:36:48-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Reasonable",
    "review": "Personally, I like it. I wish I could print from the photos app on my iPhone with my printer automatically, but that’s for Apple I guess. It’s slightly convoluted, and there’s so many options I get confused. (Maybe that’s me?) overall, it’s great though.",
    "rating": 4,
    "userName": "OhYeah97",
    "date": "2024-04-03T11:28:19-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Problemas con wifi",
    "review": "No se puede conectar al teléfono 📱 lo lo quiere reconocer tampoco quiere reconocer el Reuters. La aplicaciones que trae la Brothef MFC-J6555DW tampoco en la aplicaciones no tienen directamente para poner la información del Reuters para que se puedan conectar. Es bien difícil configurar está máquina por el tipo de aplicaciones que trae solo solo puede conectarse a la PC por el puesto UBS pero a la telefonía móvil no lo acepta.  Espero su pronta solución o tendré que devolverla .",
    "rating": 1,
    "userName": "Land7",
    "date": "2024-03-30T14:51:55-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Brothers mobile app Failure",
    "review": "I love Brothers printers, they are reliable, better than most for ink consumption and fairly fast. The downside is the software on the mobile side. Computer side you can adjust or tweak setting much better.\n\nSo have you ever wanted to pick 2 or 4 photos that you want wallet sized and have them print on one page? Let’s say you want to print a photo with 5 x 7 size? NOT going to happen with the Brothers Apps. For Gods sake it’s 2024 and they just can’t offer anything other than A4, A5, Full or legal size paper options? Why is that? So I went to the Brothers forum to ask how to print 5 x 7 photos and there were only 10 posts for 2024! I had tech support on the phone and she didn’t have a work around or solution.\nSo buyer be ware if you want to use your iPhone when printing photos from a Brothers printer!",
    "rating": 2,
    "userName": "kjjerome",
    "date": "2024-03-28T14:34:34-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "I make blox cola rovlos :D",
    "review": "This was so cool i made bloxy cola yayyy",
    "rating": 5,
    "userName": "NS (originalappleid2007)",
    "date": "2024-03-26T16:37:56-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Brother DCP-L2640DW",
    "review": "Great fast print quality and easy setup for mobile printing.  Recommend 100%",
    "rating": 5,
    "userName": "Great solitare player",
    "date": "2024-03-26T16:01:39-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Printing with iPhone",
    "review": "It has been a nightmare to print with my new iPhone \nThis mobile connect for my brother laser printer works but barely and it’s difficult to navigate\nSo far the only way I’ve been able to print is by sharing the image or file and I don’t know if that’s gonna work every time I need it very difficult\n\nThis app doesn’t navigate at all like the other brother I print apps\n.com",
    "rating": 1,
    "userName": "TedBrown2",
    "date": "2024-03-23T14:37:53-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "No direct connection",
    "review": "Cannot get machine to connect to WiFi. Have to load everything in a file to copy. Definitely not convenient",
    "rating": 1,
    "userName": "big sasie",
    "date": "2024-03-22T05:16:28-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Jesus",
    "review": "Is my savior",
    "rating": 5,
    "userName": "arthur purgatory",
    "date": "2024-03-21T06:25:54-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Simple to use!",
    "review": "We have been in need of a printer that actually works when you’re ready to use it.\nI can barely turn electronics on, but I connected to the PC and my phone.  So easy to use!!  Only a few days in, but so happy with our purchase.",
    "rating": 5,
    "userName": "what the hecki",
    "date": "2024-03-18T15:10:11-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "AirPrint?",
    "review": "Doesn’t work well, at all!",
    "rating": 1,
    "userName": "ac_chill",
    "date": "2024-03-17T14:34:12-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Super easy to use",
    "review": "Very easy and intuitive to use. Very impressive. Thank you.",
    "rating": 5,
    "userName": "Best printer/scanner",
    "date": "2024-03-16T19:21:10-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Mr Ken",
    "review": "Super print output - certainly saves going through multi steps to get a print out!",
    "rating": 5,
    "userName": "retired mechanic",
    "date": "2024-03-16T19:01:30-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "DCP-L2640DW",
    "review": "Awesome",
    "rating": 5,
    "userName": "Google 810",
    "date": "2024-03-12T22:19:29-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Problems",
    "review": "It is not connecting to my printer",
    "rating": 1,
    "userName": "begmatbek",
    "date": "2024-03-11T15:11:56-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Can’t AirPrint Yet",
    "review": "I’m not sure developers ever test their products with regular people. I’ve been trying for two days to get my MFC-J1010DW to work with my IPAD and IPHONE. No joy yet. Some screens have a blank with no guidance on what entry is expected. Thought maybe I needed to authenticate my device. The program will send me an email to authenticate but I can’t use my computer email app to open. Still haven’t found the email. BE VERY CAREFUL CALLING SUPPORT. THERE ARE COMPANIES OUT THERE THAT LOOK LIKE BROTHER BUT THEY CHARGE FOR THE HELP.\nMarch 11, 2024\nI discovered the problem after two days of frustration. My internet connection was running at 5 ghz and the printer needs 2.5 ghz. Changed my internet settings and the printer works perfectly. Fast, crisp printing for very little money.",
    "rating": 4,
    "userName": "1wiest",
    "date": "2024-03-11T04:49:45-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Pace of Death",
    "review": "I could have hand drawn these images in the time it took to upload to the app.",
    "rating": 1,
    "userName": "leahs_one_good_ear",
    "date": "2024-03-09T08:48:26-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Great",
    "review": "Great",
    "rating": 5,
    "userName": "Blacc Butterfli",
    "date": "2024-03-04T18:49:36-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Great printing help",
    "review": "This printer does a super job on helping me to advance my printouts, both black and color.",
    "rating": 5,
    "userName": "Marty OT",
    "date": "2024-03-01T07:16:05-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Worst wireless printer I have owned so far",
    "review": "It never prints when I ask it too. I have troubleshooted a ton. When it does decide it likes what I want it to print it only prints it on half the page. It’s crazy. So far not my fav for sure.",
    "rating": 1,
    "userName": "jhaven07",
    "date": "2024-02-21T14:50:26-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Won’t connect",
    "review": "Horrible app. Bad user interface, won’t connect or constantly drops printers. Do not bother.",
    "rating": 1,
    "userName": "Tmcg8083",
    "date": "2024-02-20T12:58:55-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Small and easy to use",
    "review": "Easy to set up and easy to use, printing off your phone makes everything super convenient. Only had it a few months but so far very satisfied with my purchase.",
    "rating": 5,
    "userName": "Casna77",
    "date": "2024-02-20T07:25:29-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Pleased!",
    "review": "Very easy set up with WiFi and mobile app. Started using with in 20 minutes after unpacking and setting up.",
    "rating": 5,
    "userName": "C4 Mechanical",
    "date": "2024-02-18T12:34:35-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Terrible program/printer",
    "review": "Finally got the app to work - its set to make your printer disappear immediately it you don’t hassle to click on it before it disappears. Now it wants me to update the printer, but I have to put in a password (which one?) and it is extremely tedious, especially for a disabled person. But, I soldiered on and put in my Brother password (doesn’t it make sense that is what it’s wanting?) but, no. So, I put in my Wi-Fi password. Nope! Won’t accept that one either. Did this twice. Not only that, but you can’t back out and have to unplug it to get it off trying to update. So, I will only be able to use this printer (and app) until there are so many updates it won’t work anymore and then I guess I’ll just have to trash it. Bad, horrible, terrible engineering. Will go back to Epson after this no longer works because I can’t update the firmware.",
    "rating": 1,
    "userName": "Granny Doc",
    "date": "2024-02-17T20:59:59-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Amazing Product!!!",
    "review": "Hi, I received my printer and went through the setup process then I ran a few test prints and I was done…. Oh! The most important point to all this is that I struggled for a period of time with other brands, all of which weren’t iOS friendly. I highly recommend this product to anyone who use iOS based devices. HAPPY! HAPPY! HAPPY!!!",
    "rating": 5,
    "userName": "arlocust03",
    "date": "2024-02-16T04:39:46-07:00",
    "version": "1.16.1",
    "country": "us"
  },
  {
    "title": "Not efficient",
    "review": "Before the app I could easily select the option from my IPhone to send docs to the printer. Now I have to jump thru numerous hoops from various apps/internet to get documents to print",
    "rating": 1,
    "userName": "pjgyenge",
    "date": "2024-02-13T03:18:28-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Worst Printer Ever",
    "review": "From Day 1 I’ve had nothing but trouble with this printer.  Hours online, only to have the same problems over & over again.  Constantly dropping offline; trying to type my password in repeatedly on their ridiculously tiny screen.  There’s no rhyme or reason to why it suddenly will start connecting again—do I input the same info 10x? 20x? Who knows what the magic # is.  The simplest print jobs (especially when I need them NOW) take hours—sometimes days until it’s working again.\n\nDon’t waste your $. Stick with HP!",
    "rating": 1,
    "userName": "u23cgfh",
    "date": "2024-02-12T18:16:48-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Terribly slow printer",
    "review": "Awful printer. Plan on returning it",
    "rating": 1,
    "userName": "LPB 61982",
    "date": "2024-02-12T16:18:01-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Brother vs HP",
    "review": "This is my second brother printer. I had the first one for almost a decade. Then shifted to HP aa I fell for their clever marketing and a good looking red exterior.  Within a year I got rid of the HP and moved back to Brother.  The Brother printers are more reliable then HP. Especially for wireless printing. I highly recommend this printer over HP",
    "rating": 5,
    "userName": "Best camera for home security",
    "date": "2024-02-11T03:39:18-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Difficult to set up",
    "review": "Not user friendly",
    "rating": 1,
    "userName": "Saluki alex",
    "date": "2024-01-29T14:42:52-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Love it!",
    "review": "Loving our new Brother printer. Lots of great features, especially like the double sided print option. The phone app is awesome.",
    "rating": 5,
    "userName": "Hog2015",
    "date": "2024-01-26T07:03:07-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Will be returning the printer",
    "review": "I will not allow push notifications and I do not need a firmware update. Since I cant move forward without that I will return it for a full refund.",
    "rating": 1,
    "userName": "Drive thru 666",
    "date": "2024-01-25T16:24:35-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Technical Support is Useless",
    "review": "App is stuck on gathering supplies information.  I am not able to print.  Technical support is useless.  So disappointed in Brother for lack of support to fix the problem.",
    "rating": 1,
    "userName": "papa1450",
    "date": "2024-01-23T10:02:07-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Oh Brother!",
    "review": "Horrible connection issues with iPhone. Never wants to print directly from the phone. Only solution is to add multiple steps in saving docs and printing through the Brother app. Not a tech friendly solution to home printing. Archaic set up with a CD? Manually inputing network info? What is this 2006??? I wanted Brother to be a SMART home solution and I ordered the latest model laser printer. It’s cheap plastic and outdated out of the box. I will be returning. Brother needs to revamp their whole software and connection tools, even their app looks like a Walgreens kiosk from 1999. Sad. They make good good cost effective prints, but at a cost to your sanity.",
    "rating": 1,
    "userName": "Nikon Warrior",
    "date": "2024-01-21T10:02:02-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Doesn’t work",
    "review": "Doesn’t work",
    "rating": 1,
    "userName": "DANPHIGH",
    "date": "2024-01-17T20:10:45-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Wendell",
    "review": "I’m enjoying this new printer easy WiFi operation and convenience",
    "rating": 5,
    "userName": "schwindaddy",
    "date": "2024-01-15T06:10:40-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "It is the best app I’ve ever seen",
    "review": "Literally nothing is better than it",
    "rating": 5,
    "userName": "00glitch00",
    "date": "2024-01-13T05:24:33-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "One Office",
    "review": "You're the best🖤",
    "rating": 5,
    "userName": "Ayoub F Abdullah",
    "date": "2024-01-10T10:19:56-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Doesn’t always print.",
    "review": "Not sure if it’s the printer or our wifi or my iPhone.  But when I try to print from my phone it doesn’t consistently print.",
    "rating": 2,
    "userName": "Crimefighter84",
    "date": "2024-01-04T09:55:54-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Easy breezy",
    "review": "d.l app \nAdd printer that’s connected to same Wi-Fi as phone\nHit print \n\nFor shipping labels I chose fine print because the UPC bar was all squiggly \n\nPleased!! Finally I can print! What a saga!",
    "rating": 5,
    "userName": "ShooterMgavin’",
    "date": "2024-01-02T18:33:54-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Very hard to set up",
    "review": "There is no clear way to connect this machine to your WiFi network. Normally there is a panel on the machine where you can connect to WiFi. It’s very confusing to set this up.",
    "rating": 1,
    "userName": "Rfitzie",
    "date": "2024-01-02T11:14:00-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Awful app",
    "review": "It’s complicated to set up and technical support from Brotjer is practically non-existent, unless you want to wait on the phone for 90 minutes.",
    "rating": 1,
    "userName": "Skeefj",
    "date": "2024-01-01T17:17:49-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "No.. Just No",
    "review": "Never works right and have to reset the printer to factory settings constantly. Brother were always the best printers, but not anymore 👎🏼",
    "rating": 1,
    "userName": "JRisbell",
    "date": "2023-12-31T15:20:43-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Why does it have to be connected to Wi-Fi?",
    "review": "I can’t do anything with this machine unless it connected to Wi-Fi even though my device and the machine are connected. Because of this, the machine is obsolete to me.",
    "rating": 1,
    "userName": "PotLickingSonOfAPup",
    "date": "2023-12-30T12:09:48-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "No issues",
    "review": "Flawless and syncs with my iPhone.  The option to print from my iPhone comes up as an option to print.",
    "rating": 5,
    "userName": "chair 2 squeaky",
    "date": "2023-12-30T05:02:28-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Always works",
    "review": "When other printer apps don’t work, this always works. I have deleted all air apps but this. Great app",
    "rating": 5,
    "userName": "Joeygjc",
    "date": "2023-12-29T13:16:12-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Highly annoying",
    "review": "This app and printer are about as user friendly as shoving a porcupine up your rectum.",
    "rating": 1,
    "userName": "PatchNJ1",
    "date": "2023-12-26T14:05:15-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "So far so good",
    "review": "Very easy set up and prints beautifully!",
    "rating": 5,
    "userName": "MsMack007",
    "date": "2023-12-25T20:21:17-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Makes mobile printing easy",
    "review": "Very convenient way to use all the features of my printer directly from my phone",
    "rating": 5,
    "userName": "Manders997",
    "date": "2023-12-24T22:22:21-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Connection",
    "review": "This is the second try for me with Brother Printers. I sent the first one back and got an HP. It worked fine. I decided I wanted to try another Brother because I have a Brother Luminaire XP3 and a Scan n Cut SDX325. I thought it would be nice to have a Brother Printer. I have tried everything and I cannot get it to print. I am going to return it. I am tired of wasting hours trying different things. It will not print  with my iPad/iPhone or my laptop. Why do you make it so hard??",
    "rating": 1,
    "userName": "B Estes",
    "date": "2023-12-23T14:50:57-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Great printer!",
    "review": "So nice to print from phone or computer!!",
    "rating": 5,
    "userName": "Jimbly1050",
    "date": "2023-12-23T09:19:11-07:00",
    "version": "1.16.0",
    "country": "us"
  },
  {
    "title": "Needed forever",
    "review": "This is the most important part of this mobile phone.  Is as handy as the camera itself. LOVE IT, LIVE IT. GET IT.",
    "rating": 5,
    "userName": "Booker T Farmer",
    "date": "2023-12-20T02:28:44-07:00",
    "version": "1.15.1",
    "country": "us"
  },
  {
    "title": "Scan",
    "review": "Too hard to use",
    "rating": 5,
    "userName": "###JM",
    "date": "2023-12-18T11:33:11-07:00",
    "version": "1.15.1",
    "country": "us"
  },
  {
    "title": "No control of basic functions",
    "review": "No control of printing size. Prints of photos are partially printed because there’s no fit to paper option. It’s as if it’s printing a billboard. You only get a portion of the photo on standard letter size paper. Seems totally dedicated to marketing laser refills.",
    "rating": 1,
    "userName": "!!dr",
    "date": "2023-12-13T18:03:58-07:00",
    "version": "1.15.1",
    "country": "us"
  },
  {
    "title": "App is rubbish",
    "review": "Connectivity is spotty and will stop working if you change the admin password on your brother printer. There is no option to wake the printer if needed. Print jobs get stuck and silently requeue themselves, resulting in enormous amounts of wasted toner, paper and time. Worse, the app never resets the copies count on new print jobs, so oftentimes, I make the mistake of sending 3 or more duplicate prints when I only needed 1. \nConnectivity doesn't work at ALL if the printer and MobileConnect client are attached to different access points, even if they are part of the same WiFi network.",
    "rating": 2,
    "userName": "wj4",
    "date": "2023-12-09T06:10:39-07:00",
    "version": "1.15.1",
    "country": "us"
  },
  {
    "title": "Brother",
    "review": "It is so so so good there is no errors and it tells you if something is wrong.",
    "rating": 5,
    "userName": "Hdbdvbfhfgdhdhdggvvvvv",
    "date": "2023-11-26T18:39:10-07:00",
    "version": "1.15.0",
    "country": "us"
  },
  {
    "title": "wifi brother not working",
    "review": "no good, will return",
    "rating": 1,
    "userName": "jarasb",
    "date": "2023-11-17T15:59:52-07:00",
    "version": "1.15.0",
    "country": "us"
  },
  {
    "title": "Pain",
    "review": "Pain to connect",
    "rating": 1,
    "userName": "akaletta",
    "date": "2023-11-15T08:33:31-07:00",
    "version": "1.15.0",
    "country": "us"
  },
  {
    "title": "Rất tốt",
    "review": "Tốt lắm",
    "rating": 5,
    "userName": "Michael0223",
    "date": "2023-11-10T05:57:31-07:00",
    "version": "1.14.0",
    "country": "us"
  },
  {
    "title": "My new brother’s all in one",
    "review": "I absolutely love it from just the 1st start up and printing from my phone. i’m looking forward to using all this machine has to offer and will let everybody know after a couple of months or a couple of days lol.",
    "rating": 5,
    "userName": "merkgyver",
    "date": "2023-11-08T17:52:44-07:00",
    "version": "1.14.0",
    "country": "us"
  },
  {
    "title": "Not easy",
    "review": "Spend time setting up but still not working",
    "rating": 2,
    "userName": "LouisMills",
    "date": "2023-10-31T16:43:31-07:00",
    "version": "1.14.0",
    "country": "us"
  },
  {
    "title": "4x6 color photos",
    "review": "Takes about 10 minutes for each selected photo to print",
    "rating": 1,
    "userName": "Oldsailer",
    "date": "2023-10-25T15:16:25-07:00",
    "version": "1.14.0",
    "country": "us"
  },
  {
    "title": "It’s so easy!",
    "review": "Scanned and printed my first copies. I’m so excited!",
    "rating": 5,
    "userName": "Beauty sleep 2",
    "date": "2023-10-19T14:16:51-07:00",
    "version": "1.14.0",
    "country": "us"
  },
  {
    "title": "Problem with size printing.",
    "review": "No matter what I do it keeps printing large copies. Don’t fit the page.",
    "rating": 1,
    "userName": "Fouad Graoui",
    "date": "2023-10-19T08:27:18-07:00",
    "version": "1.14.0",
    "country": "us"
  },
  {
    "title": "Won’t connect to my ip address",
    "review": "I ended up wasting a bunch of time trying to connect this so I could print to my printer from my iphone. None of the troubleshooting worked for me.",
    "rating": 1,
    "userName": "Smgesus",
    "date": "2023-10-17T12:59:51-07:00",
    "version": "1.14.0",
    "country": "us"
  },
  {
    "title": "Not overly intuitive.",
    "review": "Not very intuitive and always trying to get you to subscribe for ink contract.",
    "rating": 3,
    "userName": "gs909202",
    "date": "2023-10-07T06:28:37-07:00",
    "version": "1.14.0",
    "country": "us"
  },
  {
    "title": "App crashes before opening",
    "review": "I just got a new brother printer that I can’t sync to my iPhones (I have 2 iPhones a 7 plus and a 13 Pro with different iOS).\nThe app won’t open. It crashes before it opens. What a disappointment.  Now what? Most of my work is from my iPhone and there is no functional app to sync it with. \nThis is extremely disappointing.",
    "rating": 1,
    "userName": "Mariza_r_f",
    "date": "2023-09-30T13:03:38-07:00",
    "version": "1.14.0",
    "country": "us"
  },
  {
    "title": "No good",
    "review": "It should not be this hard to print something from a cell phone. It’s probably easier to print pictures taking from the space station than it is to be able to print papers off on the printer in the other room.",
    "rating": 2,
    "userName": "Billy24564",
    "date": "2023-09-24T06:03:11-07:00",
    "version": "1.13.1",
    "country": "us"
  },
  {
    "title": "Impressed",
    "review": "I’m so impressed how easy and smooth usage with high quality scanning! \n\nNice!\n\nKeep up your innovation, Brother! \n\nThanks a lot!",
    "rating": 5,
    "userName": "time traveler nurse",
    "date": "2023-09-16T15:45:58-07:00",
    "version": "1.13.1",
    "country": "us"
  },
  {
    "title": "Problemas",
    "review": "Puedo imprimir desde mi teléfono sin usar la aplicación. La aplicación es obligada para escanear o digitalizar pero es un problema, olvida el equipo y hay que volver a desinstalar la aplicación para volver a instalar y volver a configurar la impresora cada ves que necesitas digitalizar documentos.( La aplicación dice que no ve la impresora y si me salgo de la aplicación imprimo mis documentos sin problema)",
    "rating": 1,
    "userName": "Varadossssssss",
    "date": "2023-09-16T04:31:40-07:00",
    "version": "1.13.1",
    "country": "us"
  },
  {
    "title": "Glad I did my research!",
    "review": "This is a budget friendly product, easy to set up, the app that goes with the printer is user friendly and when you print a document with front & back it automatically prints front and back🤯 Like I said, “I am glad I did my research “!! We have differently been over paying for home printers and ink for to long. Bravo to Bothers printer’s for the app capabilities and a better budget friendly product!! Money will saved 💰",
    "rating": 4,
    "userName": "Marie S. Norris",
    "date": "2023-09-11T17:29:45-07:00",
    "version": "1.13.1",
    "country": "us"
  },
  {
    "title": "Buggy, buggy, buggy !",
    "review": "Buggy.",
    "rating": 3,
    "userName": "CFMindless",
    "date": "2023-09-08T13:51:45-07:00",
    "version": "1.13.1",
    "country": "us"
  },
  {
    "title": "C’mon Brother!",
    "review": "Would be great if it let me crop a portion of a PDF that I want to print and make it fill the page. The zoom feature doesn’t even work. If I type in 200% it still prints at 100%. It will let you do all that on a photo though. Ridiculous I paid $300 + for a printer and I can only use this worthless app with it. C’mon Brother!!!",
    "rating": 1,
    "userName": "Jmo87!",
    "date": "2023-09-07T15:40:20-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Love my printer",
    "review": "Printer works great from my phone",
    "rating": 5,
    "userName": "Toemeka1",
    "date": "2023-09-07T07:38:52-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Great printer",
    "review": "I got the MFC-6555DW. As always Brother doesn’t disappoint.  Love this printer.  It prints fast.  This printer manages the ink cartridges very well.",
    "rating": 5,
    "userName": "1Bigassdummy",
    "date": "2023-09-07T03:51:40-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Brandon and MFC-J4335 DW",
    "review": "So far this machine and the connectivity are just as advertised. It operates like a champ. And for the price it is a great addition to my small business.",
    "rating": 5,
    "userName": "1bravo6",
    "date": "2023-09-03T21:20:04-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Does not work",
    "review": "Can’t get print jobs done at home",
    "rating": 1,
    "userName": "Cpj504",
    "date": "2023-08-30T20:07:08-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Excellent Feature",
    "review": "This is a great feature for a small home office!",
    "rating": 5,
    "userName": "KThomasUSA",
    "date": "2023-08-30T15:57:39-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Crashes immediately",
    "review": "I have an iphone 13 pro and haven’t got the app to open, crashes everytime",
    "rating": 1,
    "userName": "JoseFdeC",
    "date": "2023-08-26T10:27:04-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Retired Quality  Inspector",
    "review": "Retired quality control Inspector\nThe app is easy to use and out put quality Las",
    "rating": 5,
    "userName": "N Andrews",
    "date": "2023-08-23T17:17:23-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Painfully dysfunctional",
    "review": "Repeatedly jumping through hoops with this app. It tells me to use the set up screen on my printer? Doesnt exist. Buttons not clearly marked. Finally looked like it would pront but pages are blank. Super annoying. Why do I need this fubar app? My printer is advertised a bluetooth printer. Does not connect. Also I already registered my device. Tells me to register every time. Annoying. Does not work. No clear way to connect or update firmware. Feels like planned obsolescence. No more brother productis for me. Thanx.",
    "rating": 1,
    "userName": "Gamesteals",
    "date": "2023-08-17T18:37:14-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Best option Ever",
    "review": "Having this available on my phone saves me so much time and it’s very convenient! Thank you for having this as an option, this makes work so much easier",
    "rating": 5,
    "userName": "hyryyrydyshshshMEMIA",
    "date": "2023-08-14T16:43:20-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Yay! 2-Sided Working",
    "review": "Using this app is the only way we can print my husband’s church bulletins because he set his document up wonky.",
    "rating": 5,
    "userName": "PeeTrees Cards",
    "date": "2023-08-12T11:45:08-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Brother MFC mobile app.",
    "review": "Very easy to set up.",
    "rating": 5,
    "userName": "SinghPelia",
    "date": "2023-08-10T09:17:51-07:00",
    "version": "1.13.0",
    "country": "us"
  },
  {
    "title": "Forced to install",
    "review": "Ridiculous I need to install bloatware on my phone just to connect my printer to the wifi.",
    "rating": 1,
    "userName": "scrubadubs",
    "date": "2023-08-07T15:27:25-07:00",
    "version": "1.12.1",
    "country": "us"
  },
  {
    "title": "Great printer",
    "review": "Easy to set up and use from computer and iPhones",
    "rating": 5,
    "userName": "Ed B in NC",
    "date": "2023-08-04T16:12:40-07:00",
    "version": "1.12.1",
    "country": "us"
  },
  {
    "title": "you’d think it would get better",
    "review": "the worst experience i’ve ever had. \nnot showing up-not available-not…\nwill be replaced before the year is up and not with another brother product. \n😞",
    "rating": 1,
    "userName": "K..M..D..",
    "date": "2023-07-20T16:32:51-07:00",
    "version": "1.12.0",
    "country": "us"
  },
  {
    "title": "Professor",
    "review": "If I ever,  I say , if I ever start to buy a brothers printer or any of their product kick my A- -.",
    "rating": 1,
    "userName": "proffesor 1",
    "date": "2023-07-19T20:16:39-07:00",
    "version": "1.12.0",
    "country": "us"
  },
  {
    "title": "Having connection issues",
    "review": "Nearly every time I go to air print, there is some kind of error!",
    "rating": 2,
    "userName": "Whatever11233",
    "date": "2023-07-17T15:00:18-07:00",
    "version": "1.12.0",
    "country": "us"
  },
  {
    "title": "Great",
    "review": "Super duper!",
    "rating": 5,
    "userName": "Japan60",
    "date": "2023-07-17T13:26:33-07:00",
    "version": "1.12.0",
    "country": "us"
  },
  {
    "title": "Hate brother",
    "review": "Impossible to figure out how to connect printer to wifi",
    "rating": 1,
    "userName": "Hate brother printer",
    "date": "2023-07-16T14:42:42-07:00",
    "version": "1.12.0",
    "country": "us"
  },
  {
    "title": "So good",
    "review": "Fr not even gonna lie on this one",
    "rating": 5,
    "userName": "ilikecatsbecauseido",
    "date": "2023-06-30T19:04:02-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Super fast!",
    "review": "This was so simple to setup! The speed for\nPrinting was amazing! I’m really impressed",
    "rating": 5,
    "userName": "srchomestead",
    "date": "2023-06-27T16:53:08-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Love it !!!",
    "review": "Love this app !!!!",
    "rating": 5,
    "userName": "CarolRhfs",
    "date": "2023-06-26T10:50:47-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Printer offline after changing to Spectrum ISP",
    "review": "I don’t understand why Brother printers continue to have this problem and why they don’t have a fix. Frustrating!!!!",
    "rating": 1,
    "userName": "Fenney5576",
    "date": "2023-06-23T10:50:32-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Terrible",
    "review": "I swear, every time I try to scan a document, this terrible app won’t seen my Brother device through my router.  I tell it to forget the device, then add a device and it finds it on the network.  Do you even know how DHCP works?  I do not want to statically assign my printer to my network and I shouldn’t have to!  This is so annoying doing this over and over!",
    "rating": 2,
    "userName": "cachappmania",
    "date": "2023-06-20T18:55:40-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "What a timesaver!",
    "review": "It is simple to print wirelessly from a cellphone. Works flawlessly with both my 3 year old iPhone and 2 year old Android Samsung.",
    "rating": 5,
    "userName": "phantom attorney",
    "date": "2023-06-18T23:42:06-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Not happy",
    "review": "This printer has been extremely challenging to use. I wish I would have kept my old HP.",
    "rating": 1,
    "userName": "Ms. Marranzini",
    "date": "2023-06-09T13:54:17-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Defaulting to A6 paper size?",
    "review": "Hi there, I have been enjoying using my brother MFC for a While now. However whenever I go to print a document from my phone the paper size is locked on A6. I cannot get it to print letter size or even Change the page size. When I disconnect the printer the paper size options are available. I am hopeful this is a minor configuration issue and can be easily resolved. Other than this issue, this is a 5 star app and product.",
    "rating": 3,
    "userName": "Glorplan",
    "date": "2023-06-03T12:27:39-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "The app is just OK but…",
    "review": "I have had 2 MFCJ4335DWs in 10 months and both had the same problem!  Wont print via USB!  Print via wifi fine. Customer support is awful!  Ignorant and totally clueless!  They want me to believe that a problem with servers in Japan arethe reasons for me not being able to print hardwired!!!  So, either they ate right and their printers are BRICKS without internet connectivity and especially connectivity to THEIR SERVERS or the usb interface boards are defective. Which one is more believable???\nBrother is awful. Im going with Epson. \nAVOID ANY PRINTER COMPANY THAT HAS A PRINT SUBSCRIPTION SERVICE!!!!!!",
    "rating": 3,
    "userName": "Gospelteacher magnarider",
    "date": "2023-06-02T16:22:18-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Finally",
    "review": "I went to Staples and they sold me a printer that was four years old. It did not connect with any of my devices. After two hours Of frustration; I ordered this one yesterday; it arrived today 5:35 PM \nI am back in business. Now off to Staples to return the junk one.",
    "rating": 5,
    "userName": "D Skusted",
    "date": "2023-06-01T14:39:19-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Easy",
    "review": "The printer is very easy to use. Great product",
    "rating": 5,
    "userName": "Gill0412",
    "date": "2023-06-01T09:37:06-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Easy peasy",
    "review": "Very easy to set up. Took a minute to figure out that I needed to enable my 'Documents' app for it to display those files.",
    "rating": 5,
    "userName": "Ionavideo",
    "date": "2023-05-31T03:22:25-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Broken connection",
    "review": "Not sure if it’s the app or the printer but they constantly lose connection. I have run a WLAN report which shows printer is connected but I continually get an error message about the WIFI connection. I have 2 WI-FI providers and it doesn’t matter which router I connect the devices to the error message is the same. I have unplugged printers and routers and deleted app and reinstalled and nothing changes. I wish I had never purchased the MFC-J1010 brothers printer. Buyer beware the technology is subpar",
    "rating": 2,
    "userName": "ChelleBelle75",
    "date": "2023-05-26T10:20:01-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "So far, so great!",
    "review": "Day 2 of ownership. Printed 10 docs & scanned one. Printer setup was easy. Mobile app, also simple to use. The printer & scanner have been very responsive,  mobile print commands happen in a flash. Thus far, this printer has been worth every penny.",
    "rating": 5,
    "userName": "JMorals322",
    "date": "2023-05-17T12:02:09-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "So frustrating!!",
    "review": "Total waste of time. There was always some reason it wouldn’t print. Everything it listed was already fixed/setup!",
    "rating": 1,
    "userName": "jrhuishsh",
    "date": "2023-05-17T10:53:51-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Not a user friendly as I thought",
    "review": "Took me a while to get it so I could print from my phone.",
    "rating": 4,
    "userName": "Saudad",
    "date": "2023-05-16T11:53:09-07:00",
    "version": "1.11.1",
    "country": "us"
  },
  {
    "title": "Thanks",
    "review": "Very good",
    "rating": 5,
    "userName": "AnahitKara",
    "date": "2023-05-12T13:55:39-07:00",
    "version": "1.11.0",
    "country": "us"
  },
  {
    "title": "Disappointed",
    "review": "No toners available anywhere plus app glitches.",
    "rating": 1,
    "userName": "Chimichanga420",
    "date": "2023-04-30T13:29:40-07:00",
    "version": "1.11.0",
    "country": "us"
  },
  {
    "title": "Wifi setup needs to improve",
    "review": "When I try to enter wifi password, the Ui looks odd\nOther than that everything is smooth",
    "rating": 4,
    "userName": "P0rsche911",
    "date": "2023-04-30T09:25:02-07:00",
    "version": "1.11.0",
    "country": "us"
  },
  {
    "title": "I can’t get the machine to work and need HELP!",
    "review": "Help!",
    "rating": 1,
    "userName": "A C E 1 2 3",
    "date": "2023-04-30T08:14:23-07:00",
    "version": "1.11.0",
    "country": "us"
  },
  {
    "title": "Garbage",
    "review": "Works one day next it doesn’t.",
    "rating": 1,
    "userName": "atttsuckuseverizon",
    "date": "2023-04-26T08:50:10-07:00",
    "version": "1.11.0",
    "country": "us"
  },
  {
    "title": "Crashes Every Time",
    "review": "iPhone 12.  The app never fully loads.  It crashes on launch every time.",
    "rating": 1,
    "userName": "skidav",
    "date": "2023-04-25T20:58:21-07:00",
    "version": "1.11.0",
    "country": "us"
  },
  {
    "title": "Setting up Scan/Email",
    "review": "Having difficulty setting up this feature.  Asks for passcode?  Where is source for that information?",
    "rating": 3,
    "userName": "MSNative52",
    "date": "2023-04-24T07:36:37-07:00",
    "version": "1.11.0",
    "country": "us"
  },
  {
    "title": "Horrible Printer",
    "review": "I would not give this printer to my grandchild to print her homework! Keeps going offline and then I can’t hookup back to Wi-Fi! Going back to using HP. Brother Cartridges are only available through their program. I didn’t even get my $ worth! Ugghhh",
    "rating": 1,
    "userName": "blondienotary",
    "date": "2023-04-21T13:35:22-07:00",
    "version": "1.10.3",
    "country": "us"
  },
  {
    "title": "Brother Printer/Scanner",
    "review": "I found this printer/scanner to be amazingly easy. I use this item for a work environment and the setup couldn’t have been easier. The connection and startup for use was extremely helpful in my situation and I will always recommend.",
    "rating": 5,
    "userName": "Debilynna",
    "date": "2023-04-18T12:55:43-07:00",
    "version": "1.10.3",
    "country": "us"
  },
  {
    "title": "Can’t find images",
    "review": "Image selection for print frequently blanks out and says it can’t find it, despite having just loaded it. Renders unusable unless lucky",
    "rating": 3,
    "userName": "Legotti",
    "date": "2023-04-11T15:21:42-07:00",
    "version": "1.10.3",
    "country": "us"
  },
  {
    "title": "App crashes on iPhone",
    "review": "Hard to connect your printer when it won’t even open without crashing on my iPhone 11",
    "rating": 1,
    "userName": "TE Donahue",
    "date": "2023-04-05T17:39:54-07:00",
    "version": "1.10.3",
    "country": "us"
  },
  {
    "title": "Piece of trash",
    "review": "Won’t hook up to internet. Total nightmare! Called tech and got transferred to some out of country scam deal that wanted hundreds of dollars after logging into my computer and copying all my data. Waiting for the fraudulent charges on all my internet stuff now.",
    "rating": 1,
    "userName": "Ashleyg101",
    "date": "2023-03-30T13:18:25-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "Basura",
    "review": "Es una basura de aplicación, siempre tiene problemas de conexión y me hace perder mucho tiempo.  \n\nHasta que no arreglen eso es una basura, me da problemas todas las semanas.",
    "rating": 1,
    "userName": "CPC DIESEL",
    "date": "2023-03-29T06:12:50-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "Great printer",
    "review": "I love this printer. It was easy to setup and update and it prints very fast compared to my previous printer.",
    "rating": 5,
    "userName": "TexAg59",
    "date": "2023-03-28T12:16:38-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "Wireless? Not on your life",
    "review": "Every effort to print wirelessly from my phone or laptop on my own WiFi network has been unsuccessful. All “help” tools just assume it goes smoothly. I’d return this if I could, sadly i bought it from Best Buy and waited too long.",
    "rating": 1,
    "userName": "Jsjrjnthxuuenwbe",
    "date": "2023-03-25T16:11:47-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "Easy to use",
    "review": "While setup was a little task oriented it is a onetime thing.  The advice to update firmware did not track properly to choices in printer menu.\n\nBut once setup I asked printer to scan a document which I had waiting in the feeder.  It scanned 3 pages, asked I had more pages to add then had me choose jpeg or pdf output.  Then it allowed me to share the pdf file in the typical share options way.\n\nPerfect",
    "rating": 5,
    "userName": "u2bemark",
    "date": "2023-03-17T09:54:30-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "Slow and unnecessarily complicated to set up",
    "review": "My last printer didn’t require an app or long set up process. I just want to print without downloading extra apps.",
    "rating": 2,
    "userName": "Camille Wildy",
    "date": "2023-03-15T20:24:05-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "Review",
    "review": "Great",
    "rating": 5,
    "userName": "Lazer imagine",
    "date": "2023-03-12T15:12:56-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "This is great user experience",
    "review": "This app is great. It’s very easy to use. My folks are able to use which is why I bought this brand of printer. And if they can navigate the app, then the app is great for older folks.",
    "rating": 5,
    "userName": "Nateboob",
    "date": "2023-03-12T09:42:26-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "The best",
    "review": "Lo mejor de lo mejor",
    "rating": 5,
    "userName": "ImATrans",
    "date": "2023-03-11T19:32:06-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "Awesome",
    "review": "I never thought of needed a printer. Comes in handy to send out paperwork and copy",
    "rating": 5,
    "userName": "Johnjoe2x",
    "date": "2023-03-07T14:22:47-07:00",
    "version": "1.10.2",
    "country": "us"
  },
  {
    "title": "Brother color printer",
    "review": "Brother color printer has good quality but beware the ink is wet!",
    "rating": 5,
    "userName": "Thefoureternalstones",
    "date": "2023-03-01T19:30:40-07:00",
    "version": "1.10.1",
    "country": "us"
  },
  {
    "title": "Really?!",
    "review": "I was shocked by how easy my printer was to setup wirelessly. And it’s so feature packed. Scan to phone and administrative control panel via it’s localhost! I have a MFC-J1205W. Even though it doesn’t have a screen, it can do some pretty amazing thing’s that i haven’t seen on my last few printers.",
    "rating": 5,
    "userName": "ARDEACT",
    "date": "2023-02-26T19:21:59-07:00",
    "version": "1.10.1",
    "country": "us"
  },
  {
    "title": "Great Brother home-office Inkjet Printer",
    "review": "Have had new Brother MFC-J1170DW printer only 2 months. It has been a fantastic replacement for our home. It powers up quickly and makes sharp print copies. Especially like how easy it is to gat a pdf copy to my phone, and using the Brother mobile app to send to the printer and make copies. A great printer addition to my home.",
    "rating": 5,
    "userName": "DWEddy",
    "date": "2023-02-22T21:39:38-07:00",
    "version": "1.10.1",
    "country": "us"
  },
  {
    "title": "Garbage!!",
    "review": "I’m taking my MFC-J6555 back to the store tomorrow.  The printer and the app are garbage. Setting up wifi on the app was a nightmare - the printer showed a strong connection, but the app on the same network couldn’t see it. When I finally got that working, trying to set it up with my Mac with their step-thru setup repeatedly blew away the printer’s wifi settings, causing me to have to start over.\n\nFlaky, flaky, flaky.  Staying away from Brother products.  I have a number of devices connected to wifi, but this was BY FAR the flakiest one. Wasted two nights on this. Not wasting a third. Should be called Bother, not Brother.",
    "rating": 1,
    "userName": "otterman",
    "date": "2023-02-22T21:33:42-07:00",
    "version": "1.10.1",
    "country": "us"
  },
  {
    "title": "Worked for 3 months only!",
    "review": "App and printer were working just fine, bit after an update it just stopped functioning and had to call tech support.",
    "rating": 1,
    "userName": "alex_3460",
    "date": "2023-02-17T21:07:02-07:00",
    "version": "1.10.1",
    "country": "us"
  },
  {
    "title": "Very Nice",
    "review": "So Far at his Printer Is Amazing!!!",
    "rating": 5,
    "userName": "885847901838200",
    "date": "2023-02-14T01:23:48-07:00",
    "version": "1.10.1",
    "country": "us"
  },
  {
    "title": "Scanning",
    "review": "Scanning is so very easy!  I was just able to scan a 14 page document and send it under 5 minutes-using the Brothers mobile app.",
    "rating": 5,
    "userName": "quick scanning",
    "date": "2023-02-04T14:24:55-07:00",
    "version": "1.10.0",
    "country": "us"
  },
  {
    "title": "Printer",
    "review": "You need to check photo to letter all the time. It seems as photo is the default option",
    "rating": 4,
    "userName": "Sur Notsure",
    "date": "2023-01-17T14:23:51-07:00",
    "version": "1.9.2",
    "country": "us"
  },
  {
    "title": "Love the Brothers laser printers",
    "review": "Easy to set up, easy to use and a great price!",
    "rating": 5,
    "userName": "Rosiegirl 13",
    "date": "2023-01-09T08:28:55-07:00",
    "version": "1.9.2",
    "country": "us"
  },
  {
    "title": "Brother Printer",
    "review": "So I just scanned a doc directly to my phone from my new brother printer. It was intuitive, quick and easy. Solid product, solid software.",
    "rating": 5,
    "userName": "SilverRhino17",
    "date": "2023-01-05T11:32:47-07:00",
    "version": "1.9.2",
    "country": "us"
  },
  {
    "title": "Full AIO support unavailable",
    "review": "It’s an ok app. You can do almost anything the device can do except fax. What’s up with that??? There’s no Windows desktop utility either.",
    "rating": 3,
    "userName": "obtrunco",
    "date": "2023-01-04T21:29:29-07:00",
    "version": "1.9.2",
    "country": "us"
  },
  {
    "title": "Works great",
    "review": "Great way to print from your phone and adjust settings like eco mode.",
    "rating": 5,
    "userName": "Canoeii",
    "date": "2022-12-23T10:39:40-07:00",
    "version": "1.9.2",
    "country": "us"
  },
  {
    "title": "Brother WiFi print app",
    "review": "I love being able to wirelessly print but I need a way to make the prints small, to save ink.",
    "rating": 4,
    "userName": "QuickRickRed",
    "date": "2022-12-17T19:24:31-07:00",
    "version": "1.9.2",
    "country": "us"
  },
  {
    "title": "Never again!!",
    "review": "I don’t want to use your app!!!",
    "rating": 1,
    "userName": "🎈PLAYTIME 🎈",
    "date": "2022-12-13T18:04:04-07:00",
    "version": "1.9.1",
    "country": "us"
  },
  {
    "title": "Brother",
    "review": "Easy to set up and ink is great. Affordable",
    "rating": 5,
    "userName": "RRACMJB",
    "date": "2022-11-20T19:54:06-07:00",
    "version": "1.8.2",
    "country": "us"
  },
  {
    "title": "Easy",
    "review": "Way easier than using my laptop!",
    "rating": 5,
    "userName": "Juice Meister",
    "date": "2022-11-15T15:54:18-07:00",
    "version": "1.8.2",
    "country": "us"
  },
  {
    "title": "Custom Page Sizes?",
    "review": "It’s a great and intuitive app. Simple and easy to use, but I am extremely bothered how it doesn’t have the ability to add custom sizes in the pages. I need to print on folio pages (216x330 cm) and there is no way to add a page size or option to select Folio pages. Brother please help!",
    "rating": 3,
    "userName": "jo.maraat",
    "date": "2022-11-09T01:12:32-07:00",
    "version": "1.8.1",
    "country": "us"
  },
  {
    "title": "Not easy to use at all",
    "review": "Will not air print unless using the app. I ended up returning the printer it was not worth my time or frustration.  This app is the most outdated  and useless app I have ever used. Do not but a brother printer",
    "rating": 1,
    "userName": "extra super unhappy",
    "date": "2022-11-02T03:03:37-07:00",
    "version": "1.8.1",
    "country": "us"
  },
  {
    "title": "Printer won’t wake",
    "review": "This app is useless when the printer has gone to sleep. It won’t wake the printer.",
    "rating": 1,
    "userName": "KO SF",
    "date": "2022-11-01T11:41:08-07:00",
    "version": "1.8.1",
    "country": "us"
  },
  {
    "title": "Worst printer I’ve used in years",
    "review": "This printer has cost me so much time troubleshooting just to print basic documents. I’ve spoken to tech support and they ask my to reset my router every time. When designing a modern printer, you have to assume people connect over wifi and Bluetooth so it need to just turn on and work. I should be have to reset a router every time I want to print. \n\nMy HP printer just worked. Every time I sent a print job, it just printed it. No hassle. \n\nI wish I could return this",
    "rating": 1,
    "userName": "Reviewer 1234",
    "date": "2022-10-31T09:56:00-07:00",
    "version": "1.8.1",
    "country": "us"
  },
  {
    "title": "Can Not Print from iPad",
    "review": "Not impressed as it will not stay connected",
    "rating": 1,
    "userName": "kutter 69",
    "date": "2022-10-23T12:01:54-07:00",
    "version": "1.8.0",
    "country": "us"
  },
  {
    "title": "Rip off alert",
    "review": "Your app kept sending me to your site wanting a subscription. I don’t want a subscription, I want the printer I purchased to work",
    "rating": 1,
    "userName": "RXP97675",
    "date": "2022-10-15T17:34:00-07:00",
    "version": "1.8.0",
    "country": "us"
  },
  {
    "title": "New product",
    "review": "I have dumped my old HP . Not had a brother before only had it two days and I love it . So easy to set up ,easy to print ,so quiet and excellent quality. So glad I changed make.",
    "rating": 5,
    "userName": "Bev Lacey",
    "date": "2026-01-08T07:54:14-07:00",
    "version": "1.22.1",
    "country": "gb"
  },
  {
    "title": "Efficiency lacking",
    "review": "When you need to quickly connect to this printer and you’re in a rush. The process is the worst process I’ve ever experienced and ruined my mood. You are asking me to sit there through a sign up, notifcation request, wait for it to connect then type in your WiFi password. Even worse the cancel button on the WiFi password screen is at the top rigwhich is typically the area you put next. This meant I accidentally clicked cancel and had to do the silly process again all while rushing so that didn’t help.",
    "rating": 1,
    "userName": "Bshgry",
    "date": "2026-01-05T09:05:41-07:00",
    "version": "1.22.1",
    "country": "gb"
  },
  {
    "title": "Loving it",
    "review": "Very easy to use",
    "rating": 5,
    "userName": "Echomalaka",
    "date": "2026-01-04T09:19:40-07:00",
    "version": "1.22.1",
    "country": "gb"
  },
  {
    "title": "Superb",
    "review": "Superb",
    "rating": 5,
    "userName": "Gp singh88",
    "date": "2025-12-23T05:51:27-07:00",
    "version": "1.22.0",
    "country": "gb"
  },
  {
    "title": "Excellent app",
    "review": "This is an excellent app and have been using it for nearly a year now, however if you have any communication difficulties using the iPad over WiFi, just delete the app off the iPad and reinstall it, this fixed it for me.",
    "rating": 5,
    "userName": "David Hammett",
    "date": "2025-12-17T16:49:55-07:00",
    "version": "1.22.0",
    "country": "gb"
  },
  {
    "title": "Great",
    "review": "So smooth running and overall u don’t have a single complaint",
    "rating": 5,
    "userName": "Corslanda",
    "date": "2025-12-11T06:37:18-07:00",
    "version": "1.22.0",
    "country": "gb"
  },
  {
    "title": "Wonderful!",
    "review": "I got every single photo I wanted for school display and poster",
    "rating": 5,
    "userName": "Keirathebanana",
    "date": "2025-12-10T03:22:01-07:00",
    "version": "1.22.0",
    "country": "gb"
  },
  {
    "title": "Printer forgets device",
    "review": "Manually the printer function as well, but when I need to scan something, my mobile device can no There is no support and no help",
    "rating": 3,
    "userName": "1/44vg",
    "date": "2025-12-09T05:43:04-07:00",
    "version": "1.21.5",
    "country": "gb"
  },
  {
    "title": "Do not buy",
    "review": "Totally confusing set up, will not work on multiple devices (iOS) after 5 hours can only get it to work on 1 iPad, customer service is useless",
    "rating": 1,
    "userName": "Phil150",
    "date": "2025-12-01T10:06:42-07:00",
    "version": "1.21.5",
    "country": "gb"
  },
  {
    "title": "doesn’t support Apple generated passwords",
    "review": "This is surprising. Tried to register but they don’t support Apple generated passwords so you end up putting your own made up password that’s less secure.",
    "rating": 3,
    "userName": "trigger360",
    "date": "2025-11-28T02:54:53-07:00",
    "version": "1.21.5",
    "country": "gb"
  },
  {
    "title": "Best user experience",
    "review": "Simple smart. Print when out of office. Best user experience. Smart digital acess. Scan print options.",
    "rating": 5,
    "userName": "Half-engineer",
    "date": "2025-11-15T03:35:02-07:00",
    "version": "1.21.5",
    "country": "gb"
  },
  {
    "title": "Great Printer",
    "review": "This printer is amazing I used to have an Epsom printer but this printer is far better than the Epsom I used to have.",
    "rating": 5,
    "userName": "Le@D",
    "date": "2025-11-14T06:57:15-07:00",
    "version": "1.21.5",
    "country": "gb"
  },
  {
    "title": "Slow and tedious",
    "review": "Takes far too long to print.",
    "rating": 1,
    "userName": "Maverick190607",
    "date": "2025-11-09T02:06:57-07:00",
    "version": "1.21.5",
    "country": "gb"
  },
  {
    "title": "POOR CONNECTION",
    "review": "THIS IS A TERRIBLE APP",
    "rating": 1,
    "userName": "Image_Image",
    "date": "2025-11-04T09:46:25-07:00",
    "version": "1.21.5",
    "country": "gb"
  },
  {
    "title": "Terrible app",
    "review": "Trying to register for ecopro just seems to cause the app to hang or crash. Can’t connect to web features. Useless",
    "rating": 1,
    "userName": "ChevalierFuller",
    "date": "2025-10-17T01:24:49-07:00",
    "version": "1.21.4",
    "country": "gb"
  },
  {
    "title": "New printer",
    "review": "New hl printer not intuitive to use nor are instructions very helpful",
    "rating": 3,
    "userName": "Pain in the neck printer",
    "date": "2025-09-08T09:43:02-07:00",
    "version": "1.21.1",
    "country": "gb"
  },
  {
    "title": "Printer app",
    "review": "I hate this app it hardly ever works!",
    "rating": 1,
    "userName": "Cosmo JVM",
    "date": "2025-09-02T13:18:28-07:00",
    "version": "1.21.1",
    "country": "gb"
  },
  {
    "title": "Always asleep",
    "review": "Printer goes into Deep Sleep mode which means network and devices struggle to find it. Tried setting sleep to 10min but doesn’t seem to register. Lacks wake-up button. Annoying for what is a great printer.",
    "rating": 1,
    "userName": "Ffcshf",
    "date": "2025-08-31T11:15:12-07:00",
    "version": "1.21.0",
    "country": "gb"
  },
  {
    "title": "No home WiFi",
    "review": "Can’t get it to work as it keeps asking to register the printer. but have no home WiFi wanted to use it with WiFi direct. But how ???",
    "rating": 1,
    "userName": "Bazinski",
    "date": "2025-08-25T04:58:14-07:00",
    "version": "1.21.0",
    "country": "gb"
  },
  {
    "title": "Bad idea ink subscription",
    "review": "Cannot connect to update software . Useless service . Wouldn’t buy any kind of subscription again. Much better to buy inks as needed . Can’t access page usage at all. Hopeless . May have to buy completely new printer . Won’t be another one of theirs",
    "rating": 1,
    "userName": "Halifax Wins every time",
    "date": "2025-08-24T02:52:13-07:00",
    "version": "1.21.0",
    "country": "gb"
  },
  {
    "title": "Software update breaks AirPrint",
    "review": "Latest firmware update means whenever I send a print job it’s relieved and then automatically cancelled by the printer. Only way to print is to save documents and print via this horrible app. Bad work brother. Do you guys not test ?",
    "rating": 1,
    "userName": "Thisnameistakenalreasdy",
    "date": "2025-08-16T08:18:25-07:00",
    "version": "1.21.0",
    "country": "gb"
  },
  {
    "title": "Don’t connect",
    "review": "The display on the DCP asked for the Internet code when you put it in press okay? It asked for it again. It takes absolutely ages to connect. Then it disconnects when he wants to.",
    "rating": 1,
    "userName": "Fan of salman",
    "date": "2025-08-11T12:01:27-07:00",
    "version": "1.21.0",
    "country": "gb"
  },
  {
    "title": "Photo from a mobile",
    "review": "Come a window and ask you if A4, and you Press No, printed an A4. Don’t give you an alternative to to half of A4",
    "rating": 4,
    "userName": "Microfuzzy",
    "date": "2025-07-25T08:33:28-07:00",
    "version": "1.21.0",
    "country": "gb"
  },
  {
    "title": "Easy to use",
    "review": "Easy to setup and use but new router and new mobile addition required new installation to remove error messages",
    "rating": 4,
    "userName": "Macalien89",
    "date": "2025-06-15T10:35:10-07:00",
    "version": "1.20.5",
    "country": "gb"
  },
  {
    "title": "Can’t connect to iPhone 16 pro ios18.5",
    "review": "Doesn’t seem to want to connect to iPhone 16 pro running on ios 18.5",
    "rating": 1,
    "userName": "Evo1777",
    "date": "2025-06-06T15:23:36-07:00",
    "version": "1.20.5",
    "country": "gb"
  },
  {
    "title": "Temperamental",
    "review": "Works and then doesn't depends on the printers settings",
    "rating": 3,
    "userName": "Matthias2RevengeofMatthias",
    "date": "2025-05-05T04:42:27-07:00",
    "version": "1.20.4",
    "country": "gb"
  },
  {
    "title": "Arseholes",
    "review": "Hopeless two hours to connect",
    "rating": 2,
    "userName": "Crapyyy",
    "date": "2025-04-02T03:11:06-07:00",
    "version": "1.20.4",
    "country": "gb"
  },
  {
    "title": "Impressive!!",
    "review": "I found the phone app simple and easy to install(had already done so on my laptop). Scanning documents directly onto my phone has never been easy and quick. I could even control the scanning from my phone. The scan quality is pretty good in my opinion. This is simple and convenient. I am quite happy with my purchase especially given that there are so many options out there it can become taxing finding something that works just right for you.",
    "rating": 5,
    "userName": "iamcoco02",
    "date": "2025-04-01T04:36:24-07:00",
    "version": "1.20.4",
    "country": "gb"
  },
  {
    "title": "Worth the hassle",
    "review": "Bought this printer to replace HP WiFi which was hit and miss. The printer feels sturdy enough for the competitive price I paid. The first 3 set up steps were easy but the wifi connection was a real hassle. I don’t know if this was due to signal issues in my area that day as my emails were taking an age to come through in fairness to this review. Once the printer was set up I have found it really easy to use. Printing documents from my phone has been a doddle to do",
    "rating": 4,
    "userName": "Page-Bulloch",
    "date": "2025-03-27T08:00:23-07:00",
    "version": "1.20.4",
    "country": "gb"
  },
  {
    "title": "WiFi problems",
    "review": "Printer will not connect to our wi-fi. It’s the worst printer we’ve had",
    "rating": 1,
    "userName": "debwil6",
    "date": "2025-03-23T04:16:02-07:00",
    "version": "1.20.3",
    "country": "gb"
  },
  {
    "title": "Basic",
    "review": "This app is next to useless. No preview No options to print envelopes or labels, no point in buying the printer",
    "rating": 1,
    "userName": "Mick jaggers",
    "date": "2025-03-21T04:32:11-07:00",
    "version": "1.20.3",
    "country": "gb"
  },
  {
    "title": "Ho brother",
    "review": "What can I say the last three printers I have had were put in the bin why because they were rubbish Epsom printers . Now I have three brother lazer printers they out work the Epsom one hands down I can even be laying on the beach working and print back home so my work is all done ready for me to pick up when I get back the colours are tue to life and there are no messy missed printing or paper being jammed up inside the machine . Yes you pay more but not in the long run because it’s right first time",
    "rating": 5,
    "userName": "Lord cliff richard",
    "date": "2025-02-18T02:08:05-07:00",
    "version": "1.20.1",
    "country": "gb"
  },
  {
    "title": "From the 90s",
    "review": "This machine is like something from the 90s the control panel is absolutely useless",
    "rating": 1,
    "userName": "spf54",
    "date": "2025-02-04T07:25:11-07:00",
    "version": "1.20.1",
    "country": "gb"
  },
  {
    "title": "Useless",
    "review": "The slowest printer in the world . Not quite sure why it's sooooo slow but frustrating . Wish I could send it back. Complete waste of money.",
    "rating": 1,
    "userName": "Doobydoolicious",
    "date": "2025-01-10T13:18:52-07:00",
    "version": "1.20.0",
    "country": "gb"
  },
  {
    "title": "Poor app",
    "review": "App works on and off, help is unavailable and don’t bother trying to add ecopro ink service as it don’t arrive if they bother to send !",
    "rating": 1,
    "userName": "sawdust wood",
    "date": "2025-01-08T07:25:23-07:00",
    "version": "1.20.0",
    "country": "gb"
  },
  {
    "title": "A3 booklet printing",
    "review": "The printer does not appear to support printing A3 double sided booklets? Much time wasted and no clear instructions from Brother.",
    "rating": 2,
    "userName": "RicJenk",
    "date": "2024-12-29T10:22:18-07:00",
    "version": "1.20.0",
    "country": "gb"
  },
  {
    "title": "Ruining your reputation",
    "review": "Scanning from printer to iPad will kill you. Please accept Brother developers accept this does not work and put out a fix",
    "rating": 1,
    "userName": "Jimi-combo1",
    "date": "2024-12-27T10:30:56-07:00",
    "version": "1.20.0",
    "country": "gb"
  },
  {
    "title": "5*",
    "review": "Great app",
    "rating": 5,
    "userName": "AlexJ0604",
    "date": "2024-12-17T03:22:45-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Rubbish connectivity",
    "review": "Could not have purchased a worse printer, connectivity is poor. A simple print job for a parcel label is a nightmare. Rubbish printer going in the bin",
    "rating": 1,
    "userName": "Nigel278",
    "date": "2024-12-16T05:49:46-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Not quite as intuitive as I’d hoped.",
    "review": "Duplex printing setup wasn’t as easy to find as the HP app I’d used previously. Mind you, that was a terribly unreliable printer with zero support. Hence I switched to a printer a friend recommended",
    "rating": 4,
    "userName": "LittleCrabs",
    "date": "2024-12-09T04:12:03-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Good with DCP-L2627 printer/copier",
    "review": "Works well with this device. Intuitive and has good basic functionality.",
    "rating": 5,
    "userName": "2Energy",
    "date": "2024-11-27T01:36:14-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "New to this",
    "review": "Bought the Brother laser printer & a bit of a struggle to set up as no technical knowledge but got there in the end. Absolutely fabulous soooo easy to print & really good quality too. I’m using it for my artwork. Would definitely recommend.",
    "rating": 5,
    "userName": "lucy131531",
    "date": "2024-11-23T02:04:37-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Not working in all the apps",
    "review": "Trying to setup the printer is not straight forward. Some apps are printing so are.very frustrating.",
    "rating": 1,
    "userName": "Trevor5002",
    "date": "2024-11-17T02:31:09-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Easy to install",
    "review": "Very quick to set up and connect to phone and iPad",
    "rating": 5,
    "userName": "Roundbays",
    "date": "2024-10-31T12:15:48-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Wi fi is a drama",
    "review": "Still trying to get the printer to work wirelessly with a pc, iPad and an iPhone - bought to make life simpler…. turns out that isn’t the case at all",
    "rating": 1,
    "userName": "Life’stooshortfordrama",
    "date": "2024-10-29T04:09:47-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Doesn’t work at all",
    "review": "Everything is connected. Can AirPrint to printer. Local network access is allowed for the app.\n\nBut app cannot connect to printer, and even fails when given IP address of printer explicitly.\n\nClearly, more buggy untested software that developers should be ashamed of.\n\nMy advice if you’re thinking of buying Brother is DON’T.",
    "rating": 1,
    "userName": "Retired Software Consultant",
    "date": "2024-10-17T13:18:42-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Frustrating",
    "review": "The app doesn’t bring my printer out of deep sleep - what’s the point of a remote app if you have to go to the printer to wake it up?",
    "rating": 1,
    "userName": "Bowstock",
    "date": "2024-10-16T13:12:29-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "L2660DW",
    "review": "One of the most amazing and easy to use Machhine made by brother.",
    "rating": 5,
    "userName": "Zain Gujjar Manchester",
    "date": "2024-10-10T10:38:02-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Totally useless design to sell rather than help",
    "review": "I would not recommend",
    "rating": 1,
    "userName": "saas2176",
    "date": "2024-10-09T06:44:34-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Just crashes everytime I try to open it",
    "review": "iPhone 15 Pro, iOS 18.0. Just installed this app and it just crashes every time I try to open it. Not a great start...",
    "rating": 1,
    "userName": "ChrisJ60",
    "date": "2024-10-07T04:14:56-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Doesn’t work in iOS 18",
    "review": "App opens and then immediately closes",
    "rating": 1,
    "userName": "polip",
    "date": "2024-10-04T06:44:30-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Absolute junk",
    "review": "I am not sure whether there is software made by some high schooler. It’s incredibly messy and difficult to understand. Half the time you press button, nothing happens. Sometimes printer decides to print white pages only.  Had a Canon printer for more than 10 years and somehow managed. I will never buy anything from Brother ever again. Not worth a £10, let alone £100.",
    "rating": 1,
    "userName": "phone no copy",
    "date": "2024-09-16T15:44:03-07:00",
    "version": "1.19.0",
    "country": "gb"
  },
  {
    "title": "Buying a printer makes you do more work than the actual employee who sold it.",
    "review": "I bought a printer recently and for the first week it worked great but all of a sudden, once we changed our network, it would refuse to connect to my phone, despite saying it was connected to the Wi-Fi, which IS the main wi-if, it has been like this for a week now and video after video after video, I have found no help from the tutorials i have seen. \nDo better, Brother Company.",
    "rating": 2,
    "userName": "xAesthetic_Vibesx",
    "date": "2024-08-07T05:48:38-07:00",
    "version": "1.18.3",
    "country": "gb"
  },
  {
    "title": "Terrible experience",
    "review": "I would say not good with technology but this app and the whole experience of setting up a new printer has been made exceptional hard to do! constantly going around the houses to be able to print docs off!!! \n\nAvoid! My printer will be going back to the shop and the app deleted ASAP!!!",
    "rating": 1,
    "userName": "Deano2707",
    "date": "2024-06-19T08:54:18-07:00",
    "version": "1.18.1",
    "country": "gb"
  },
  {
    "title": "Super complicated",
    "review": "Impossible to fathom how to set up printer or change font size when print request from mobile. \nThinking of returning machine",
    "rating": 1,
    "userName": "barry1948",
    "date": "2024-05-25T05:05:38-07:00",
    "version": "1.17.0",
    "country": "gb"
  },
  {
    "title": "Eco pro eco rubbish",
    "review": "Worst app I’ve ever used in my life it does not let me register my printer so I can subscribe to eco pro",
    "rating": 1,
    "userName": "shacekmeo",
    "date": "2024-05-22T13:16:16-07:00",
    "version": "1.17.0",
    "country": "gb"
  },
  {
    "title": "Mobile Scan option is amazing",
    "review": "I love the scanning from mobile and directly getting files to my mobile",
    "rating": 5,
    "userName": "Sgogu",
    "date": "2024-05-21T04:54:17-07:00",
    "version": "1.17.0",
    "country": "gb"
  },
  {
    "title": "Manual setup",
    "review": "Excellent instructions very clear and precise. Thought I was going to struggle as I’m not computer literate but I managed easily thank you",
    "rating": 5,
    "userName": "Emma twinkle toes",
    "date": "2024-04-07T03:09:49-07:00",
    "version": "1.16.1",
    "country": "gb"
  },
  {
    "title": "Printer",
    "review": "Super printer, easy to use with phone. I recommend",
    "rating": 5,
    "userName": "Ac6973",
    "date": "2024-03-21T05:48:24-07:00",
    "version": "1.16.1",
    "country": "gb"
  },
  {
    "title": "Printer never works",
    "review": "Spend hrs trying to connect device to printer. Useless",
    "rating": 1,
    "userName": "Totally frustrated…",
    "date": "2024-03-11T13:28:57-07:00",
    "version": "1.16.1",
    "country": "gb"
  },
  {
    "title": "Print app review",
    "review": "The app in itself is ok for straightforward A4 printing but it is very limited when it comes to printing multiples as there is no way to put multiple images on one page , which we use a lot in terms of printing references.\nAlso resizing an image is also very limited , you can only downsize , there is no way to change the image size to make it bigger if you need it.\nIf it wasn’t for the fact that we can only use the mobile app with our brother printer , I wouldn’t choose this app as it is far too limited in every way",
    "rating": 2,
    "userName": "DeeTruewill",
    "date": "2024-02-27T06:24:01-07:00",
    "version": "1.16.1",
    "country": "gb"
  },
  {
    "title": "Nice…..",
    "review": "Great improvement from previous App. Very fluid easy to set up easy to use I couldn’t ask anymore to be honest",
    "rating": 5,
    "userName": "ITLOGIXLTD",
    "date": "2024-02-10T00:53:41-07:00",
    "version": "1.16.0",
    "country": "gb"
  },
  {
    "title": "Adequate",
    "review": "I’d have liked ability to scan to PDF but I can only scan to jpeg etc \n\nMaybe I’m missing something?",
    "rating": 3,
    "userName": "Gurukhan",
    "date": "2024-02-05T06:53:51-07:00",
    "version": "1.16.0",
    "country": "gb"
  },
  {
    "title": "Out of date",
    "review": "No drivers for OS 17 on an iPad. Can’t print anymore. Useless redirection to desktop Mac only.",
    "rating": 1,
    "userName": "QD12341278",
    "date": "2024-02-05T03:09:44-07:00",
    "version": "1.16.0",
    "country": "gb"
  },
  {
    "title": "Exactly what I wanted",
    "review": "Coming from an Xerox Workcentre that kept on jamming and not working on the network, I done the sensible thing and bought a brother laser printer. I have not had one single issue with it since using it for one year.\n\nWhat I love about this company, is that they seem really fair and this even shows in the software and drivers they make. There's no bloatware, no annoying ads, t-shirt upsells or stupid services... the things that brother make 'just work.\n\nI had one small ad for Brothers toner service which I do not mind at all, especially how reasonably priced it is, and how there's no bloatware. Their toners/ink are very reasonably priced also. I hope this company never change what they are clearly very good at, I respect them highly for not 'doing what everyone else is doing' with adverts and bloatware, and good on them. That's why my next printer will also be a Brother, why I will use Brother Genuine toner and why I will be recommending them to everyone.\n\nBrother, Take note that you're doing things right. 👍",
    "rating": 5,
    "userName": "Jtho7447",
    "date": "2024-02-02T01:37:59-07:00",
    "version": "1.16.0",
    "country": "gb"
  },
  {
    "title": "God awful",
    "review": "Never buy one. They are junk!",
    "rating": 1,
    "userName": "Tigerwoods!!",
    "date": "2024-01-13T02:42:25-07:00",
    "version": "1.16.0",
    "country": "gb"
  },
  {
    "title": "Waste of Money",
    "review": "Don’t work",
    "rating": 2,
    "userName": "Century Counting",
    "date": "2023-12-01T10:17:49-07:00",
    "version": "1.15.0",
    "country": "gb"
  },
  {
    "title": "Rubbish",
    "review": "And lack of help from bot chat, 3 hours of my life I won’t get back!",
    "rating": 2,
    "userName": "Fabss me",
    "date": "2023-11-01T04:49:08-07:00",
    "version": "1.14.0",
    "country": "gb"
  },
  {
    "title": "Printing 5x7 on Brother MFC J6940",
    "review": "I have struggled for hours this afternoon trying to resolve how to print photos 5x7 size on my new brother printer which seemed determined to have me print on 4x6. I downloaded this app and followed the instructions in the printing section to use a little cog which gave me\naccess to a variety of sizes (including my beloved 5x7). Instant success. Super photos. I am one happy bunny!",
    "rating": 5,
    "userName": "gillygog5",
    "date": "2023-10-15T09:20:17-07:00",
    "version": "1.14.0",
    "country": "gb"
  },
  {
    "title": "Ok",
    "review": "Connects ok I’ve not printed one out yet but looks good.",
    "rating": 5,
    "userName": "Truth100%zxds",
    "date": "2023-07-28T09:45:29-07:00",
    "version": "1.12.1",
    "country": "gb"
  },
  {
    "title": "much better than HP",
    "review": "easy and works, keep thing simple",
    "rating": 5,
    "userName": "raychan.uk",
    "date": "2023-07-27T09:25:39-07:00",
    "version": "1.12.1",
    "country": "gb"
  },
  {
    "title": "Stop connecting",
    "review": "The system has just stop connecting from my computer or mobile phone",
    "rating": 1,
    "userName": "O-Tendo",
    "date": "2023-06-26T07:09:44-07:00",
    "version": "1.11.1",
    "country": "gb"
  },
  {
    "title": "Brother Connect Print App",
    "review": "This app will not stay as an icon on my iPhone.  Each time I need to print I have to go to the App Store and download again.  I can the print a document but the app then disappears so have to go through the same procedure each time.",
    "rating": 2,
    "userName": "EliieB2000",
    "date": "2023-05-26T21:50:52-07:00",
    "version": "1.11.1",
    "country": "gb"
  },
  {
    "title": "Brilliantly easy to use",
    "review": "I downloaded the app on my phone when I got the printer needed to print off a file from my emails on my phone while sat in my chair. This press print and bingo outcome is the sheet I need it effortlessly simple. Thank you brother",
    "rating": 5,
    "userName": "The British Brickie",
    "date": "2023-05-24T12:14:14-07:00",
    "version": "1.11.1",
    "country": "gb"
  },
  {
    "title": "Connection",
    "review": "It doesn’t work",
    "rating": 1,
    "userName": "hkp4u",
    "date": "2023-03-18T13:44:54-07:00",
    "version": "1.10.2",
    "country": "gb"
  },
  {
    "title": "EcoPro not working in app",
    "review": "Signed up for EcoPro, told to add printer to my account through the app. EcoPro link in app throws back an internal error so unable to use EcoPro benefits!!!!\n\nNo easy way to provide app feedback and bugs apart from via a review. Not a great experience so far….",
    "rating": 1,
    "userName": "Si99uk",
    "date": "2023-03-16T12:36:36-07:00",
    "version": "1.10.2",
    "country": "gb"
  },
  {
    "title": "Preferred the old model",
    "review": "Our old brother stopped printing to a high enough quality so we bought a new one which means a new app. Which means less flexibility in printing for some reason. Can’t make images small enough and can’t load multiple images to print on one page thus reducing waste.\nSeems a step back rather than forward.",
    "rating": 1,
    "userName": "S,F&L",
    "date": "2023-02-19T10:01:55-07:00",
    "version": "1.10.1",
    "country": "gb"
  },
  {
    "title": "Can’t connect, can’t print",
    "review": "My previous Brother connected directly via our home wifi network, this new printer requires the app, which cant find the printer, has to be installed on each device using the printer (the whole family) and even then is variable.",
    "rating": 1,
    "userName": "Ed..... S",
    "date": "2023-01-15T23:58:47-07:00",
    "version": "1.9.2",
    "country": "gb"
  },
  {
    "title": "Great printer",
    "review": "My old printer had given up.  This is a superb upgrade very pleased with purchase.  Easy to set up.",
    "rating": 5,
    "userName": "Tullynest",
    "date": "2023-01-11T04:18:34-07:00",
    "version": "1.9.2",
    "country": "gb"
  },
  {
    "title": "Mobile Connect",
    "review": "Good - easy to connect and use.",
    "rating": 5,
    "userName": "StephenEvans",
    "date": "2022-08-29T01:43:13-07:00",
    "version": "1.7.1",
    "country": "gb"
  },
  {
    "title": "My Brother printer",
    "review": "Your service engineer came to sort out why my printer would not work.\nWhat a great guy he got it up and running in a few minutes, both on my Ipone/ IPad, what a great job it dose.\nI am glad I have stayed with Brother,\nI give a 10/10 for backup service and for quality print out and printer\nDCP-J1200W. Thank you.\nKind regards.\nDavid.\nDavid Winsor-Green.",
    "rating": 5,
    "userName": "moascar/Dave",
    "date": "2022-05-18T05:55:25-07:00",
    "version": "1.5.0",
    "country": "gb"
  },
  {
    "title": "Debbie R",
    "review": "I found this very easy to set up and so far have had no issues with it whatsoever. If you are not tech savvy have somebody to guide you, took me about 15 minutes debi Rr",
    "rating": 5,
    "userName": "debbi rr",
    "date": "2022-02-14T05:24:48-07:00",
    "version": "1.3.0",
    "country": "gb"
  },
  {
    "title": "A top model printer",
    "review": "I have just replaced my new HP printer with this one - chalk and cheese! Brother is certainly a very welcome addition.",
    "rating": 5,
    "userName": "Boswald56",
    "date": "2022-02-12T09:54:44-07:00",
    "version": "1.3.0",
    "country": "gb"
  },
  {
    "title": "Password",
    "review": "It constantly loses the network and then I have to retype the password all over again which is a pain.",
    "rating": 1,
    "userName": "Didi Paul",
    "date": "2022-01-14T06:38:03-07:00",
    "version": "1.2.2",
    "country": "gb"
  },
  {
    "title": "Lakh83",
    "review": "I brought brother printer in 2024 it’s working very well and it’s connect with phone and your computer very easy.",
    "rating": 5,
    "userName": "Lakh83",
    "date": "2026-01-05T04:53:32-07:00",
    "version": "1.22.1",
    "country": "ca"
  },
  {
    "title": "Essaie # 1",
    "review": "Impossible d’imprimer",
    "rating": 3,
    "userName": "guayves",
    "date": "2025-12-30T12:17:30-07:00",
    "version": "1.22.1",
    "country": "ca"
  },
  {
    "title": "The worst",
    "review": "No indication, I had to figure how to connect it to the WiFi on my own, but the worst, I need to create a password to continue configuration and every time I try one (that match the indication) it say temporary error and it kick me out. There is no way to get help I checked on the website but it is like a maze!!",
    "rating": 1,
    "userName": "Marc34567",
    "date": "2025-12-29T17:06:46-07:00",
    "version": "1.22.1",
    "country": "ca"
  },
  {
    "title": "Easy set up.BS",
    "review": "After instructions aren’t even there to tell you what to do. Connecting to the Internet as a joke.",
    "rating": 1,
    "userName": "BubbaGManitoba",
    "date": "2025-12-24T19:32:05-07:00",
    "version": "1.22.0",
    "country": "ca"
  },
  {
    "title": "Nothing works",
    "review": "Terrible app and terrible printers. What good are apps or printers when they just refuse to work?",
    "rating": 1,
    "userName": "JayTheMortal",
    "date": "2025-12-20T09:00:06-07:00",
    "version": "1.22.0",
    "country": "ca"
  },
  {
    "title": "You need WiFi to set up WiFi-Direct",
    "review": "This app is supposed to make it possible to set up WiFi-Direct on your phone - except it doesn’t work, because I don’t have WiFi. That’s exactly why I need WiFi-direct. I figured it out on my own but this app is a joke.",
    "rating": 1,
    "userName": "Zufrieda",
    "date": "2025-12-11T13:50:17-07:00",
    "version": "1.22.0",
    "country": "ca"
  },
  {
    "title": "Brother printer",
    "review": "Very easy and intuitive to install. Also very easy to print files straight from the phone. Probably the feature I use the most.  I use it for game sheets for sports, and for various other work tasks. Would highly recommend.",
    "rating": 5,
    "userName": "glenkurti",
    "date": "2025-12-03T16:47:28-07:00",
    "version": "1.21.5",
    "country": "ca"
  },
  {
    "title": "Very Poor Set up",
    "review": "Very complicated on set up, hard to use with apple",
    "rating": 1,
    "userName": "IMPOSSIBLE COMPLICATED PRINTER",
    "date": "2025-11-08T18:41:09-07:00",
    "version": "1.21.5",
    "country": "ca"
  },
  {
    "title": "Scan",
    "review": "Quick and fast",
    "rating": 5,
    "userName": "D virk",
    "date": "2025-10-28T10:20:01-07:00",
    "version": "1.21.4",
    "country": "ca"
  },
  {
    "title": "Wireless printing",
    "review": "Works at times and won’t contact at other times. Hard to troubleshoot",
    "rating": 1,
    "userName": "SMg2074875",
    "date": "2025-10-26T07:13:28-07:00",
    "version": "1.21.4",
    "country": "ca"
  },
  {
    "title": "Terrible",
    "review": "Don’t bother with this app if you can manually enter your wifi ssid from the printer. This app and connectivity with the printer is an exercise in frustration. How they even release it is mind boggling",
    "rating": 1,
    "userName": "SingularityNot",
    "date": "2025-09-01T18:15:44-07:00",
    "version": "1.21.0",
    "country": "ca"
  },
  {
    "title": "Excellent App",
    "review": "While the Brother printer driver installation package took several confusing loops through promotional signups and wasted the better part of an hour before connecting the Brother Mobile Connect app is plug and play.",
    "rating": 5,
    "userName": "Pogo2025",
    "date": "2025-08-29T15:01:41-07:00",
    "version": "1.21.0",
    "country": "ca"
  },
  {
    "title": "Great",
    "review": "So easy but I had to download two apps  but I removed it and it still works",
    "rating": 4,
    "userName": "Get it now don’t wait",
    "date": "2025-08-12T17:21:25-07:00",
    "version": "1.21.0",
    "country": "ca"
  },
  {
    "title": "Ne répond pas bien avec mon mobile",
    "review": "J’ai rarement le résultat souhaiter à imprimer des documents à partir de mon mobile, ça bug régulièrement.",
    "rating": 1,
    "userName": "Thaliefree",
    "date": "2025-08-08T08:11:10-07:00",
    "version": "1.21.0",
    "country": "ca"
  },
  {
    "title": "Great all",
    "review": "Great overall app",
    "rating": 5,
    "userName": "Syed78600",
    "date": "2025-07-28T17:34:03-07:00",
    "version": "1.21.0",
    "country": "ca"
  },
  {
    "title": "Perfect Machine",
    "review": "I am far from a techy person  and this printer was easy to set up to print from my laptop and my phone. Like really easy. Very satisfied.",
    "rating": 5,
    "userName": "ashabrookedickeson",
    "date": "2025-07-26T11:21:27-07:00",
    "version": "1.21.0",
    "country": "ca"
  },
  {
    "title": "Smooth connection",
    "review": "Easy to operate through phone app",
    "rating": 5,
    "userName": "Bond241",
    "date": "2025-07-24T10:19:19-07:00",
    "version": "1.21.0",
    "country": "ca"
  },
  {
    "title": "Sucks",
    "review": "Brother sucks like all printers. Prints sometimes. Sometimes not. Can’t always communicate. Want to print black and white? Well forget it if you are low on yellow!!! More software. More subscription programs. And this app?  Why more bloat? I just want to print stuff. And all of the printer makers come from the same evil school of sorcery and tricks to clean your wallet while going insane just trying to print stuff.",
    "rating": 1,
    "userName": "jeremy!",
    "date": "2025-07-22T16:52:52-07:00",
    "version": "1.20.5",
    "country": "ca"
  },
  {
    "title": "I hate AirPrint",
    "review": "Thank you for saving me, this is the only way I can use my printer without bringing a laptop everywhere",
    "rating": 5,
    "userName": "cannedcod",
    "date": "2025-07-19T19:14:34-07:00",
    "version": "1.20.5",
    "country": "ca"
  },
  {
    "title": "Terrible confusing product",
    "review": "Horrible printer, I will advise everyone to not buy this. It is extremely confusing to get it connected to your device. You have to download a bunch of apps and it still doesn’t work. I had to screenshot my document as a photo and print it that way.",
    "rating": 1,
    "userName": "brookwe",
    "date": "2025-07-05T18:23:56-07:00",
    "version": "1.20.5",
    "country": "ca"
  },
  {
    "title": "For every service why asking for ….",
    "review": "Every time why would it ask for subscription \nOnce connected printing and scanning by mobile from same network should not ask for subscription",
    "rating": 1,
    "userName": "blue bare love",
    "date": "2025-07-03T15:18:00-07:00",
    "version": "1.20.5",
    "country": "ca"
  },
  {
    "title": "Updates",
    "review": "The password on the back and the updates don’t work. It always says “connection lost”. It’s on, ready to go, it prints but it doesn’t update. It seems by design.",
    "rating": 2,
    "userName": "Rossco_peako",
    "date": "2025-06-16T17:37:37-07:00",
    "version": "1.20.5",
    "country": "ca"
  },
  {
    "title": "Worth the money!",
    "review": "Easy to install; operate and maintain.",
    "rating": 5,
    "userName": "Mohanakrishnan Sreedharan",
    "date": "2025-06-08T19:40:48-07:00",
    "version": "1.20.5",
    "country": "ca"
  },
  {
    "title": "Useless",
    "review": "The most frustrating",
    "rating": 1,
    "userName": "It totally sucks",
    "date": "2025-05-23T11:16:31-07:00",
    "version": "1.20.4",
    "country": "ca"
  },
  {
    "title": "Cannot connect",
    "review": "I’m following the instructions, but I cannot connect with either wired or wifi to either my desktop computer or to my iphone. Have been trying on an off most of this week.",
    "rating": 1,
    "userName": "Marionqacdgtti,",
    "date": "2025-05-23T06:52:06-07:00",
    "version": "1.20.4",
    "country": "ca"
  },
  {
    "title": "Amazing",
    "review": "I never knew scanning would be this easy\nIf I can do it, anyone can do it\nThank you so much, brother",
    "rating": 5,
    "userName": "Kamil k",
    "date": "2025-05-16T19:34:21-07:00",
    "version": "1.20.4",
    "country": "ca"
  },
  {
    "title": "Awful service and system",
    "review": "I have bought and returned 3 printers because they will not print on wifi. I’m out of options now. This is ridiculous.",
    "rating": 1,
    "userName": "Andrea12344567",
    "date": "2025-05-09T06:49:04-07:00",
    "version": "1.20.4",
    "country": "ca"
  },
  {
    "title": "Horrible",
    "review": "Doesn’t connect",
    "rating": 1,
    "userName": "Bergamasco85",
    "date": "2025-04-07T01:37:01-07:00",
    "version": "1.20.4",
    "country": "ca"
  },
  {
    "title": "Canada user can’t use it",
    "review": "I’m on able to use this app because I’m in Canada",
    "rating": 1,
    "userName": "Omgnickbehave",
    "date": "2025-03-17T21:09:14-07:00",
    "version": "1.20.2",
    "country": "ca"
  },
  {
    "title": "Constant Jams",
    "review": "I have a brand new laser Brother printer and I am getting constant jams or direction to turn off then on to clear problems. Very very frustrating!!!",
    "rating": 1,
    "userName": "BEPozniak",
    "date": "2025-03-13T16:20:01-07:00",
    "version": "1.20.2",
    "country": "ca"
  },
  {
    "title": "Sucks",
    "review": "This machine sucks",
    "rating": 1,
    "userName": "Flyerfan12!",
    "date": "2025-01-30T08:51:52-07:00",
    "version": "1.20.0",
    "country": "ca"
  },
  {
    "title": "One of the best app I ever seen",
    "review": "Perfection just don’t leave and enjoy it",
    "rating": 5,
    "userName": "Kavoshkln",
    "date": "2025-01-16T23:09:12-07:00",
    "version": "1.20.0",
    "country": "ca"
  },
  {
    "title": "It’s real good machine",
    "review": "It’s very easy to use . It’s only take few minutes to set up and ready to use. I love this.",
    "rating": 5,
    "userName": "jatinder pal",
    "date": "2025-01-11T20:20:15-07:00",
    "version": "1.20.0",
    "country": "ca"
  },
  {
    "title": "Imprimante",
    "review": "L’imprimante fonctionne pas,C’est toujours écrit clean de rouler papier",
    "rating": 1,
    "userName": "Double tannée",
    "date": "2024-12-27T15:45:18-07:00",
    "version": "1.20.0",
    "country": "ca"
  },
  {
    "title": "Printer never works properly over wifi when you need it to.",
    "review": "Garbage",
    "rating": 1,
    "userName": "Sucker11111",
    "date": "2024-12-24T09:45:25-07:00",
    "version": "1.20.0",
    "country": "ca"
  },
  {
    "title": "Mfc 1012",
    "review": "Always goes offline !!!!!!!!!",
    "rating": 1,
    "userName": "Frustrating ex brother",
    "date": "2024-12-19T16:53:03-07:00",
    "version": "1.20.0",
    "country": "ca"
  },
  {
    "title": "Confirmation Failure",
    "review": "Confirming an of site printing always needed up with either an error of failing to auto-detect the printer or it keeps silent forever.",
    "rating": 4,
    "userName": "BTBello",
    "date": "2024-12-14T17:39:55-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Love love love it",
    "review": "Very easy to install and the cold quality is absolutely fantastic! I’m sooo happy with my purchase",
    "rating": 5,
    "userName": "hanz2329",
    "date": "2024-11-24T16:48:49-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Great Printer",
    "review": "Perfect for my in home office, works great! \nBut only compatible with Brother Brand ink.",
    "rating": 5,
    "userName": "Beanrito!",
    "date": "2024-11-22T14:32:39-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Google Drive",
    "review": "Not printing directly from my drive",
    "rating": 1,
    "userName": "Nick07996010",
    "date": "2024-11-13T17:25:49-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "wifi",
    "review": "已经什么年代了，wifi都连不上，如果没有猪头，日本已经完了",
    "rating": 1,
    "userName": "为什么总停",
    "date": "2024-11-13T12:50:10-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Súper",
    "review": "Merveilleuse cette machine  a dépassé mes attentes.",
    "rating": 5,
    "userName": "Lïïa",
    "date": "2024-11-05T18:51:42-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Installation très difficile sinon impossible",
    "review": "Pas convivial dutout.",
    "rating": 1,
    "userName": "AnnickBellavance",
    "date": "2024-11-01T16:54:51-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Don’t buy this",
    "review": "Horribly inconsistent product, not easy to troubleshoot. I regret buying this printer.",
    "rating": 1,
    "userName": "Cam - Calgary",
    "date": "2024-10-24T11:45:27-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "MFC-J6955DW its expensive",
    "review": "Few issues with the app and printer:\n\n1. Most of the time app says out of memory when trying to print something remotely (mobile data)\n\n2. Fax option is not available in mobile app, I was using fax option in my $100 HP printer even on mobile data, its bummer\n\n3. Printer is not able to feed 80lb double sided glossy paper my cheaper HP printer was able to print it.\n\nTesting still in progress!!",
    "rating": 3,
    "userName": "Deepesh.me",
    "date": "2024-10-20T08:08:05-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Worked pretty well",
    "review": "Just got the printer set up and at first it wouldn’t connect to Wifi, probably a typing error because right away it worked and printed .  What a relief after a previously unreliable printer.",
    "rating": 3,
    "userName": "MAjorityPlayer",
    "date": "2024-10-09T16:40:11-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Garbage",
    "review": "No use of this machine, no support no self explanatory, learn from Apple",
    "rating": 1,
    "userName": "Manoj canada",
    "date": "2024-10-05T08:45:30-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Very slow app",
    "review": "The app does not work properly and sometimes does not recognize the printer to send the print command.",
    "rating": 2,
    "userName": "Mihirocks",
    "date": "2024-09-30T16:33:31-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Mcf-j1205w",
    "review": "I’ve had it for a month and so far enjoying it more than the HP I used to have. I’m not sure about the claim that the ink last longer than the HP models other than maybe there’s more in the Brother cartridges but at least they are less expensive than HP\n\nTwo issues. \n1) is like the ability to scale a photo before printing. Maybe there’s a way of doing it but I couldn’t find it\n2) I found the colours dull when I printed a picture on plain paper. Thought they would be a little more vibrant. Yes, I know it wasn’t photographic paper but…..",
    "rating": 4,
    "userName": "dejawoo2",
    "date": "2024-09-27T08:24:09-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "It is unable to connect",
    "review": "It is very hard to connect",
    "rating": 1,
    "userName": "NicknameWeylin",
    "date": "2024-09-06T14:07:26-07:00",
    "version": "1.19.0",
    "country": "ca"
  },
  {
    "title": "Printer does not work",
    "review": "It always says paper tray empty no matter what I do. Change the printer settings, restart the machine. Make the settings match exactly what I am printing. Take tray out and put it back in. I even purchased the recommended paper suggested by brother and it STILL doesn’t work. Very disappointed since I bought this after reading reviews from amazon and rtings.com.",
    "rating": 1,
    "userName": "mrluckysage",
    "date": "2024-08-26T14:43:01-07:00",
    "version": "1.18.3",
    "country": "ca"
  },
  {
    "title": "MFC- J4535DW",
    "review": "This is a great printer and has good resolution for a coloured printer. I wish I bought this sooner. Fast and beautiful pictures for my projects.",
    "rating": 5,
    "userName": "Anig52",
    "date": "2024-08-13T22:12:26-07:00",
    "version": "1.18.3",
    "country": "ca"
  },
  {
    "title": "Système air print défaillant",
    "review": "Je suis obligé d’utiliser l’application pour imprimer un document simple car selon le air print l’imprimante ne répond pas 1 fois sur 10",
    "rating": 1,
    "userName": "Larry599?",
    "date": "2024-08-12T19:18:28-07:00",
    "version": "1.18.3",
    "country": "ca"
  },
  {
    "title": "DCP-L2640DW",
    "review": "Print from iPhone is pretty fast, but scanning is extremely slow",
    "rating": 4,
    "userName": "tangsense",
    "date": "2024-06-29T11:05:53-07:00",
    "version": "1.18.1",
    "country": "ca"
  },
  {
    "title": "Mobile app does not work",
    "review": "Mobile ap does not work",
    "rating": 1,
    "userName": "SamJose1998",
    "date": "2024-06-24T08:15:21-07:00",
    "version": "1.18.1",
    "country": "ca"
  },
  {
    "title": "Won’t register product won’t connect to internet no phone customer support",
    "review": "Not a great start and guess what figure it out yourself because there is no support",
    "rating": 1,
    "userName": "Dill61",
    "date": "2024-06-04T17:24:10-07:00",
    "version": "1.17.0",
    "country": "ca"
  },
  {
    "title": "Connection issue",
    "review": "Often disconnects while printing from phone and thereby wastes paper.",
    "rating": 1,
    "userName": "Mehrab Stalin",
    "date": "2024-05-04T09:23:35-07:00",
    "version": "1.17.0",
    "country": "ca"
  },
  {
    "title": "0lder Guy",
    "review": "Purchased and installed without any hassle! Easy-Peasy!!",
    "rating": 5,
    "userName": "Kingforshort",
    "date": "2024-04-12T14:12:12-07:00",
    "version": "1.16.1",
    "country": "ca"
  },
  {
    "title": "My review",
    "review": "Very bad connection",
    "rating": 1,
    "userName": "Aligjan",
    "date": "2024-03-19T18:45:14-07:00",
    "version": "1.16.1",
    "country": "ca"
  },
  {
    "title": "Brother printer",
    "review": "Just a great printer. Why? Fast, easy set up , and any paper jams are easy to get unstuck!",
    "rating": 5,
    "userName": "kath8877",
    "date": "2024-02-08T10:00:15-07:00",
    "version": "1.16.0",
    "country": "ca"
  },
  {
    "title": "Fast",
    "review": "Love it used on two documents.",
    "rating": 5,
    "userName": "RODNEY FROM CANADA",
    "date": "2024-02-05T08:44:41-07:00",
    "version": "1.16.0",
    "country": "ca"
  },
  {
    "title": "App impression",
    "review": "Très bien fait et facile d’utilisation",
    "rating": 5,
    "userName": "Totoro5667766",
    "date": "2024-02-04T06:52:08-07:00",
    "version": "1.16.0",
    "country": "ca"
  },
  {
    "title": "NOTHING BUT TROUBLE",
    "review": "I’ve tried",
    "rating": 1,
    "userName": "Deb Lec",
    "date": "2024-01-31T07:13:44-07:00",
    "version": "1.16.0",
    "country": "ca"
  },
  {
    "title": "Printer",
    "review": "Love it.its faster in printing than I expected",
    "rating": 5,
    "userName": "keffab1",
    "date": "2024-01-05T06:06:12-07:00",
    "version": "1.16.0",
    "country": "ca"
  },
  {
    "title": "AirPrint Stopped Working",
    "review": "Downloaded this app - suddenly air print stopped working.  Updated firmware, did a hard reset - nothing works.  What a piece of trash!!!",
    "rating": 1,
    "userName": "jbharri",
    "date": "2023-12-14T09:07:47-07:00",
    "version": "1.15.1",
    "country": "ca"
  },
  {
    "title": "Beware",
    "review": "Can’t print landscape with this app",
    "rating": 2,
    "userName": "Nanoutzi",
    "date": "2023-12-10T11:33:52-07:00",
    "version": "1.15.1",
    "country": "ca"
  },
  {
    "title": "Pas beaucoup d’options",
    "review": "Sa dit qu’on peut imprimer des photos mais on ne peu pas choisir de format d’impression comme 4x6, 5x7 et 8x10. On peut seulement imprimer des photos en A4 ou grand format… on ne peut pas gérer notre imprimante à partir de cette applications comme définir le mode d’impression par défaut. c’est applications ne sert pas à grand chose à part imprimer nos documents mais ça nous pouvons déjà le faire à partir de l’application où se trouve nos documents ou d’Internet.",
    "rating": 1,
    "userName": "Jarine0601",
    "date": "2023-11-23T04:29:37-07:00",
    "version": "1.15.0",
    "country": "ca"
  },
  {
    "title": "Satisfaction",
    "review": "Excellent appareil, facile a programmer.",
    "rating": 5,
    "userName": "hexopan",
    "date": "2023-10-16T15:25:01-07:00",
    "version": "1.14.0",
    "country": "ca"
  },
  {
    "title": "It doesn’t let me print in the app",
    "review": "It keeps saying I need to delete data and when I do it still shows making it impossible to use the app to print I have to use AirPrint all the time",
    "rating": 1,
    "userName": "vggg gc vm",
    "date": "2023-10-07T14:00:08-07:00",
    "version": "1.14.0",
    "country": "ca"
  },
  {
    "title": "Brother 2550DW",
    "review": "Amazing and easy to use the printer. App is really very very convenient for easy scanning and printing.",
    "rating": 5,
    "userName": "Kazmeeee",
    "date": "2023-08-08T19:05:20-07:00",
    "version": "1.13.0",
    "country": "ca"
  },
  {
    "title": "Stupid printer!",
    "review": "I had my iPad and my iPhone connected to the printer and now they both won’t print for me!!!\nArgh!!!!!!!",
    "rating": 1,
    "userName": "hpsaucd",
    "date": "2023-06-20T10:47:52-07:00",
    "version": "1.11.1",
    "country": "ca"
  },
  {
    "title": "Printing",
    "review": "Very slow printing",
    "rating": 4,
    "userName": "dhthjjjdxnn",
    "date": "2023-05-18T15:05:00-07:00",
    "version": "1.11.1",
    "country": "ca"
  },
  {
    "title": "Doesn’t Connect to the Phone HP more than two decades and never had this issue",
    "review": "FYI: I bought Brother simple because of it printing capabilities; Not certain about it now..",
    "rating": 1,
    "userName": "penguino_101",
    "date": "2023-04-05T20:06:37-07:00",
    "version": "1.10.3",
    "country": "ca"
  },
  {
    "title": "I love my new brother",
    "review": "He’s a great bro.",
    "rating": 5,
    "userName": "The one who whispers to frogs.",
    "date": "2023-03-28T16:10:42-07:00",
    "version": "1.10.2",
    "country": "ca"
  },
  {
    "title": "Connect",
    "review": "Has anyone been able to figure out how to connect the printer to your phone AND iPad?",
    "rating": 1,
    "userName": "niiiiiiiicoooomillz",
    "date": "2023-02-03T10:02:22-07:00",
    "version": "1.10.0",
    "country": "ca"
  },
  {
    "title": "Could be more functional",
    "review": "This is a great app and adds some more functionality than the native iOS print utility. However, I was looking for an app that can print multi-page documents in a booklet format. Although you can print 2 or 4 pages scaled on a single piece of paper and you can specify a range of pages you can’t change the order in which the \npages print. \n\nFor example: if I had an 8 page document that I wanted in booklet format I would need two pages on each side of the sheet of paper. The cover of the booklet would be pages 8 and 1, and on the opposite side pages 2 and 7 and so on. It seems to me that this would be a simple thing to add to the functionality of this app. I hope they do.",
    "rating": 4,
    "userName": "J0M023",
    "date": "2022-10-10T10:46:33-07:00",
    "version": "1.8.0",
    "country": "ca"
  },
  {
    "title": "Can’t connect",
    "review": "Can’t connect to printer",
    "rating": 1,
    "userName": "Og1. Mia 33129",
    "date": "2022-09-03T10:08:19-07:00",
    "version": "1.7.1",
    "country": "ca"
  },
  {
    "title": "Great",
    "review": "Good and decent app,\nTo upgrade this app, it needs an OCR for the scanning option!",
    "rating": 4,
    "userName": "ellewist1",
    "date": "2022-08-08T17:28:08-07:00",
    "version": "1.7.0",
    "country": "ca"
  },
  {
    "title": "It’s fun to load an APP",
    "review": "Fun to find out that it is not intuitive friendly. When you scan, the scanner makes noises but, if it scanned, the page disappears into . . . Where? When you have a multi page item to print you must go through 3 or 4 (I lost count) steps to print page 5 only. Not saying it’s bad just saying it is cumbersome and the language used is language a computer wonk would use which is foreign to most people. To print a Safari page was a hit and miss exercise. It doesn’t come up on Apple’s share arrow. Before letting APPs like this fly someone should give it to a few non computer people for whom a computer or iPhone or iPad is a tool, not a career. We want to find and push a button easily and quickly. The Apple's and Brother’s of this world should have a zero star for reviews.",
    "rating": 1,
    "userName": "Jsponk",
    "date": "2022-07-03T18:50:55-07:00",
    "version": "1.6.0",
    "country": "ca"
  },
  {
    "title": "After the app updated the machine cannot be added to the app",
    "review": "After the app was updated the machine cannot be add to the app\n\nSuch a wast of time. The wifi was connected but just the machine cannot be added to the app. \n\nPlease fix it",
    "rating": 1,
    "userName": "Hokudo19",
    "date": "2022-05-14T07:47:01-07:00",
    "version": "1.5.0",
    "country": "ca"
  },
  {
    "title": "Printer",
    "review": "Know your wifi password or you will go insane trying to set it up",
    "rating": 5,
    "userName": "Gradys Mom",
    "date": "2022-04-03T13:53:45-07:00",
    "version": "1.4.0",
    "country": "ca"
  },
  {
    "title": "So easy",
    "review": "It was so easy to set up and print from my smart phone. I love it!",
    "rating": 5,
    "userName": "Superstar rising",
    "date": "2022-01-31T12:17:50-07:00",
    "version": "1.3.0",
    "country": "ca"
  },
  {
    "title": "Network issues",
    "review": "It worked at first and on my second try scanning the device says offline and I’m not able to connect after more than 10 times in different time to see if it was a network problem but it wasn’t, so not recommended this printer",
    "rating": 1,
    "userName": "N123232",
    "date": "2022-01-31T04:34:45-07:00",
    "version": "1.3.0",
    "country": "ca"
  },
  {
    "title": "Works if it wants to…",
    "review": "Just set up my printer the other day and it already has been having issues. Kept saying it was offline on the app and nothing I could find would fix it so I had to forget the device and reattach it. Had to try about 5 times before it would find the printer on the network. Not super impressed its already having issues after 2 print jobs.",
    "rating": 1,
    "userName": "Lenny2222227",
    "date": "2022-01-17T18:12:38-07:00",
    "version": "1.2.2",
    "country": "ca"
  },
  {
    "title": "Mobile connect review",
    "review": "This was amazing probably the best printer app I have ever used I loved it so much like you don’t understand how much I loved it I wish I could use this every single day of my life this printer app has done nothing but change my life my wife came back after leaving me my son got into a good school I stopped drinking I hope this printer app becomes the most successful printer app ever this has made me so happy thank you mobile connect",
    "rating": 5,
    "userName": "Phono12332",
    "date": "2025-12-29T01:49:10-07:00",
    "version": "1.22.1",
    "country": "au"
  },
  {
    "title": "更新后，打印功能没有了",
    "review": "不知道为什么，找不到了",
    "rating": 1,
    "userName": "枣1531",
    "date": "2025-11-13T07:28:18-07:00",
    "version": "1.21.5",
    "country": "au"
  },
  {
    "title": "Basic functionality works, but scanning experience is frustrating",
    "review": "The app generally does what it’s designed for — I can print, check machine status, and perform basic tasks. However, there are two major issues that really hurt the experience:\n\t1.\tScanning reliability: Every time I try to scan, the app shows “unable to connect” unless I completely shut down and restart the machine first. It’s strange because I can print from the same app and view the printer’s status, so the connection clearly exists.\n\t2.\tLimited scan editing: After scanning, there’s no option to reorder pages. You can edit or crop, but not rearrange — something my older $60 Canon printer handled effortlessly.\n\nIf these two issues are addressed, this would be a solid companion app. For now, it’s functional but far from smooth.",
    "rating": 2,
    "userName": "BULB232amra612",
    "date": "2025-11-01T16:47:19-07:00",
    "version": "1.21.5",
    "country": "au"
  },
  {
    "title": "Painful",
    "review": "Must be a better way to",
    "rating": 1,
    "userName": "Jungles23",
    "date": "2025-10-18T19:44:22-07:00",
    "version": "1.21.4",
    "country": "au"
  },
  {
    "title": "So many app issues",
    "review": "The app crashes and barely opens even after updating. Often does not connect to any device that I have regardless if I’m sitting right next to printer and connected to wifi. Haven’t worked out the trick yet. I wouldn’t get a printer that needs this app again. There has to be easier ways to print.",
    "rating": 1,
    "userName": "kvry385062",
    "date": "2025-10-15T15:28:56-07:00",
    "version": "1.21.3",
    "country": "au"
  },
  {
    "title": "Pretty good",
    "review": "Generally pretty easy to use. Scanning is ok but it’s annoying that you can reorder the pages on the app. Had to do it on the computer after.",
    "rating": 4,
    "userName": "LamprellA",
    "date": "2025-10-09T23:52:29-07:00",
    "version": "1.21.3",
    "country": "au"
  },
  {
    "title": "It doesn’t work",
    "review": "Doesn’t work",
    "rating": 1,
    "userName": "Galesburghehehhe",
    "date": "2025-10-06T03:01:20-07:00",
    "version": "1.21.2",
    "country": "au"
  },
  {
    "title": "Network",
    "review": "What a nightmare trying to connect to the home network.",
    "rating": 1,
    "userName": "Disgruntled No 2.",
    "date": "2025-09-21T16:49:12-07:00",
    "version": "1.21.1",
    "country": "au"
  },
  {
    "title": "Photo printing is painful.",
    "review": "App keeps freezing",
    "rating": 1,
    "userName": "Turned balaclavas",
    "date": "2025-09-11T03:52:31-07:00",
    "version": "1.21.1",
    "country": "au"
  },
  {
    "title": "Terrible",
    "review": "Terrible - complicated",
    "rating": 1,
    "userName": "Ben’s$2)?:?",
    "date": "2025-08-23T22:13:30-07:00",
    "version": "1.21.0",
    "country": "au"
  },
  {
    "title": "Simply awesome!",
    "review": "Simply awesome to use and set up..love it",
    "rating": 5,
    "userName": "Other Geoff",
    "date": "2025-08-21T04:55:18-07:00",
    "version": "1.21.0",
    "country": "au"
  },
  {
    "title": "Mr",
    "review": "Beautiful technology and easy to set up (by my IT-expert wife ….)!",
    "rating": 5,
    "userName": "Ollie6513",
    "date": "2025-08-19T07:59:54-07:00",
    "version": "1.21.0",
    "country": "au"
  },
  {
    "title": "Full of bugs",
    "review": "It is hard to tell where the fault lies but this app and the printer scanner it operates (MFC-L2800DW) are not friends. Despite clearly being on the same wifi network, they often cannot see each other and it requires for the app to be completely uninstalled, reinstalled and set up from scratch in order to scan a document.\nFurthermore, multi-page documents are then saved as a separate document for each page! Disastrous.",
    "rating": 1,
    "userName": "Yepmeister",
    "date": "2025-08-03T23:07:57-07:00",
    "version": "1.21.0",
    "country": "au"
  },
  {
    "title": "MFC-J4440DW",
    "review": "This printer has been one of the best I’ve had. It’s easy to set up, very user friendly & so quick to respond to printing. Also the 150 page paper tray is so much better than any of the others in its class. 5 Star to Brother for brilliant design.\nThanks so much.\nBen",
    "rating": 5,
    "userName": "Ben Saad 2c",
    "date": "2025-07-20T02:25:26-07:00",
    "version": "1.20.5",
    "country": "au"
  },
  {
    "title": "Good quality",
    "review": "For the price I am very happy with it, very easy to setup and the quality of colours it is great also.",
    "rating": 5,
    "userName": "Mrs Csr",
    "date": "2025-07-04T20:01:18-07:00",
    "version": "1.20.5",
    "country": "au"
  },
  {
    "title": "So easy",
    "review": "Can't get much easier",
    "rating": 5,
    "userName": "saves driven",
    "date": "2025-06-23T22:53:40-07:00",
    "version": "1.20.5",
    "country": "au"
  },
  {
    "title": "Brother app update please",
    "review": "Really happy with app but can developers please include the option to edit zoom in and out with the touch of the fingers before image is printed as the ability to adjust brings a whole new convenience for us Artists and we hope brother app support can incorporate into next update please. Currently most apps have this functionality but yes Definitely a 5 star rating if this small adjustment can be added. Thanks",
    "rating": 5,
    "userName": "DZ AdroZzZ",
    "date": "2025-06-07T19:42:04-07:00",
    "version": "1.20.5",
    "country": "au"
  },
  {
    "title": "Manual Operation",
    "review": "You fill it with paper and the printer says you  have to manually add each sheet of paper. \n\nThe printer then doesn’t work despite there is plenty of paper in the tray\nFrustrating",
    "rating": 1,
    "userName": "Robs43",
    "date": "2025-05-19T06:33:26-07:00",
    "version": "1.20.4",
    "country": "au"
  },
  {
    "title": "If it ain’t broke don’t fix it",
    "review": "The new app/updated app has made my printer almost unusable. I have to reconnect to my WiFi each time, and this process is so arduous through this app! I can no longer print directly from my smart phone. And if I can get the printer to work via the app it no longer lets me choose double sided printing!",
    "rating": 1,
    "userName": "Oh brother !",
    "date": "2025-05-16T20:12:10-07:00",
    "version": "1.20.4",
    "country": "au"
  },
  {
    "title": "Hard to connect",
    "review": "It is hard to connect but easy after connect",
    "rating": 3,
    "userName": "Um what the ligma",
    "date": "2025-05-16T01:24:23-07:00",
    "version": "1.20.4",
    "country": "au"
  },
  {
    "title": "Review",
    "review": "Very nice",
    "rating": 5,
    "userName": "Yeanaf Ullah Abean",
    "date": "2025-05-05T04:35:09-07:00",
    "version": "1.20.4",
    "country": "au"
  },
  {
    "title": "Frustrated setting up   As far as scanning and on line manual",
    "review": "Printer",
    "rating": 1,
    "userName": "NannyBowen",
    "date": "2025-03-28T19:01:37-07:00",
    "version": "1.20.4",
    "country": "au"
  },
  {
    "title": "Not working",
    "review": "Bad connection to mobile devices p, colour not true, app,very clunky and hard to use.",
    "rating": 1,
    "userName": "LeeNesbitt",
    "date": "2025-03-24T03:53:48-07:00",
    "version": "1.20.4",
    "country": "au"
  },
  {
    "title": "Horrible app",
    "review": "Wish I could give a -5 rating. Horrible app and printer never being able to connect to the wifi",
    "rating": 1,
    "userName": "diet_durian",
    "date": "2025-03-16T18:40:27-07:00",
    "version": "1.20.2",
    "country": "au"
  },
  {
    "title": "Brother to the rescue",
    "review": "I love my Brother printer & app. THE easiest to set up I’ve experienced by far! They all say…so easy but this one IS the other 3 I’ve tried are collecting dust because I couldn’t use them….they were not easy to set up!",
    "rating": 5,
    "userName": "Mother likes Brother",
    "date": "2025-02-24T18:27:11-07:00",
    "version": "1.20.1",
    "country": "au"
  },
  {
    "title": "Could be better",
    "review": "App could be better. Would be good if you could scan using your camera like HP. Changed to brother from HP and miss that function",
    "rating": 1,
    "userName": "Bring back old version of app",
    "date": "2025-02-19T22:49:52-07:00",
    "version": "1.20.1",
    "country": "au"
  },
  {
    "title": "Just works, that’s all you can ever ask for",
    "review": "After grinding away with a useless HP printer I finally bought a brother MFC-j6540DW and it works seamlessly with this app and prints without fault, so lightening fast I wish I’d invested years ago. Increasing size is so easy. Love the app and the machine.",
    "rating": 5,
    "userName": "Hubycfhihfc",
    "date": "2025-02-10T14:01:18-07:00",
    "version": "1.20.1",
    "country": "au"
  },
  {
    "title": "Worked really good the first time",
    "review": "Really difficult to reconnect wirelessly every single time pretty good when it works though I wanna add to this it’s still rubbish",
    "rating": 1,
    "userName": "Hugh Jarmz",
    "date": "2025-02-09T14:49:03-07:00",
    "version": "1.20.1",
    "country": "au"
  },
  {
    "title": "Terrible",
    "review": "Forever loosing connection… bring back cables!!!!",
    "rating": 1,
    "userName": "Snagglebritches",
    "date": "2025-02-06T17:19:03-07:00",
    "version": "1.20.1",
    "country": "au"
  },
  {
    "title": "Printing poorly",
    "review": "Unable to print color",
    "rating": 1,
    "userName": "RaghunandanManjunath12041981",
    "date": "2025-01-10T20:57:10-07:00",
    "version": "1.20.0",
    "country": "au"
  },
  {
    "title": "App is not working",
    "review": "Useless ask all the info and can’t event recognise its own product model number and asked to enter manually details of the printer\nNot worth \nJust a waste of time",
    "rating": 1,
    "userName": "dom1n1ch1",
    "date": "2025-01-02T18:25:30-07:00",
    "version": "1.20.0",
    "country": "au"
  },
  {
    "title": "Not happy with this product",
    "review": "Settings are extremely complicated...not user friendly...it's frustrating when your new printer suddenly stop scanning and do occasional printing. Not happy at all with this product.",
    "rating": 1,
    "userName": "MJA-Piya",
    "date": "2024-12-04T14:08:01-07:00",
    "version": "1.19.0",
    "country": "au"
  },
  {
    "title": "So difficult to set up",
    "review": "The set up was 30 minutes of button pressing I won’t get back. It tells you change a password, you do that and there’s no ‘ok’ button it just says settings. Apprent settings and ok are synonymous. There’s very little wording, worse than ikea.",
    "rating": 1,
    "userName": "kvdn",
    "date": "2024-11-05T17:30:31-07:00",
    "version": "1.19.0",
    "country": "au"
  },
  {
    "title": "No it’s not",
    "review": "Worse printer to ever to set up wi fi \nPhone app settings.",
    "rating": 1,
    "userName": "Nightmare brother",
    "date": "2024-10-24T18:30:15-07:00",
    "version": "1.19.0",
    "country": "au"
  },
  {
    "title": "Doesn’t work",
    "review": "I can see printer but nothing else works!",
    "rating": 1,
    "userName": "Chris John m",
    "date": "2024-10-23T16:29:50-07:00",
    "version": "1.19.0",
    "country": "au"
  },
  {
    "title": "Trouble connecting",
    "review": "Sad.",
    "rating": 2,
    "userName": "Shelby77fragar",
    "date": "2024-10-09T14:47:44-07:00",
    "version": "1.19.0",
    "country": "au"
  },
  {
    "title": "Doesn’t work on latest iPhone",
    "review": "App doesn’t even open on iPhone 16 Pro Max",
    "rating": 1,
    "userName": "19815678",
    "date": "2024-10-09T00:20:16-07:00",
    "version": "1.19.0",
    "country": "au"
  },
  {
    "title": "Excellent",
    "review": "Thank you very much",
    "rating": 5,
    "userName": "Andy_2219",
    "date": "2024-09-16T16:48:48-07:00",
    "version": "1.19.0",
    "country": "au"
  },
  {
    "title": "Set up to wifi",
    "review": "Was very difficult to find and follow instructions. Should be auto easy.",
    "rating": 1,
    "userName": "Mr Macca dock head",
    "date": "2024-09-04T22:30:20-07:00",
    "version": "1.19.0",
    "country": "au"
  },
  {
    "title": "fantastic",
    "review": "I have waited 10 years to print directly from an ipad. Now I can do it, and scan and create multiple page PDFs. No need for any paid 3rd party software.",
    "rating": 5,
    "userName": "HK.......",
    "date": "2024-08-16T18:09:03-07:00",
    "version": "1.18.3",
    "country": "au"
  },
  {
    "title": "Not working",
    "review": "Set the printer up, worked a treat, now five days later it can’t be found, so no printing and no stars",
    "rating": 1,
    "userName": "Monty Rides North",
    "date": "2024-08-13T14:24:10-07:00",
    "version": "1.18.3",
    "country": "au"
  },
  {
    "title": "Rubbish",
    "review": "Doesn't work. You think you have a printer but actually you just have a big paper weight taking up space",
    "rating": 1,
    "userName": "Sunnymd44",
    "date": "2024-08-05T00:09:14-07:00",
    "version": "1.18.3",
    "country": "au"
  },
  {
    "title": "Brother print &scan app",
    "review": "I’ve identified my printer which is not on your list provided with the software request to download a printer app for my iPhone 12+ but your software for this request to download the app. Has me going around in circles for two days. I click the printer shown on the dot provided which takes me to your next page and nowhere can I see a download button just a whole lot of what looks like advertising your supposedly great product by which I find hard to believe if you can’t get a download page available easily. I clicked download complete app and got a fright when I saw how much you want for the app. Thought you would provide it with the purchase of your machine. If You don’t contact me with an easier way to down load a print, and as you have it linked with print and scan, I’m going to have to give the printer back to office works and write off this experience to bad blue on my part. \nContact me please not with just a standard thank you for buying your product but with real support. SEND ME A DOWN LOAD LINK. so I can make use of the product. \nThis is a test to see just how Brother support will respond and for me to see the reality of support. \nThank you \nStafford Whitwell",
    "rating": 1,
    "userName": "dwnunderoz",
    "date": "2024-08-02T23:24:38-07:00",
    "version": "1.18.3",
    "country": "au"
  },
  {
    "title": "Most annoying printer",
    "review": "Consistently disconnects itself from wifi\nThere should be a far more modern approach with the printers window\nAnnoying",
    "rating": 2,
    "userName": "K-c…",
    "date": "2024-08-01T16:28:03-07:00",
    "version": "1.18.3",
    "country": "au"
  },
  {
    "title": "Brother printer",
    "review": "I bought a new Brother printer DCP-J1200W it’s so hard to connect it to my phone",
    "rating": 1,
    "userName": "Zing reed",
    "date": "2024-07-28T01:02:53-07:00",
    "version": "1.18.1",
    "country": "au"
  },
  {
    "title": "Mr Basheer",
    "review": "Very good",
    "rating": 5,
    "userName": "adiraibasheer",
    "date": "2024-07-03T01:55:52-07:00",
    "version": "1.18.1",
    "country": "au"
  },
  {
    "title": "Brother printer assessment",
    "review": "Very time consuming to set up printer with a small keyboard. \nSetup instructions very sparse\nIssues with printing a web page with some images missing. Don’t know if that is caused by the file publisher setup, but strange",
    "rating": 3,
    "userName": "moth135",
    "date": "2024-07-01T04:03:27-07:00",
    "version": "1.18.1",
    "country": "au"
  },
  {
    "title": "Scanning",
    "review": "Very very good",
    "rating": 5,
    "userName": "Chaudau",
    "date": "2024-06-06T02:13:47-07:00",
    "version": "1.17.0",
    "country": "au"
  },
  {
    "title": "Printer app",
    "review": "It actually helps you to print instead of finding how to print it",
    "rating": 5,
    "userName": "Skk boy",
    "date": "2024-06-03T01:12:52-07:00",
    "version": "1.17.0",
    "country": "au"
  },
  {
    "title": "Mike",
    "review": "My previous HP would connect my Internet, iPhone and IPad so easily. Even I could scan or print easily. This Brother is sapping the life out of me. Every action I want to do is difficult to say the least. And or a complete problem. If it wasn’t for the in app chat service, I would have returned it already. Still might. It is so “Not” user friendly. Unless you are an I.T. Person. I’d steer clear of a Brother",
    "rating": 1,
    "userName": "Mikealongbeer",
    "date": "2024-05-26T05:52:16-07:00",
    "version": "1.17.0",
    "country": "au"
  },
  {
    "title": "Easy set up works well",
    "review": "Simply to use & convenient when I need to print directly from mobile rather than PC",
    "rating": 5,
    "userName": "Jason_4030",
    "date": "2024-05-16T20:38:17-07:00",
    "version": "1.17.0",
    "country": "au"
  },
  {
    "title": "Tempermental",
    "review": "Sometimes it prints. Sometimes it doesn’t. Sometimes I have to save a file from my email then print through the printer app to force it to print from my phone. This was an expensive investment for a lot of headache.",
    "rating": 1,
    "userName": "Mishnbrad",
    "date": "2024-05-11T18:14:09-07:00",
    "version": "1.17.0",
    "country": "au"
  },
  {
    "title": "S Ngai",
    "review": "Can not print both side of paper",
    "rating": 2,
    "userName": "Sunny Vaucluse",
    "date": "2024-04-10T00:29:40-07:00",
    "version": "1.16.1",
    "country": "au"
  },
  {
    "title": "Printer and app no good",
    "review": "Never connects. Same as the computer. The device is found on the same network and always comes up with a printer error. Terrible app and printer",
    "rating": 1,
    "userName": "Cheeeezy",
    "date": "2024-03-21T18:30:39-07:00",
    "version": "1.16.1",
    "country": "au"
  },
  {
    "title": "Brother MFC-J4340DW",
    "review": "Best printer I have ever had. Simple to use from desktop or mobile & no issues whatsoever. Excellent for emailing from printer too!! 👍",
    "rating": 5,
    "userName": "fingermark2",
    "date": "2024-03-12T19:49:30-07:00",
    "version": "1.16.1",
    "country": "au"
  },
  {
    "title": "Unsuspected charge",
    "review": "Originally stated no charge to be made unless a purchase was made, card details added, without a purchase, $20 charged \nAnd still can not access my printer \nWifi accessible and waln cable plugged in",
    "rating": 1,
    "userName": "Hendo99909",
    "date": "2024-03-06T03:35:08-07:00",
    "version": "1.16.1",
    "country": "au"
  },
  {
    "title": "Cannot connect via Wifi",
    "review": "Couldn’t connect via wifi after setup,",
    "rating": 1,
    "userName": "Peter Feng",
    "date": "2024-02-14T23:03:11-07:00",
    "version": "1.16.0",
    "country": "au"
  },
  {
    "title": "Nick",
    "review": "Works very well indeed",
    "rating": 4,
    "userName": "Lord tw",
    "date": "2024-02-13T22:27:46-07:00",
    "version": "1.16.0",
    "country": "au"
  },
  {
    "title": "Easy to use",
    "review": "Can’t stack printing from your phone. Admittedly this could be user error. I am a disgrace to my generation as far as technology goes.",
    "rating": 4,
    "userName": "customerjen",
    "date": "2024-01-22T21:46:29-07:00",
    "version": "1.16.0",
    "country": "au"
  },
  {
    "title": "Should have bought a Hp",
    "review": "Recently bought this printer on advice of salesman due to our 7 yr old HP dying, this printer is a pain won’t connect to our Apple phones, app is a painful experience, our Mac book pro unless LAN wired won’t print if wifi connected. A waste of money should of just paid the extra money for the HP",
    "rating": 1,
    "userName": "Pumawy",
    "date": "2023-12-16T01:43:35-07:00",
    "version": "1.15.1",
    "country": "au"
  },
  {
    "title": "Unnecessary updates",
    "review": "This app worked fine until you improved it. Now it chops the edges off my photos and will NOT LET ME EXPAND TO BOUNDARIES to encompass the whole item.",
    "rating": 1,
    "userName": "K&D Parris",
    "date": "2023-12-01T16:24:40-07:00",
    "version": "1.15.0",
    "country": "au"
  },
  {
    "title": "Brilliant works great!",
    "review": "Using the Brother app to control printer remotely and even print photo album from iPhone very simple to use.  Great machine the Brother MFC-J6940DW excellent and fast picture where pretty clear on crappy paper so l would assume on photo or quality paper to be better. No leaks or runs.  Impressive home office machine.",
    "rating": 5,
    "userName": "RareSense",
    "date": "2023-11-19T02:38:18-07:00",
    "version": "1.15.0",
    "country": "au"
  },
  {
    "title": "Plays a lot doesn’t respond",
    "review": "Wen try to print need to keep adding wifi password do not connect to phone",
    "rating": 2,
    "userName": "Sergio cig",
    "date": "2023-11-01T13:15:12-07:00",
    "version": "1.14.0",
    "country": "au"
  },
  {
    "title": "App keeps crashing on iOS can’t set up my new printer",
    "review": "I’ve tried the connection app on two different phones about ten times now. The connection app keeps crashing after the printer connects to my phone. Super terrible as brother doesn’t seem to offer a desktop setup app for Mac users. I will have to look at returning my printer to the store if I can’t get it set up.",
    "rating": 1,
    "userName": "Tepid",
    "date": "2023-10-27T17:51:54-07:00",
    "version": "1.14.0",
    "country": "au"
  },
  {
    "title": "I mean it’s fine… but",
    "review": "Other brands are air print without the need to use an app. I used to be able to print straight from my phone. Now I need to save it on the phone, open an app, then print it from there. It’s not a huge hassle but also not particularly modern",
    "rating": 1,
    "userName": "adamsnel",
    "date": "2023-10-26T17:17:01-07:00",
    "version": "1.14.0",
    "country": "au"
  },
  {
    "title": "Super",
    "review": "Very easy to do staff",
    "rating": 5,
    "userName": "abdullahira",
    "date": "2023-09-14T07:11:38-07:00",
    "version": "1.13.1",
    "country": "au"
  },
  {
    "title": "Setting up app on iPhone omg nightmare",
    "review": "They app has been installed 3 times will not seem to talk to printer and app keeps closing on phone without scanning or printing \nGave up and went to office works and paid to have invoices scanned \nNOT Happy",
    "rating": 1,
    "userName": "Euroleopard",
    "date": "2023-09-08T04:22:39-07:00",
    "version": "1.13.1",
    "country": "au"
  },
  {
    "title": "Please improve pdf file compression",
    "review": "Pdf file compression for this app seems to be a lot worse than the Brother iPrint application for PC.\n45MB vs 5 MB for same scan resolution. Many organisations don’t accept large uploaded files which then makes scanning using this app a non starter.",
    "rating": 3,
    "userName": "Thoorone",
    "date": "2023-08-29T21:48:25-07:00",
    "version": "1.13.0",
    "country": "au"
  },
  {
    "title": "Great for home use",
    "review": "Easy to connect and great quality (far better than Canon which was my previous)",
    "rating": 5,
    "userName": "Where's the paper123450",
    "date": "2023-06-25T23:34:09-07:00",
    "version": "1.11.1",
    "country": "au"
  },
  {
    "title": "Great Printer for a small business or for home use",
    "review": "This is a great printer for use at home either as a printer for work or office works. Prints really well and very easy to setup. It can print from a phone app and also from your PC or Mac if you connect to the same wifi. I highly recommend buying this printer",
    "rating": 5,
    "userName": "Lescoolx2",
    "date": "2023-05-12T15:16:31-07:00",
    "version": "1.11.0",
    "country": "au"
  },
  {
    "title": "Love it",
    "review": "Have only had a short while but works perfectly so far and very easy to use",
    "rating": 5,
    "userName": "Lightupmynight",
    "date": "2023-04-29T23:56:52-07:00",
    "version": "1.11.0",
    "country": "au"
  },
  {
    "title": "Printer",
    "review": "Not user friendly",
    "rating": 1,
    "userName": "Frosty1963",
    "date": "2023-04-07T03:30:16-07:00",
    "version": "1.10.3",
    "country": "au"
  },
  {
    "title": "Useless App",
    "review": "This is a useless app from Brother since it can see the printer on IPhone but when you select something to print, it says it cannot find air printer..",
    "rating": 1,
    "userName": "Trinco55",
    "date": "2023-04-05T00:52:45-07:00",
    "version": "1.10.3",
    "country": "au"
  },
  {
    "title": "Easy",
    "review": "The app is very easy and clean to use",
    "rating": 5,
    "userName": "Hughncath2",
    "date": "2023-02-26T22:06:45-07:00",
    "version": "1.10.1",
    "country": "au"
  },
  {
    "title": "Easy",
    "review": "Easygoing and easy set up",
    "rating": 5,
    "userName": "Bob your Aunty",
    "date": "2022-06-28T17:27:05-07:00",
    "version": "1.6.0",
    "country": "au"
  },
  {
    "title": "Great app",
    "review": "App works very well. I wonder why I can’t use AirPrint on MFC -2713DW",
    "rating": 5,
    "userName": "sam 567",
    "date": "2022-05-08T07:06:30-07:00",
    "version": "1.4.1",
    "country": "au"
  },
  {
    "title": "Can’t see my printer even from direct IP address",
    "review": "Every other device on my network can see and print to my Brother MFC, but this app can’t see it, even when I directly enter the IP address… useless",
    "rating": 1,
    "userName": "Theorocksau",
    "date": "2022-03-26T00:05:37-07:00",
    "version": "1.3.2",
    "country": "au"
  },
  {
    "title": "See it up. Then 4 days later it will not connect",
    "review": "See it up. Then 4 days later it will not connect and says that it is all working",
    "rating": 1,
    "userName": "H_H4",
    "date": "2022-01-15T23:03:56-07:00",
    "version": "1.2.2",
    "country": "au"
  },
  {
    "title": "App is horrible",
    "review": "When i try to scan a document, it always show offline status and says the machine is not connected to same network. I had to redo the whole connecting process once again to connect the app and use it. however printing work fine with default settingeven if app is not scanning. Please fix this issue.",
    "rating": 1,
    "userName": "AnKuV",
    "date": "2026-01-02T21:50:24-07:00",
    "version": "1.22.1",
    "country": "in"
  },
  {
    "title": "App printing too slow",
    "review": "Aint working in lan , have to connect printer every time.",
    "rating": 1,
    "userName": "Arshpreet aulakh",
    "date": "2025-11-10T09:45:26-07:00",
    "version": "1.21.5",
    "country": "in"
  },
  {
    "title": "Shijo Chakola DCP-T 420W",
    "review": "Excellent",
    "rating": 5,
    "userName": "Chakola 3648",
    "date": "2025-09-27T21:22:26-07:00",
    "version": "1.21.2",
    "country": "in"
  },
  {
    "title": "Don’t fall for them",
    "review": "Compared to Epson HP etc the connectivity is a huge issue and WiFi printing is almost non existent",
    "rating": 1,
    "userName": "Parantapsingh",
    "date": "2025-09-16T22:00:41-07:00",
    "version": "1.21.1",
    "country": "in"
  },
  {
    "title": "Useless and painful",
    "review": "DCP-T530DW is not user friendly, every time it disconnects from network, and a painful process to reconnect.",
    "rating": 1,
    "userName": "Remo Dro",
    "date": "2025-09-03T18:22:55-07:00",
    "version": "1.21.1",
    "country": "in"
  },
  {
    "title": "Instruction manual",
    "review": "Not user friendly , instruction manuals not clear, had to see many videos to check how this works",
    "rating": 2,
    "userName": "Buyeronce",
    "date": "2025-08-18T09:26:16-07:00",
    "version": "1.21.0",
    "country": "in"
  },
  {
    "title": "Wireless print does not work",
    "review": "Wireless print not working . Configuration reset by itself . Firmware update not working though I am on same network. It’s waste",
    "rating": 1,
    "userName": "Naraini",
    "date": "2025-07-20T01:49:22-07:00",
    "version": "1.20.5",
    "country": "in"
  },
  {
    "title": "Poor",
    "review": "Frequently it fails to accept Wi-Fi print command",
    "rating": 1,
    "userName": "delivery guy - excellent",
    "date": "2025-07-03T08:54:25-07:00",
    "version": "1.20.5",
    "country": "in"
  },
  {
    "title": "Intermittent offline showing",
    "review": "After setup the printer intermittently printer offline showing",
    "rating": 5,
    "userName": "amazon echo dot",
    "date": "2025-06-22T23:44:34-07:00",
    "version": "1.20.5",
    "country": "in"
  },
  {
    "title": "Brother T530DW",
    "review": "Very fast and duplex mode is amazing for Home and office",
    "rating": 5,
    "userName": "Raghavnu",
    "date": "2025-06-07T04:08:28-07:00",
    "version": "1.20.5",
    "country": "in"
  },
  {
    "title": "Best",
    "review": "Nice for printing",
    "rating": 5,
    "userName": "Raajakiya",
    "date": "2025-05-25T19:00:38-07:00",
    "version": "1.20.4",
    "country": "in"
  },
  {
    "title": "Non functional duplex option",
    "review": "when legal paper is selected then the duplex printing is unavailable, which was not told by the sales team at the time of buying the machine. kindly, fix this bug urgently.",
    "rating": 3,
    "userName": "sammalhotra",
    "date": "2025-05-11T07:10:19-07:00",
    "version": "1.20.4",
    "country": "in"
  },
  {
    "title": "Everything is running good but now app is crashing",
    "review": "After last update app is continuously crashing while showing setting up. I have important documents in app now I don’t know if i delete the app then documents will delete it not. And this app should rename to print utility or brother print etc.\nAnd app should rename to brother print or similar to these so that easy to find.",
    "rating": 3,
    "userName": "Shubham Jindam",
    "date": "2025-05-02T12:11:37-07:00",
    "version": "1.20.4",
    "country": "in"
  },
  {
    "title": "App crashes",
    "review": "App crashes when opening",
    "rating": 1,
    "userName": "Benforall",
    "date": "2025-03-11T05:28:48-07:00",
    "version": "1.20.1",
    "country": "in"
  },
  {
    "title": "No option to print odd even pages",
    "review": "Printing odd even pages is useful for manual duplex printing. This is used since before duplex printing was available.",
    "rating": 2,
    "userName": "bytesandbots",
    "date": "2025-01-23T22:20:52-07:00",
    "version": "1.20.0",
    "country": "in"
  },
  {
    "title": "Not user friendly",
    "review": "Printing option is not actually wireless as we have to go to machine all the time to remove it from sleep mode so that printer can take the command",
    "rating": 1,
    "userName": "Abds_ans",
    "date": "2025-01-05T10:49:17-07:00",
    "version": "1.20.0",
    "country": "in"
  },
  {
    "title": "Need a call back from customer care",
    "review": "Hi pls note",
    "rating": 5,
    "userName": "Abijith Sabareesh",
    "date": "2024-08-05T00:14:23-07:00",
    "version": "1.18.3",
    "country": "in"
  },
  {
    "title": "Very useful",
    "review": "Very useful application",
    "rating": 5,
    "userName": "Bhavik10976",
    "date": "2024-08-03T09:20:16-07:00",
    "version": "1.18.3",
    "country": "in"
  },
  {
    "title": "but could be better.!!",
    "review": "The app need a lot of improvements ,their are features such as id card scanning and booklet printing of pdf which is missing in the mobile version, which is a feature of the printer. There is a ADF which is one of this printers highlights but there is no option to take a 2 sided scans; like there could have been an option in scan for 2 sided and after one side the person could manually flip the pages and in software it could be rearranged into the final output. And speaking of rearranging there is no facility to rearrange scanned pages; like a drag feature is something that would be really useful. Developer please consider adding these in the next update..!! Other than that the app is pretty great in terms of look and usability.!",
    "rating": 2,
    "userName": "AshinSanthosh",
    "date": "2024-06-17T11:30:17-07:00",
    "version": "1.18.1",
    "country": "in"
  },
  {
    "title": "New Bugs added with the new update",
    "review": "Instead removing bugs, the new update added new bugs, now the app can’t even connect to the printer and asks to connect the printer to the same wifi network, even though the printer is connected to the same network. The update has ruined the experience, now i can’t even scan a book peacefully.",
    "rating": 1,
    "userName": "@21gunherald",
    "date": "2024-04-26T23:46:41-07:00",
    "version": "1.17.0",
    "country": "in"
  },
  {
    "title": "Nice application",
    "review": "Everything is easy and good. Please add the option to enable print on both sides.",
    "rating": 4,
    "userName": "resan123as",
    "date": "2024-01-10T03:41:23-07:00",
    "version": "1.16.0",
    "country": "in"
  },
  {
    "title": "Very difficult to use",
    "review": "Very difficult to use",
    "rating": 1,
    "userName": "dagur haresh",
    "date": "2023-09-21T11:43:32-07:00",
    "version": "1.13.1",
    "country": "in"
  },
  {
    "title": "Crashes on launch",
    "review": "Totally unusable, can't even get it to open.",
    "rating": 1,
    "userName": "apppleNick",
    "date": "2023-09-07T09:13:39-07:00",
    "version": "1.13.0",
    "country": "in"
  },
  {
    "title": "BORDERLESS PRINT",
    "review": "Pl again come up with previous version of borderless printing. current version is not supporting the feature.",
    "rating": 2,
    "userName": "+ behara +",
    "date": "2023-08-08T12:14:52-07:00",
    "version": "1.13.0",
    "country": "in"
  },
  {
    "title": "Doesn’t function well on iPhone 13 Pro",
    "review": "Just changed my iPhone. The app was a charm on older iPhone and connected with the Brother DCP-525W like a charm.  Since changing the mobile the app always shows the printer is offline even when I have pressed the power button on the printer to turn it on. I have to literally delete the app and reinstall the app after which it will function ok for the that particular instance. But once again if a new command is given after some time, the same cycle repeats itself.",
    "rating": 1,
    "userName": "Bonemaster23",
    "date": "2023-03-24T10:09:01-07:00",
    "version": "1.10.2",
    "country": "in"
  },
  {
    "title": "Works smooth.",
    "review": "The app works really smooth, no issues yet.",
    "rating": 5,
    "userName": "Asad08",
    "date": "2022-09-27T00:48:01-07:00",
    "version": "1.7.1",
    "country": "in"
  }
]